Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de

source: Code name for the :term:`Root Cause Analysis service <Root Cause Analysis (RCA) service (Vitrage)>`.
de: Code name für den :term:`Root Cause Analysis service <Root Cause Analysis (RCA) service (Vitrage)>`.

source: Code name for the :term:`Software Development Lifecycle Automation service <Software Development Lifecycle Automation service (solum)>`.
de: Codename für den :Begriff:`Software Development Lifecycle Automation Service <Software Development Lifecycle Automation Service (solum)>`.

source: Code name of the :term:`Key Manager service <Key Manager service (barbican)>`.
de: Codename des :terms:`Key Manager Service <Key Manager Service (barbican)>`.

source: Codename for :term:`Block Storage service <Block Storage service (cinder)>`.
de: Codename für :term:`Block Storage service <Block Storage service (cinder)>`.

source: Codename for OpenStack :term:`Compute service <Compute service (nova)>`.
de: Codename für OpenStack :term:`Compute service <Compute service (nova)>`.

source: Codename for OpenStack :term:`Database service <Database service (trove)>`.
de: Codename für OpenStack :term:`Datenbankdienst <Datenbankdienst (trove)>`.

source: Codename for OpenStack :term:`Monitoring <Monitoring (monasca)>`.
de: Codename für OpenStack :term:`Monitoring <Monitoring (monasca)>`.

source: Codename for OpenStack :term:`Networking service <Networking Service (neutron)>`.
de: Codename für OpenStack :term:`Networking Service <Networking Service (neutron)>`.

source: Codename for OpenStack :term:`Object Storage service<Object Storage service (swift)>`.
de: Codename für OpenStack :term:`Object Storage service<Object Storage service (swift)>`.

source: Codename for OpenStack :term:`Shared File Systems service<Shared File Systems service (manila)>`.
de: Codename für OpenStack :term:`Shared File Systems service<Shared File Systems service (manila)>`.

source: Codename for the :term:`Application Catalog service <Application Catalog service (murano)>`.
de: Codename für den :Begriff:`Anwendungskatalogdienst <Anwendungskatalogdienst (murano)>`.

source: Codename for the :term:`Bare Metal service <Bare Metal service (ironic)>`.
de: Codename für den :term:`Bare Metal Dienst <Bare Metal service (ironic)>`.

source: Codename for the :term:`Benchmark service<Benchmark service (rally)>`.
de: Codename für den :Begriff:`Benchmarkdienst<Benchmarkdienst (rally)>`.

source: Codename for the :term:`Common Libraries project<Common Libraries (oslo)>`.
de: Codename für den :Begriff:`Common Libraries project<Common Libraries (oslo)>`.

source: Codename for the :term:`Dashboard <Dashboard (horizon)>`.
de: Codename für das :term:`Dashboard <Dashboard (horizon)>`.

source: Codename for the :term:`Data Processing service<Data Processing service (sahara)>`.
de: Codename für den :Begriff:`Datenverarbeitungsdienst<Datenverarbeitungsdienst (Sahara)>`.

source: Codename for the :term:`Image service<Image service (glance)>`.
de: Codename für den :Begriff:`Abbilddienst<Abbilddienst (glance)>`.

source: Codename for the :term:`Message service <Message service (zaqar)>`.
de: Codename für den :Begriff:`Message Service <Message Service (zaqar)>`.

source: Codename for the :term:`Orchestration service <Orchestration service (heat)>`.
de: Codename für den :term:`Orchestrierungsdienst <Orchestration service (heat)>`.

source: Codename of the :term:`Identity service <Identity service (keystone)>`.
de: Codename des :Begriffs:`Identitätsdienst <Identitätsdienst (Keystone)>`.

source: Collection of Compute components that represent the global state of the cloud; talks to services, such as Identity authentication, Object Storage, and node/storage workers through a queue.
de: Sammlung von Compute-Komponenten, die den globalen Zustand der Cloud repräsentieren; spricht mit Diensten wie Identity Authentication, Object Storage und Node/Storage Workern über eine Warteschlange.

source: Collective name for the Object Storage object services, container services, and account services.
de: Sammelname für die Objektdienste Objektspeicher, Containerdienste und Kontendienste.

source: Collective term for Object Storage components that provide additional functionality.
de: Sammelbegriff für Komponenten der Objektspeicherung, die zusätzliche Funktionalität bieten.

source: Collective term for a group of Object Storage components that processes queued and failed updates for containers and objects.
de: Sammelbegriff für eine Gruppe von Objektspeicherkomponenten, die Warteschlangen- und fehlgeschlagene Aktualisierungen für Container und Objekte verarbeitet.

source: Combination of a URI and UUID used to access Image service VM images through the image API.
de: Kombination aus URI und UUID für den Zugriff auf Abbild-Dienst VM-Abbilder über die Abbild-API.

source: Command prompts
de: Befehlsaufforderungen

source: Common Internet File System (CIFS)
de: Gemeinsames Internet-Dateisystem (CIFS)

source: Common Libraries (oslo)
de: Allgemeine Bibliotheken (oslo)

source: Community project that captures Compute AMQP communications; useful for debugging.
de: Community-Projekt, das die Compute AMQP-Kommunikation erfasst; nützlich für das Debugging.

source: Community project that uses shell scripts to quickly build complete OpenStack development environments.
de: Gemeinschaftliches Projekt, das Shell-Skripte zum schnellen Aufbau einer kompletten OpenStack Entwicklungsumgebung benutzt.

source: Community project used to run automated tests against the OpenStack API.
de: Gemeinschaftsprojekt verwendet, um automatisierte Tests gegen die OpenStack API auszuführen.

source: Companies that rent specialized applications that help businesses and organizations provide additional services with lower cost.
de: Unternehmen, die spezialisierte Anwendungen, die Unternehmen und Organisationen helfen, zusätzliche Dienste mit niedrigeren Kosten zu mieten.

source: Component of Identity that provides a rule-management interface and a rule-based authorization engine.
de: Komponente von Identity, die eine Regel-Management-Schnittstelle und eine regelbasierte Berechtigungs-Engine zur Verfügung stellt.

source: Compute service (nova)
de: Compute Dienst (nova)

source: Computer that provides explicit services to the client software running on that system, often managing a variety of computer operations. A server is a VM instance in the Compute system. Flavor and image are requisite elements when creating a server.
de: Computer, der explizite Dienste für die Client-Software bereitstellt, die auf diesem System läuft und oft eine Vielzahl von Computeroperationen verwaltet. Ein Server ist eine VM-Instanz im Compute-System. Flavor und Image sind notwendige Elemente bei der Erstellung eines Servers.

source: Configurable option within Object Storage to limit database writes on a per-account and/or per-container basis.
de: Konfigurierbare Option innerhalb von Object Storage zur Begrenzung von Datenbankbeschreibungen auf Konto- und/oder Containerbasis.

source: Configuration setting within RabbitMQ that enables or disables message acknowledgment. Enabled by default.
de: Konfigurationseinstellungen in RabbitMQ, die Nachrichtenbestätigungen aktivieren oder deaktivieren. Als Standard aktiviert.

source: Connected to by a direct consumer in RabbitMQ—Compute, the message can be consumed only by the current connection.
de: Verbunden mit einem direkten Verbraucher in RabbitMQ-Compute, kann die Nachricht nur durch die aktuelle Verbindung verwendet werden.

source: Container Infrastructure Management service (magnum)
de: Container Infrastructure Management Dienst (magnum)

source: Contains configuration information that Object Storage uses to reconfigure a ring or to re-create it from scratch after a serious failure.
de: Enthält Konfigurationsinformationen, die von Object Storage verwendet werden, um einen Ring neu zu konfigurieren oder ihn nach einem schwerwiegenden Fehler neu zu erstellen.

source: Contains information about a user as provided by the identity provider. It is an indication that a user has been authenticated.
de: Enthält Informationen über einen Benutzer, die vom Identitätsanbieter bereitgestellt werden. Es ist ein Hinweis darauf, dass ein Benutzer authentifiziert wurde.

source: Contains the locations of all Object Storage partitions within the ring.
de: Enthält die Speicherorte aller Objektspeicher-Partitionen innerhalb des Rings.

source: Contains the output from a Linux VM console in Compute.
de: Enthält die Ausgabe einer Linux-VM-Konsole in Compute.

source: Contractual obligations that ensure the availability of a service.
de: Vertragspflichten, die die Verfügbarkeit einer Dienstleistung sicherstellen.

source: Conventions
de: Konventionen

source: Converts an existing server to a different flavor, which scales the server up or down. The original server is saved to enable rollback if a problem occurs. All resizes must be tested and explicitly confirmed, at which time the original server is removed.
de: Konvertiert einen vorhandenen Server in einen anderen Geschmack, der den Server nach oben oder unten skaliert. Der ursprüngliche Server wird gespeichert, um das Rollback zu aktivieren, wenn ein Problem auftritt. Alle Größen müssen geprüft und explizit bestätigt werden, zu welchem Zeitpunkt der ursprüngliche Server entfernt wird.

source: Creates a full Object Storage development environment within a single VM.
de: Erstellt eine vollständige Object Storage Entwicklungsumgebung innerhalb einer einzigen VM.

source: Critical information about the risk of data loss or security issues.
de: Kritische Informationen über das Risiko von Datenverlust oder zu Sicherheitsproblemen.

source: Custom modules that extend some OpenStack core APIs.
de: Benutzerdefinierte Module, die einige OpenStack-Kern-APIs erweitern.

source: DNS record
de: DNS-Datensatz

source: DNS service (designate)
de: DNS Dienst (designate)

source: Daemon that provides DNS, DHCP, BOOTP, and TFTP services for virtual networks.
de: Ein Dämon, der die Dienst DNS, DHCP, BOOTP und TFTP für virtuelle Netzwerke bereitstellt.

source: Data Processing service (sahara)
de: Datenverarbeitungsdienst (Sahara)

source: Data loss prevention (DLP) software
de: Software zur Verhinderung von Datenverlust (DLP)

source: Data that is only known to or accessible by a user and used to verify that the user is who he says he is. Credentials are presented to the server during authentication. Examples include a password, secret key, digital certificate, and fingerprint.
de: Daten, die nur einem Benutzer bekannt oder zugänglich sind und verwendet werden, um zu überprüfen, dass der Benutzer der ist, für den er sich ausgibt. Anmeldeinformationen werden dem Server während der Authentifizierung präsentiert. Beispiele sind ein Passwort, ein geheimer Schlüssel, ein digitales Zertifikat und ein Fingerabdruck.

source: Database service (trove)
de: Datenbankservice (trove)

source: Defines resources for a cell, including CPU, storage, and networking. Can apply to the specific services within a cell or a whole cell.
de: Definiert Ressourcen für eine Zelle, einschließlich CPU, Speicher und Netzwerk. Kann auf die spezifischen Dienste innerhalb einer Zelle oder einer ganzen Zelle Anwendung finden.

source: Denial of service (DoS) is a short form for denial-of-service attack. This is a malicious attempt to prevent legitimate users from using a service.
de: Denial of Service (DoS) ist eine Kurzform für Denial-of-Service-Angriffe. Dies ist ein bösartiger Versuch, legitime Benutzer daran zu hindern, einen Dienst zu nutzen.

source: Depending on context, the core API is either the OpenStack API or the main API of a specific core project, such as Compute, Networking, Image service, and so on.
de: Je nach Kontext ist die Kern-API entweder die OpenStack API oder die Haupt-API eines bestimmten Kernprojekts wie Compute, Networking, Abbilddienst und so weiter.

source: Describes the parameters of the various virtual machine images that are available to users; includes parameters such as CPU, storage, and memory. Alternative term for flavor.
de: Beschreibt die Parameter der verschiedenen Virtual-Machine-Abbilder, die den Benutzern zur Verfügung stehen, einschließlich Parameter wie CPU, Speicher und Speicher. Alternativer Begriff für Variante.

source: Determines whether back-end members of a VIP pool can process a request. A pool can have several health monitors associated with it. When a pool has several monitors associated with it, all monitors check each member of the pool. All monitors must declare a member to be healthy for it to stay active.
de: Legt fest, ob Back-End-Mitglieder eines VIP-Pools eine Anfrage bearbeiten können. Ein Pool kann mehrere Gesundheitsmonitoren mit ihm verbunden haben. Wenn ein Pool mehrere Monitore mit ihm verbunden ist, überprüfen alle Monitore jedes Mitglied des Pools. Alle Monitore müssen ein Mitglied erklären, um gesund zu sein, damit es aktiv bleibt.

source: Device plugged into a PCI slot, such as a fibre channel or network card.
de: Gerät eingesteckt in einen PCI-Steckplatz, wie z.B. ein Fibre Channel oder eine Netzwerkkarte.

source: Disables server-side message acknowledgment in the Compute RabbitMQ. Increases performance but decreases reliability.
de: Deaktiviert die serverseitige Meldungsquittierung im Compute RabbitMQ. Erhöht die Leistung, verringert aber die Zuverlässigkeit.

source: Disk-based data storage generally represented as an iSCSI target with a file system that supports extended attributes; can be persistent or ephemeral.
de: Festplatten-basierte Datenspeicherung allgemein als iSCSI-target mit einem Dateisystem dargestellt, das erweiterte Attribute unterstützt; Kann persistent oder vergänglich sein.

source: Disk-based virtual memory used by operating systems to provide more memory than is actually available on the system.
de: Festplattenbasierter virtueller Speicher, der von Betriebssystemen verwendet wird, um mehr Speicher bereitzustellen, als tatsächlich auf dem System verfügbar ist.

source: Distributed block storage system for QEMU, supported by OpenStack.
de: Verteiltes Blockspeichersystem für QEMU, unterstützt von OpenStack.

source: Distributes partitions proportionately across Object Storage devices based on the storage capacity of each device.
de: Verteilt Partitionen proportional über Objektspeichergeräte basierend auf der Speicherkapazität jedes Geräts.

source: Documentation
de: Dokumentation

source: Documentation feedback
de: Dokumentation Feedback

source: During the set up or testing of OpenStack, you might have questions about how a specific task is completed or be in a situation where a feature does not work correctly. Use the `ask.openstack.org <https://ask.openstack.org>`_ site to ask questions and get answers. When you visit the `Ask OpenStack <https://ask.openstack.org>`_ site, scan the recently asked questions to see whether your question has already been answered. If not, ask a new question. Be sure to give a clear, concise summary in the title and provide as much detail as possible in the description. Paste in your command output or stack traces, links to screen shots, and any other information which might be useful.
de: Während des Aufbaus oder Testens von OpenStack können Sie Fragen haben, wie eine bestimmte Aufgabe erledigt wurde oder nicht. Verwenden Sie die `ask.openstack.org <https://ask.openstack.org>` _ Webseite, um Fragen zu stellen und Antworten zu bekommen. Wenn Sie die `Ask OpenStack <https://ask.openstack.org>` _ Website besuchen, scannen Sie die Fragen, die bislang gestellt wurden. Wenn Ihre Frage nicht dabei ist, stellen Sie eine neue Frage. Achten Sie darauf, eine klare, prägnante Zusammenfassung im Titel und so viel Detail wie möglich in der Beschreibung zu geben. Fügen Sie Befehlsausgabe oder Stacktracks und alle anderen Informationen bei, die nützlich sein könnten.

source: EBS boot volume
de: EBS Boot-Datenträger

source: EC2 Compatibility API
de: EC2 Kompatibilität API

source: EC2 access key
de: EC2 Zugriffsschlüssel

source: EC2 secret key
de: EC2 Geheimschlüssel

source: Each OpenStack release has a code name. Code names ascend in alphabetical order: Austin, Bexar, Cactus, Diablo, Essex, Folsom, Grizzly, Havana, Icehouse, Juno, Kilo, Liberty, Mitaka, Newton, Ocata, Pike, Queens, and Rocky. Code names are cities or counties near where the corresponding OpenStack design summit took place. An exception, called the Waldon exception, is granted to elements of the state flag that sound especially cool. Code names are chosen by popular vote.
de: Jede OpenStack-Version hat einen Codenamen. Die Codenamen werden in alphabetischer Reihenfolge angezeigt: Austin, Bexar, Kaktus, Diablo, Essex, Folsom, Grizzly, Havanna, Icehouse, Juno, Kilo, Liberty, Mitaka, Newton, Ocata, Pike, Queens und Rocky. Codenamen sind Städte oder Landkreise in der Nähe des jeweiligen OpenStack-Design-Gipfels. Eine Ausnahme, die Waldon-Exception genannt wird, wird für Elemente der Staatsflagge gewährt, die besonders cool klingen. Die Codenamen werden durch öffentliche Abstimmung gewählt.

source: Either a soft or hard reboot of a server. With a soft reboot, the operating system is signaled to restart, which enables a graceful shutdown of all processes. A hard reboot is the equivalent of power cycling the server. The virtualization platform should ensure that the reboot action has completed successfully, even in cases in which the underlying domain/VM is paused or halted/stopped.
de: Entweder ein Soft- oder Hard-Reboot eines Servers. Bei einem Soft-Reboot wird dem Betriebssystem ein Neustart signalisiert, der ein problemloses Herunterfahren aller Prozesse ermöglicht. Ein harter Neustart ist das Äquivalent zum Power Cycling des Servers. Die Virtualisierungsplattform sollte sicherstellen, dass die Neustart-Aktion erfolgreich abgeschlossen wurde, auch in Fällen, in denen die zugrundeliegende Domain/VM angehalten oder gehalten/stoppt wird.

source: Element of RabbitMQ that provides a response to an incoming MQ message.
de: Element von RabbitMQ, das eine Antwort auf eine eingehende MQ-Nachricht liefert.

source: Enables Compute and Networking integration, which enables Networking to perform network management for guest VMs.
de: Ermöglicht die Compute- und Networking-Integration, mit der Networking das Netzwerkmanagement für Gast-VMs durchführen kann.

source: Enables Compute to communicate with NetApp storage devices through the NetApp OnCommand Provisioning Manager.
de: Ermöglicht Compute die Kommunikation mit NetApp Storage-Geräten über den NetApp OnCommand Provisioning Manager.

source: Enables Networking to distribute incoming requests evenly between designated instances.
de: Ermöglicht es Networking, eingehende Anfragen gleichmäßig auf bestimmte Instanzen zu verteilen.

source: Enables a Linux bridge to understand a Networking port, interface attachment, and other abstractions.
de: Ermöglicht es einer Linux-Bridge, einen Netzwerkport, Schnittstellenanhänge und andere Abstraktionen zu verstehen.

source: Eucalyptus Kernel Image (EKI)
de: Eukalyptuskernel Abbild (EKI)

source: Eucalyptus Machine Image (EMI)
de: Eukalyptus Maschinenabbild (EMI)

source: Eucalyptus Ramdisk Image (ERI)
de: Eukalyptus Ramdisk Abbild (ERI)

source: Extension to iptables that allows creation of firewall rules that match entire "sets" of IP addresses simultaneously. These sets reside in indexed data structures to increase efficiency, particularly on systems with a large quantity of rules.
de: Erweiterung auf iptables, die die Erstellung von Firewall-Regeln ermöglicht, die mit allen "Sets" von IP-Adressen gleichzeitig übereinstimmen. Diese Sets befinden sich in indizierten Datenstrukturen, um die Effizienz zu erhöhen, insbesondere bei Systemen mit einer großen Anzahl von Regeln.

source: Facility in Compute that allows each virtual machine instance to have more than one VIF connected to it.
de: Einrichtung in Compute, die es jeder Instanz einer virtuellen Maschine ermöglicht, mehr als ein VIF mit ihr zu verbinden.

source: Feature in modern Ethernet networks that supports frames up to approximately 9000 bytes.
de: Eine Eigenschaft moderner Ethernet-Netzwerke, die Frame-Größen bis zu etwa 9000 Bytes ermöglicht.

source: Feature of certain network interface drivers that combines many smaller received packets into a large packet before delivery to the kernel IP stack.
de: Merkmal bestimmter Netzwerkschnittstellentreiber, das viele kleinere empfangene Pakete zu einem großen Paket kombiniert, bevor sie an den Kernel-IP-Stapel geliefert werden.

source: File system option that enables storage of additional information beyond owner, group, permissions, modification time, and so on. The underlying Object Storage file system must support extended attributes.
de: Dateisystemoption, die die Speicherung zusätzlicher Informationen über Besitzer, Gruppe, Berechtigungen, Änderungszeit und so weiter ermöglicht. Das zugrunde liegende Object Storage Dateisystem muss erweiterte Attribute unterstützen.

source: Filtering tool for a Linux bridging firewall, enabling filtering of network traffic passing through a Linux bridge. Used in Compute along with arptables, iptables, and ip6tables to ensure isolation of network communications.
de: Filtertool für eine Linux Bridging Firewall, das die Filterung des Netzwerkverkehrs über eine Linux Bridge ermöglicht. Wird in Compute zusammen mit Arptables, iptables und ip6tables verwendet, um die Isolierung der Netzwerkkommunikation sicherzustellen.

source: For IaaS, ability for a regular (non-privileged) account to manage a virtual infrastructure component such as networks without involving an administrator.
de: Für IaaS, die Möglichkeit für ein reguläres (nicht privilegiertes) Konto, eine virtuelle Infrastrukturkomponente wie Netzwerke zu verwalten, ohne einen Administrator einzuschalten.

source: For a given service, SFC is the abstracted view of the required service functions and the order in which they are to be applied.
de: Für einen gegebenen Dienst ist SFC die abstrahierte Sicht auf die erforderlichen Dienstfunktionen und die Reihenfolge, in der sie angewendet werden sollen.

source: For the available OpenStack documentation, see `docs.openstack.org <https://docs.openstack.org>`_.
de: Für verfügbare OpenStack Dokumentation schauen Sie auf `docs.openstack.org <https://docs.openstack.org>`_.

source: G
de: T

source: Generally, extra properties on an Image service image to which only cloud administrators have access. Limits which user roles can perform CRUD operations on that property. The cloud administrator can configure any image property as protected.
de: Im Allgemeinen sind zusätzliche Eigenschaften auf einem Abbilddienst-Abbild, auf das nur Cloud-Administratoren Zugriff haben. Begrenzt, welche Benutzerrollen CRUD-Operationen auf dieser Eigenschaft ausführen können. Der Cloud-Administrator kann jede Abbild-Eigenschaft als geschützt konfigurieren.

source: Give a clear, concise summary.
de: Liefern Sie eine klare und prägnante Zusammenfassung.

source: Gives guest VMs exclusive access to a PCI device. Currently supported in OpenStack Havana and later releases.
de: Gibt Gast-VMs exklusiven Zugang zu einem PCI-Gerät. Derzeit unterstützt in OpenStack Havanna und späteren Versionen.

source: Glossary
de: Glossar

source: Governs the ability of subjects to access objects, while enabling users to make policy decisions and assign security attributes. The traditional UNIX system of users, groups, and read-write-execute permissions is an example of DAC.
de: Gibt die Fähigkeit von Subjekten, auf Objekte zuzugreifen, während es Benutzern ermöglicht, Entscheidungsrichtlinien zu treffen und Sicherheitsattribute zuzuweisen. Das traditionelle UNIX-System von Benutzern, Gruppen und Read-Write-Execute-Berechtigungen ist ein Beispiel für DAC.
