Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de

source: The code name for the eleventh release of OpenStack. The design summit took place in Paris, France. Due to delays in the name selection, the release was known only as K. Because ``k`` is the unit symbol for kilo and the kilogram reference artifact is stored near Paris in the Pavillon de Breteuil in Sèvres, the community chose Kilo as the release name.
de: Der Codename für die elfte Version von OpenStack. Der Design-Gipfel fand in Paris, Frankreich, statt. Aufgrund von Verzögerungen bei der Namensauswahl war die Freigabe nur als K bekannt. Da ``k`` das Einheitensymbol für Kilo ist und das Kilogramm-Referenz-Artefakt bei Paris im Pavillon de Breteuil in Sèvres gespeichert ist, wählte die Gemeinde Kilo als Release-Namen.

source: The code name for the fifteenth release of OpenStack. The design summit will take place in Barcelona, Spain. Ocata is a beach north of Barcelona.
de: Der Codename für die fünfzehnte Version von OpenStack. Der Design-Gipfel findet in Barcelona, Spanien, statt. Ocata ist ein Strand nördlich von Barcelona.

source: The code name for the fourteenth release of OpenStack. The design summit took place in Austin, Texas, US. The release is named after "Newton House" which is located at 1013 E. Ninth St., Austin, TX. which is listed on the National Register of Historic Places.
de: Der Codename für die vierzehnte Version von OpenStack. Der Design Summit fand in Austin, Texas, USA statt. Die Version ist nach "Newton House" benannt, die bei 1013 E. Neunte Str., Austin, TX liegt, die im National Register of Historic Places aufgeführt ist.

source: The code name for the initial release of OpenStack. The first design summit took place in Austin, Texas, US.
de: Der Code-Name für die initiale Version von OpenStack. Der erste Design-Summit wurde abgehalten in Austin, Texas, USA.

source: The code name for the ninth release of OpenStack. The design summit took place in Hong Kong and Ice House is a street in that city.
de: Der Codename für die neunte Version von OpenStack. Der Design Summit fand in Hongkong statt und das Ice House ist eine Straße in dieser Stadt.

source: The code name for the seventeenth release of OpenStack. The design summit will take place in Sydney, Australia. The release is named after the Queens Pound river in the South Coast region of New South Wales.
de: Der Codename für die siebzehnte Version von OpenStack. Der Design-Gipfel findet in Sydney, Australien, statt. Das Release ist nach dem Queens Pound River in der South Coast Region von New South Wales benannt.

source: The code name for the seventh release of OpenStack. The design summit took place in San Diego, California, US and Grizzly is an element of the state flag of California.
de: Der Codename für die siebte Version von OpenStack. Der Design-Gipfel fand in San Diego, Kalifornien, USA statt und Grizzly ist ein Element der Staatsflagge von Kalifornien.

source: The code name for the sixteenth release of OpenStack. The design summit will take place in Boston, Massachusetts, US. The release is named after the Massachusetts Turnpike, abbreviated commonly as the Mass Pike, which is the easternmost stretch of Interstate 90.
de: Der Codename für die sechzehnte Version von OpenStack. Der Designsummit findet in Boston, Massachusetts, USA statt. Die Version wird nach dem Massachusetts Turnpike benannt, abgekürzt gemein als der Mass Pike, der die östlichste Strecke der Interstate 90 darstellt.

source: The code name for the tenth release of OpenStack. The design summit took place in Atlanta, Georgia, US and Juno is an unincorporated community in Georgia.
de: Der Code-Name für das zehnte Release von OpenStack. Der Design-Summit wurde in Atlanta, Georgia, USA abgehalten und Juno ist ein gemeindefreies Gebiet in Georgia.

source: The code name for the thirteenth release of OpenStack. The design summit took place in Tokyo, Japan. Mitaka is a city in Tokyo.
de: Der Codename für die dreizehnte Version von OpenStack. Der Design Summit fand in Tokio, Japan statt. Mitaka ist eine Stadt in Tokio.

source: The code name for the twelfth release of OpenStack. The design summit took place in Vancouver, Canada and Liberty is the name of a village in the Canadian province of Saskatchewan.
de: Der Codename für die zwölfte Version von OpenStack. Der Design-Gipfel fand in Vancouver, Kanada statt und Liberty ist der Name eines Dorfes in der kanadischen Provinz Saskatchewan.

source: The collaboration site for OpenStack.
de: Die Kollaborationsseite für OpenStack.

source: The cooperative threading model used by Python; reduces race conditions and only context switches when specific library calls are made. Each OpenStack service is its own thread.
de: Das von Python verwendete kooperative Threading-Modell reduziert die Race-Bedingungen und wechselt nur den Kontext, wenn bestimmte Bibliotheksaufrufe erfolgen. Jeder OpenStack-Dienst ist ein eigener Thread.

source: The current state of a guest VM image.
de: Der aktuelle Status eines Gast-VM-Abbildes.

source: The current status of a VM image in Image service, not to be confused with the status of a running instance.
de: Der aktuelle Status eines VM-Abbildes im Abbild-Dienst, nicht zu verwechseln mit dem Status einer laufenden Instanz.

source: The daemon, worker, or service that a client communicates with to access an API. API endpoints can provide any number of services, such as authentication, sales data, performance meters, Compute VM commands, census data, and so on.
de: Der Daemon, Arbeiter oder Dienst, mit dem ein Client kommuniziert, um auf eine API zuzugreifen. API-Endpunkte können eine beliebige Anzahl von Diensten bereitstellen, wie z. B. Authentifizierung, Verkaufsdaten, Leistungsmesser, Compute VM-Befehle, Zensusdaten usw.

source: The default message queue software used by OpenStack.
de: Die standardmäßige Nachrichtenwarteschlangensoftware, die von OpenStack verwendet wird.

source: The default panel that is displayed when a user accesses the dashboard.
de: Das Standardfenster, das angezeigt wird, wenn ein Benutzer auf das Dashboard zugreift.

source: The fibre channel protocol tunneled within Ethernet.
de: Das Fibre Channel Protokoll, getunnelt durch Ethernet.

source: The following Launchpad Bugs areas are available:
de: Die folgenden Launchpad-Bugs-Bereiche sind verfügbar:

source: The following Linux distributions provide community-supported packages for OpenStack:
de: Die folgenden Linuxdistributionen bieten Community-Unterstützung für OpenStack:

source: The following book explains how to use the command-line clients:
de: Das folgende Buch erläutert die Verwendung des Kommandozeileninterfaces:

source: The following books explain how to configure and run an OpenStack cloud:
de: Die folgenden Bücher erläutern die Konfiguration und den Betrieb von OpenStack Cloud:

source: The following documentation provides reference and guidance information for the OpenStack APIs:
de: Die folgende Dokumentation dient als Referenz und Information zu den OpenStack APIs:

source: The following guide provides information on how to contribute to OpenStack documentation:
de: Die folgende Anleitung beschreibt, wie man bei der OpenStack Dokumentation mitwirken kann:

source: The following guides explain how to install a Proof-of-Concept OpenStack cloud and its associated components:
de: Die folgenden Anleitungen erläutern die Installation einer Proof-of-Concept OpenStack Cloud und der zugehörigen Komponenten:

source: The following resources are available to help you run and use OpenStack. The OpenStack community constantly improves and adds to the main features of OpenStack, but if you have any questions, do not hesitate to ask. Use the following resources to get OpenStack support and troubleshoot your installations.
de: Die folgenden Ressourcen sind vorhanden, um Ihnen bei der Verwendung von OpenStack zu helfen. Die OpenStack Gemeinschaft fügt kontinuierlich neue Eigenschaften hinzu bzw. verbessert sie. Wenn Sie Fragen haben, zögern Sie nicht, sie zu stellen. Über die folgenden Ressourcen erhalten Sie Unterstützung und Hilfe zur Fehlersuche in Ihren Installationen.

source: The intelligence in the IPMI architecture, which is a specialized micro-controller that is embedded on the motherboard of a computer and acts as a server. Manages the interface between system management software and platform hardware.
de: Die Intelligenz in der IPMI-Architektur, die ein spezialisierter Mikrocontroller ist, der auf dem Motherboard eines Computers eingebettet ist und als Server fungiert. Verwaltet die Schnittstelle zwischen Systemmanagement-Software und Plattform-Hardware.

source: The main virtual communication line used by all AMQP messages for inter-cloud communications within Compute.
de: Die wichtigste virtuelle Kommunikationslinie, die von allen AMQP-Nachrichten für die Inter-Cloud-Kommunikation in Compute verwendet wird.

source: The method of storage used by horizon to track client sessions, such as local memory, cookies, a database, or memcached.
de: Die Methode der Speicherung, die von Horizont verwendet wird, um Clientsitzungen zu verfolgen, wie z. B. lokaler Speicher, Cookies, eine Datenbank oder Memcached.

source: The method that a service uses for persistent storage, such as iSCSI, NFS, or local disk.
de: Die Methode, die ein Dienst für die persistente Speicherung verwendet, z. B. iSCSI, NFS oder lokale Festplatte.

source: The most common web server software currently used on the Internet.
de: Die häufigste Webserver-Software, die derzeit im Internet verwendet wird.

source: The nova-api daemon provides access to nova services. Can communicate with other APIs, such as the Amazon EC2 API.
de: Der nova-api-Daemon ermöglicht den Zugriff auf nova-Dienste. Kann mit anderen APIs kommunizieren, wie z.B. der Amazon EC2 API.

source: The number of replicas of the data in an Object Storage ring.
de: Die Anzahl der Repliken der Daten in einem Objektspeicherring.

source: The open standard messaging protocol used by OpenStack components for intra-service communications, provided by RabbitMQ, Qpid, or ZeroMQ.
de: Das offene Standardmessaging-Protokoll, das von OpenStack-Komponenten für die Intra-Service-Kommunikation verwendet wird und von RabbitMQ, Qpid oder ZeroMQ bereitgestellt wird.

source: The persistent data store used to save and retrieve information for a service, such as lists of Object Storage objects, current state of guest VMs, lists of user names, and so on. Also, the method that the Image service uses to get and store VM images. Options include Object Storage, locally mounted file system, RADOS block devices, VMware datastore, and HTTP.
de: Der persistente Datenspeicher, der zum Speichern und Abrufen von Informationen für einen Dienst verwendet wird, wie z. B. Listen von Objektspeicherobjekten, aktueller Zustand von Gast-VMs, Listen von Benutzernamen usw. Außerdem die Methode, die der Image-Dienst verwendet, um VM-Images zu erhalten und zu speichern. Zu den Optionen gehören Objektspeicherung, lokal eingebundenes Dateisystem, RADOS-Blockgeräte, VMware-Datenspeicher und HTTP.

source: The person responsible for installing, configuring, and managing an OpenStack cloud.
de: Die Person, die für die Installation, Konfiguration und Verwaltung einer OpenStack-Cloud verantwortlich ist.

source: The person responsible for planning and maintaining an OpenStack installation.
de: Die Person, die für die Planung und Wartung einer OpenStack-Installation verantwortlich ist.

source: The point where a user interacts with a service; can be an API endpoint, the dashboard, or a command-line tool.
de: Der Punkt, an dem ein Benutzer mit einem Dienst interagiert; kann ein API-Endpunkt, das Dashboard oder ein Befehlszeilenwerkzeug sein.

source: The practice of placing one packet type within another for the purposes of abstracting or securing data. Examples include GRE, MPLS, or IPsec.
de: Die Praxis, einen Pakettyp in einen anderen zu platzieren, um Daten zu abstrahieren oder zu sichern. Beispiele sind GRE, MPLS oder IPsec.

source: The practice of utilizing a secondary environment to elastically build instances on-demand when the primary environment is resource constrained.
de: Die Praxis der Nutzung einer zweiten Umgebung, um Instanzen auf Anforderung elastisch aufzubauen, wenn die Resourcen der primäre Umgebung eingeschränkt sind.

source: The process associating a Compute floating IP address with a fixed IP address.
de: Der Prozess weist einem Computer eine bewegliche IP-Adresse eine feste IP-Adresse zu.

source: The process of automating IP address allocation, deallocation, and management. Currently provided by Compute, melange, and Networking.
de: Der Prozess der Automatisierung der IP-Adresszuweisung, der Freigabe und des Managements. Derzeit zur Verfügung gestellt von Compute, Melange und Networking.

source: The process of connecting a VIF or vNIC to a L2 network in Networking. In the context of Compute, this process connects a storage volume to an instance.
de: Der Prozess der Verbindung eines VIF oder vNIC zu einem L2-Netzwerk in Networking. Im Rahmen von Compute verbindet dieser Prozess ein Speicherdatenträger mit einer Instanz.

source: The process of copying data to a separate physical device for fault tolerance and performance.
de: Der Prozess des Kopierens von Daten auf ein separates physikalisches Gerät für Fehlertoleranz und Leistung.

source: The process of distributing Object Storage partitions across all drives in the ring; used during initial ring creation and after ring reconfiguration.
de: Der Prozess der Verteilung von Objektspeicher-Partitionen auf alle Laufwerke im Ring; wird bei der ersten Ringerstellung und nach der Ringrekonfiguration verwendet.

source: The process of filtering incoming network traffic. Supported by Compute.
de: Der Prozess der Filterung des eingehenden Netzwerkverkehrs. Unterstützt von Compute.

source: The process of finding duplicate data at the disk block, file, and/or object level to minimize storage use—currently unsupported within OpenStack.
de: Der Prozess des Auffindens doppelter Daten auf Festplattenblock-, Datei- und/oder Objektebene, um den Speicherverbrauch zu minimieren - derzeit nicht unterstützt von OpenStack.

source: The process of migrating one or all virtual machine (VM) instances from one host to another, compatible with both shared storage live migration and block migration.
de: Der Prozess des Migrierens einer oder aller Virtuelle Maschinen (VM) Instanzen von einem Host zu einem anderen, kompatibel mit Shared Storage Migration und Block Migration.

source: The process of moving a VM instance from one host to another.
de: Der Vorgang des Verschiebens einer VM-Instanz von einem Host zum anderen.

source: The process of putting a file into a virtual machine image before the instance is started.
de: Der Prozess des Einfügens einer Datei in ein Abbild einer virtuellen Maschine, bevor die Instanz gestartet wird.

source: The process of removing the association between a floating IP address and a fixed IP address. Once this association is removed, the floating IP returns to the address pool.
de: Verfahren zum Entfernen der Zuordnung zwischen einer freien IP-Adresse und einer festen IP-Adresse. Sobald diese Zuordnung aufgehoben ist, kehrt die Floating IP in den Adresspool zurück.

source: The process of removing the association between a floating IP address and fixed IP and thus returning the floating IP address to the address pool.
de: Der Prozess zur Löschung der Zuweisung von einer beweglichen IP-Adresse und festen IP-Adressen und Rückführung der beweglichen IP-Adresse in den Adressbestand.

source: The process of spreading client requests between two or more nodes to improve performance and availability.
de: Der Prozess der Verteilung von Client-Anfragen auf zwei oder mehr Knoten, um die Leistung und Verfügbarkeit zu verbessern.

source: The process of taking a floating IP address from the address pool so it can be associated with a fixed IP on a guest VM instance.
de: Der Prozess des Entnehmens einer freien IP-Adresse aus dem Adresspool, so dass sie mit einer festen IP-Adresse auf einer Gast-VM-Instanz verknüpft werden kann.

source: The process that confirms that the user, process, or client is really who they say they are through private key, secret token, password, fingerprint, or similar method.
de: Der Prozess, der bestätigt, dass der Benutzer, Prozess oder Client der ist fuer den er sich ausgibt durch privaten Schlüssel, geheimes Token, Passwort, Fingerabdruck oder eine ähnliche Methode ausgibt.

source: The project that aims to provide scalable, on demand, self service access to load-balancer services, in technology-agnostic manner.
de: Das Projekt, das darauf abzielt, einen skalierbaren, bedarfsgerechten Self-Service-Zugang zu Load-Balancer-Diensten auf technologie-agnostische Weise bereitzustellen.

source: The project that facilitates API client authentication, service discovery, distributed multi-project authorization, and auditing. It provides a central directory of users mapped to the OpenStack services they can access. It also registers endpoints for OpenStack services and acts as a common authentication system.
de: Das Projekt, das die API-Client-Authentifizierung, die Service-Ermittlung, die verteilte Multiprojekt-Autorisierung und die Auditierung erleichtert. Es bietet ein zentrales Verzeichnis von Benutzern, die den OpenStack-Diensten zugeordnet sind, auf die sie zugreifen können. Es registriert auch Endpunkte für OpenStack-Dienste und fungiert als gemeinsames Authentifizierungssystem.

source: The project that implements clustering services and libraries for the management of groups of homogeneous objects exposed by other OpenStack services.
de: Das Projekt, das Clustering-Dienste und Bibliotheken für die Verwaltung von Gruppen homogener Objekte implementiert, die von anderen OpenStack-Diensten bereitgestellt werden.

source: The project that produces a secret storage and generation system capable of providing key management for services wishing to enable encryption features.
de: Das Projekt, das ein geheimes Speicher- und Erzeugungssystem erzeugt, das in der Lage ist, eine Schlüsselverwaltung für Dienste bereitzustellen, die Verschlüsselungsfunktionen ermöglichen möchten.

source: The project that produces a set of python libraries containing code shared by OpenStack projects. The APIs provided by these libraries should be high quality, stable, consistent, documented and generally applicable.
de: Das Projekt, das eine Reihe von Python-Bibliotheken erzeugt, die Code enthalten, der von OpenStack-Projekten gemeinsam genutzt wird. Die von diesen Bibliotheken bereitgestellten APIs sollten qualitativ hochwertig, stabil, konsistent, dokumentiert und allgemein anwendbar sein.

source: The project that provides Governance-as-a-Service across any collection of cloud services in order to monitor, enforce, and audit policy over dynamic infrastructure.
de: Das Projekt, das Governance-as-a-Service für jede Sammlung von Cloud-Diensten anbietet, um Richtlinien über dynamische Infrastrukturen zu überwachen, durchzusetzen und zu überprüfen.

source: The project that provides a messaging service that affords a variety of distributed application patterns in an efficient, scalable and highly available manner, and to create and maintain associated Python libraries and documentation.
de: Das Projekt, das einen Messaging-Dienst bietet, der eine Vielzahl von verteilten Anwendungsmustern in einer effizienten, skalierbaren und hochverfügbaren Weise bietet und die damit verbundenen Python-Bibliotheken und Dokumentation erstellt und verwaltet.

source: The project that provides an application catalog service so that users can compose and deploy composite environments on an application abstraction level while managing the application lifecycle.
de: Das Projekt, das einen Anwendungskatalogdienst bereitstellt, damit Benutzer zusammengesetzte Umgebungen auf einer Anwendungsabstraktionsebene erstellen und bereitstellen können, während der Anwendungslebenszyklus verwaltet wird.

source: The project that provides integrated tooling for backing up, restoring, and recovering file systems, instances, or database backups.
de: Das Projekt, das integrierte Werkzeuge für die Sicherung, Wiederherstellung und Wiederherstellung von Dateisystemen, Instanzen oder Datenbanksicherungen bereitstellt.

source: The project which provides a set of services for provisioning, scaling, and managing container orchestration engines.
de: Das Projekt, das eine Reihe von Dienstleistungen für die Bereitstellung, Skalierung und Verwaltung von Container-Orchestrierung Maschinen bietet.

source: The project who owns an Image service virtual machine image.
de: Das Projekt, dem ein Abbild-Dienst Virtual Machine Abbild gehört.

source: The protocol by which layer-3 IP addresses are resolved into layer-2 link local addresses.
de: Das Protokoll, mit dem Layer-3-IP-Adressen in Layer-2 aufgelöst werden, verbindet lokale Adressen.

source: The router advertisement daemon, used by the Compute VLAN manager and FlatDHCP manager to provide routing services for VM instances.
de: Der Router-Werbe-Daemon, der vom Compute VLAN-Manager und FlatDHCP-Manager verwendet wird, um Routing-Services für VM-Instanzen bereitzustellen.

source: The service that provides a set of services for management of shared file systems in a multi-project cloud environment, similar to how OpenStack provides block-based storage management through the OpenStack :term:`Block Storage service<Block Storage service (cinder)>` project. With the Shared File Systems service, you can create a remote file system and mount the file system on your instances. You can also read and write data from your instances to and from your file system.
de: Der Dienst, der eine Reihe von Diensten für die Verwaltung von gemeinsam genutzten Dateisystemen in einer Multi-Projekt-Cloud-Umgebung bereitstellt, ähnlich wie OpenStack blockbasiertes Storage-Management über den OpenStack bietet: term: `Block Storage service <Block Storage service (cinder)> `Projekt Mit dem Dienst Shared File Systems können Sie ein Remote-Dateisystem erstellen und das Dateisystem auf Ihren Instanzen installieren. Sie können auch Daten von Ihren Instanzen zu und von Ihrem Dateisystem lesen und schreiben.

source: The software package used to provide AMQP messaging capabilities within Compute. Default package is RabbitMQ.
de: Das Softwarepaket zur Bereitstellung von AMQP Messaging-Funktionen in Compute. Standardpaket ist RabbitMQ.

source: The source used by Identity service to retrieve user information; an OpenLDAP server, for example.
de: Die Quelle, die vom Identitätsdienst verwendet wird, um Benutzerinformationen abzurufen; Ein OpenLDAP-Server, zum Beispiel.

source: The step in the Compute scheduling process when hosts that cannot run VMs are eliminated and not chosen.
de: Der Schritt im Compute-Scheduling-Prozess, wenn Hosts, die keine VMs ausführen können, eliminiert und nicht ausgewählt werden.

source: The storage method used by the Identity service catalog service to store and retrieve information about API endpoints that are available to the client. Examples include an SQL database, LDAP database, or KVS back end.
de: Die Speichermethode, die vom Identity-Service-Katalogdienst verwendet wird, um Informationen über API-Endpunkte zu speichern und abzurufen, die dem Client zur Verfügung stehen. Beispiele sind eine SQL-Datenbank, LDAP-Datenbank oder KVS-Backend.

source: The sum of each cost used when deciding where to start a new VM instance in Compute.
de: Die Summe der Kosten, die bei der Entscheidung verwendet werden, wo eine neue VM-Instanz in Compute gestartet werden soll.
