Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de

source: **CentOS, Fedora, and Red Hat Enterprise Linux:** https://www.rdoproject.org/
de: **CentOS, Fedora und Red Hat Enterprise Linux:** https://www.rdoproject.org/

source: **openSUSE and SUSE Linux Enterprise Server:** https://en.opensuse.org/Portal:OpenStack
de: **openSUSE und SUSE Linux Enterprise Server:** https://en.opensuse.org/Portal:OpenStack

source: A BLOB of data held by Object Storage; can be in any format.
de: Ein BLOB von Daten, die von Object Storage gehalten werden; Kann in jedem Format sein.

source: A Block Storage component that creates, attaches, and detaches persistent storage volumes.
de: Eine Blockspeicherkomponente, die dauerhafte Speichervolumes erstellt, anhängt und löst.

source: A Block Storage component that oversees and coordinates storage volume actions.
de: Eine Blockspeicher-Komponente, die Datenträgeraktionen der Storage koordiniert und überwacht.

source: A Block Storage node that runs the cinder-volume daemon.
de: Ein Blockspeicherknoten, auf dem der Cinder-volume Dämon läuft.

source: A Block Storage volume plug-in that enables communication with the Xen Storage Manager API.
de: Ein Plug-in für Blockspeichervolumen, das die Kommunikation mit der Xen Storage Manager API ermöglicht.

source: A Ceph component that communicates with external clients, checks data state and consistency, and performs quorum functions.
de: Eine Ceph-Komponente, die mit externen Clients kommuniziert, überprüft den Datenzustand und die Konsistenz und führt Quorumfunktionen aus.

source: A Certificate Revocation List (CRL) in a PKI model is a list of certificates that have been revoked. End entities presenting these certificates should not be trusted.
de: Eine Zertifikatsperrliste (CRL) in einem PKI-Modell ist eine Liste von Zertifikaten, die widerrufen wurden. Endentitäten, die diese Zertifikate vorstellen, sollten nicht vertraut werden.

source: A Compute API parameter that downloads changes to the requested item since your last request, instead of downloading a new, fresh set of data and comparing it against the old data.
de: Ein Compute-API-Parameter, der Änderungen an dem angeforderten Element seit Ihrer letzten Anforderung herunterlädt, anstatt einen neuen, frischen Datensatz herunterzuladen und mit den alten Daten zu vergleichen.

source: A Compute RabbitMQ message queue that remains active when the server restarts.
de: Eine Compute RabbitMQ Nachrichtenwarteschlange, die beim Neustart des Servers aktiv bleibt.

source: A Compute RabbitMQ setting that determines whether a message exchange is automatically created when the program starts.
de: Eine Compute RabbitMQ Einstellung, die festlegt, ob ein Nachrichtenaustausch direkt nach dem Programmstart automatisch erfolgen soll.

source: A Compute back-end database table that contains the current workload, amount of free RAM, and number of VMs running on each host. Used to determine on which host a VM starts.
de: Eine Compute-Back-End-Datenbanktabelle, die die aktuellen Arbeitsabläufe, die Menge an freiem RAM und die Anzahl der auf jedem Host ausgeführten VMs enthält. Wird verwendet, um festzustellen, auf welchem Host eine VM startet.

source: A Compute component that determines where VM instances should start. Uses modular design to support a variety of scheduler types.
de: Eine Computerkomponente, die bestimmt, wo VM-Instanzen beginnen sollen. Verwendet modularen Aufbau zur Unterstützung einer Vielzahl von Scheduler-Typen.

source: A Compute component that enables OpenStack to communicate with Amazon EC2.
de: Eine Compute-Komponente, die es OpenStack ermöglicht, mit Amazon EC2 zu kommunizieren.

source: A Compute component that manages IP address allocation, firewalls, and other network-related tasks. This is the legacy networking option and an alternative to Networking.
de: Eine Compute-Komponente, die IP-Adresszuweisung, Firewalls und andere netzbezogene Aufgaben verwaltet. Dies ist die Legacy-Netzwerkoption und eine Alternative zum Networking.

source: A Compute component that provides dnsmasq and radvd and sets up forwarding to and from cloudpipe instances.
de: Eine Compute-Komponente, die dnsmasq und radvd bereitstellt und die Weiterleitung zu und von Cloudpipe-Instanzen aufbaut.

source: A Compute component that provides users access to the consoles of their VM instances through VNC or VMRC.
de: Eine Compute-Komponente, die Benutzern Zugriff auf die Konsolen ihrer VM-Instanzen über VNC oder VMRC bietet.

source: A Compute component that, along with the notification system, collects meters and usage information. This information can be used for billing.
de: Eine Berechnungskomponente, die zusammen mit dem Benachrichtigungssystem Meter und Nutzungsinformationen sammelt. Diese Informationen können zur Abrechnung verwendet werden.

source: A Compute daemon that orchestrates the network configuration of nodes, including IP addresses, VLANs, and bridging. Also manages routing for both public and private networks.
de: Ein Compute-Daemon, der die Netzwerkkonfiguration von Knoten, einschließlich IP-Adressen, VLANs und Bridging, orchestriert. Verwaltet auch das Routing für öffentliche und private Netzwerke.

source: A Compute networking method where the OS network configuration information is injected into the VM image before the instance starts.
de: Eine Netzwerkmethode von Compute, bei der die OS-Netzwerkkonfigurationsinformationen in das VM-Abbild injiziert werden, bevor die Instanz startet.

source: A Compute option that enables parent cells to pass resource requests to child cells if the parent cannot provide the requested resource.
de: Eine Compute-Option die Elternzellen ermöglicht, Ressourcenanfragen and Kind-Zellen weiterzuleiten, wenn der Elter die angefragte Ressource nicht bereitstellen kann.

source: A Compute process that determines the suitability of the VM instances for a job for a particular host. For example, not enough RAM on the host, too many CPUs on the host, and so on.
de: Ein Compute-prozess, der die Eignung der VM-Instanzen für einen Job für einen bestimmten Host bestimmt. Zum Beispiel, nicht genug RAM auf dem Host, zu viele CPUs auf dem Host, und so weiter.

source: A Debian-based Linux distribution.
de: Eine Debian-basierte Linux-Distribution.

source: A Java program that can be embedded into a web page.
de: Ein Java-Programm, das in eine Webseite eingebettet werden kann.

source: A Linux distribution compatible with OpenStack.
de: Eine mit OpenStack kompatible Linux Distribution.

source: A Linux distribution that is compatible with OpenStack.
de: Eine mit OpenStack kompatible Linux Distribution.

source: A Networking extension that provides perimeter firewall functionality.
de: Eine Netzwerkerweiterung, die umfangreiche Firewall Funktionalität anbietet.

source: A Networking plug-in for Cisco devices and technologies, including UCS and Nexus.
de: Ein Netzwerk-Plugin für Cisco-Geräte und -Technologien, einschließlich UCS und Nexus.

source: A SQLite database that contains Object Storage accounts and related metadata and that the accounts server accesses.
de: Eine SQLite-Datenbank, die Object Storage-Konten und verwandte Metadaten enthält und auf die der Kontenserver zugreift.

source: A SQLite database that stores Object Storage containers and container metadata. The container server accesses this database.
de: Eine SQLite-Datenbank, die Object Storage-Container und Container-Metadaten speichert. Der Container-Server greift auf diese Datenbank zu.

source: A Shared File Systems service that provides a stable RESTful API. The service authenticates and routes requests throughout the Shared File Systems service. There is python-manilaclient to interact with the API.
de: Ein Shared File Systems Service, der eine stabile RESTful API bereitstellt. Der Dienst authentifiziert und leitet Anfragen im gesamten Shared File Systems Service. Es ist python-manilaclient, um mit der API zu interagieren.

source: A VM image that does not save changes made to its volumes and reverts them to their original state after the instance is terminated.
de: Ein VM-Abbild, das Änderungen an seinen Datenträgern nicht speichert und sie nach dem Beenden der Instanz in ihren ursprünglichen Zustand zurückversetzt.

source: A VM instance that runs on a host.
de: Eine VM-Instanz, die auf einem Host läuft.

source: A VM state where no changes occur (no changes in memory, network communications stop, etc); the VM is frozen but not shut down.
de: Ein VM-Zustand, bei dem keine Änderungen auftreten (keine Änderungen im Speicher, Stopp der Netzwerkkommunikation usw.); die VM ist eingefroren, aber nicht heruntergefahren.

source: A Windows project providing guest initialization features, similar to cloud-init.
de: Ein Windows-Projekt, das Gastinitialisierungsfunktionen bietet, ähnlich wie Cloud-Init.

source: A XenAPI component that provides a pluggable interface to support a wide variety of persistent storage back ends.
de: Eine XenAPI-Komponente, die eine steckbare Schnittstelle bereitstellt, um eine Vielzahl von persistenten Speicher-Backends zu unterstützen.

source: A bit is a single digit number that is in base of 2 (either a zero or one). Bandwidth usage is measured in bits per second.
de: Ein Bit ist eine einstellige Zahl, die auf der Basis von 2 liegt (entweder Null oder Eins). Die Bandbreitenauslastung wird in Bits pro Sekunde gemessen.

source: A blob of data that the user can specify when they launch an instance. The instance can access this data through the metadata service or config drive. Commonly used to pass a shell script that the instance runs on boot.
de: Ein Datenblob, den der Benutzer beim Starten einer Instanz angeben kann. Die Instanz kann über den Metadatendienst oder das Konfigurationslaufwerk auf diese Daten zugreifen. Wird häufig verwendet, um ein Shell-Skript zu übergeben, das die Instanz beim Booten ausführt.

source: A cinder component that interacts with back-end storage to manage the creation and deletion of volumes and the creation of compute volumes, provided by the cinder-volume daemon.
de: Eine Cinder-Komponente, die mit Back-End-Speicher interagiert, um die Erstellung und Löschung von Datenträgern und die Erstellung von Berechnungsvolumina zu verwalten, die vom Cinder-Datenträger-Daemon bereitgestellt werden.

source: A collection of command-line tools for administering VMs; most are compatible with OpenStack.
de: Eine Sammlung von Befehlszeilen-Tools zur Verwaltung von VMs, die größtenteils mit OpenStack kompatibel sind.

source: A collection of files for a specific operating system (OS) that you use to create or rebuild a server. OpenStack provides pre-built images. You can also create custom images, or snapshots, from servers that you have launched. Custom images can be used for data backups or as "gold" images for additional servers.
de: Eine Sammlung von Dateien für ein bestimmtes Betriebssystem (OS), mit denen Sie einen Server erstellen oder neu erstellen. OpenStack bietet vorkonfigurierte Abbilder. Sie können auch benutzerdefinierte Abbilder oder Schattenkopien von Servern erstellen, die Sie gestartet haben. Benutzerdefinierte Images können für Datensicherungen oder als "goldene" Abbilder für zusätzliche Server verwendet werden.

source: A collection of hypervisors grouped together through host aggregates.
de: Eine Sammlung von Hypervisoren, die durch Host-Aggregate zusammengefasst sind.

source: A collection of servers that can share IPs with other members of the group. Any server in a group can share one or more public IPs with any other server in the group. With the exception of the first server in a shared IP group, servers must be launched into shared IP groups. A server may be a member of only one shared IP group.
de: Eine Sammlung von Servern, die IPs mit anderen Mitgliedern der Gruppe teilen können. Jeder Server in einer Gruppe kann eine oder mehrere öffentliche IPs mit einem anderen Server in der Gruppe teilen. Mit Ausnahme des ersten Servers in einer gemeinsamen IP-Gruppe müssen Server in freigegebene IP-Gruppen gestartet werden. Ein Server kann nur Mitglied einer gemeinsamen IP-Gruppe sein.

source: A collection of specifications used to access a service, application, or program. Includes service calls, required parameters for each call, and the expected return values.
de: Eine Sammlung von Spezifikationen, die für den Zugriff auf einen Dienst, eine Anwendung oder ein Programm verwendet werden. Enthält Diensteaufrufe, erforderliche Parameter für jeden Anruf und die erwarteten Rückgabewerte.

source: A comment with additional information that explains a part of the text.
de: Ein Kommentar mit zusätzlichen Informationen, der einen Teil des Textes erläutert.

source: A community project may be elevated to this status and is then promoted to a core project.
de: Ein Gemeinschaftsprojekt kann zu diesem Status erhoben werden und wird dann zu einem Kernprojekt befördert.

source: A compute service that creates VPNs on a per-project basis.
de: Ein Compute-Dienst, der VPNs auf Projektbasis erstellt.

source: A configurable option within Object Storage to automatically delete objects after a specified amount of time has passed or a certain date is reached.
de: Eine konfigurierbare Option innerhalb des Objektspeichers, um Objekte automatisch zu löschen, nachdem eine bestimmte Zeitspanne verstrichen ist oder ein bestimmtes Datum erreicht ist.

source: A content delivery network is a specialized network that is used to distribute content to clients, typically located close to the client for increased performance.
de: Ein Content Delivery Network ist ein spezialisiertes Netzwerk, das verwendet wird, um Inhalte an Clients zu verteilen, die typischerweise in der Nähe des Kunden für eine erhöhte Leistung liegen.

source: A controlled reboot where a VM instance is properly restarted through operating system commands.
de: Ein kontrollierter Neustart, bei dem eine VM-Instanz durch Betriebssystembefehle ordnungsgemäß neu gestartet wird.

source: A daemon that listens to a queue and carries out tasks in response to messages. For example, the cinder-volume worker manages volume creation and deletion on storage arrays.
de: Ein Dämon, der auf eine Warteschlange hört und Aufgaben als Antwort auf Nachrichten ausführt. Zum Beispiel verwaltet der Cinder-Volume-Worker die Erstellung und Löschung von Speicher auf Speicher-Arrays.

source: A database engine supported by the Database service.
de: Eine Datenbankmaschine, die vom Datenbankdienst unterstützt wird.

source: A default role in the Compute RBAC system that can quarantine an instance in any project.
de: Eine Standardrolle im Compute-RBAC-System, die eine Instanz in jedem Projekt quarantieren kann.

source: A device that moves data in the form of blocks. These device nodes interface the devices, such as hard disks, CD-ROM drives, flash drives, and other addressable regions of memory.
de: Eine Vorrichtung, die Daten in Form von Blöcken bewegt. Diese Geräteknoten verbinden die Geräte, wie Festplatten, CD-ROM-Laufwerke, Flash-Laufwerke und andere adressierbare Speicherbereiche.

source: A directory service, which allows users to login with a user name and password. It is a typical source of authentication tokens.
de: Ein Verzeichnisdienst, der es Benutzern ermöglicht, sich mit einem Benutzernamen und Passwort anzumelden. Es ist eine typische Quelle von Authentifizierungs-Token.

source: A discrete OpenStack environment with dedicated API endpoints that typically shares only the Identity (keystone) with other regions.
de: Eine diskrete OpenStack-Umgebung mit dedizierten API-Endpunkten, die typischerweise nur die Identity (Keystone) mit anderen Regionen teilt.

source: A disk storage protocol tunneled within Ethernet.
de: Ein Plattenspeicherprotokoll, das durch Ethernet getunnelt ist.

source: A distributed memory object caching system that is used by Object Storage for caching.
de: Ein verteiltes Speicherobjekt-Caching-System, das von Object Storage für das Caching verwendet wird.

source: A distributed, highly fault-tolerant file system designed to run on low-cost commodity hardware.
de: Ein verteiltes, sehr fehlertolerantes Dateisystem, das für den Betrieb auf kostengünstiger Standard-Hardware entwickelt wurde.

source: A domain within a parent domain. Subdomains cannot be registered. Subdomains enable you to delegate domains. Subdomains can themselves have subdomains, so third-level, fourth-level, fifth-level, and deeper levels of nesting are possible.
de: Eine Domäne innerhalb einer übergeordneten Domäne. Subdomains können nicht registriert werden. Subdomains ermöglichen es Ihnen, Domains zu delegieren. Subdomains können selbst Subdomains haben, so dass Verschachtelungen der dritten, vierten, fünften und tieferen Ebenen möglich sind.

source: A driver for the Modular Layer 2 (ML2) neutron plug-in that provides layer-2 connectivity for virtual instances. A single OpenStack installation can use multiple mechanism drivers.
de: Ein Treiber für das Modular Layer 2 (ML2) Neutronen-Plug-In, das Layer-2-Konnektivität für virtuelle Instanzen bietet. Eine einzige OpenStack-Installation kann mehrere Mechanismus-Treiber verwenden.

source: A feature of Compute that allows the unprivileged "nova" user to run a specified list of commands as the Linux root user.
de: Eine Funktion von Compute, die es dem unprivilegierten "nova"-Benutzer ermöglicht, eine bestimmte Liste von Befehlen als Linux-Root-Benutzer auszuführen.

source: A feature of the load-balancing service. It attempts to force subsequent connections to a service to be redirected to the same node as long as it is online.
de: Ein Merkmal des Loadbalancing-Dienstes. Es versucht, nachfolgende Verbindungen zu einem Dienst zu erzwingen, der auf denselben Knoten umgeleitet werden soll, solange er online ist.

source: A file sharing protocol. It is a public or open variation of the original Server Message Block (SMB) protocol developed and used by Microsoft. Like the SMB protocol, CIFS runs at a higher level and uses the TCP/IP protocol.
de: Ein Dateifreigabeprotokoll. Es handelt sich um eine öffentliche oder offene Variante des ursprünglichen Server Message Block (SMB)-Protokolls, das von Microsoft entwickelt und verwendet wird. Wie das SMB-Protokoll läuft auch CIFS auf einer höheren Ebene und verwendet das TCP/IP-Protokoll.

source: A file system designed to aggregate NAS hosts, compatible with OpenStack.
de: Ein Dateisystem, das für die Zusammenstellung von NAS-Hosts entwickelt wurde und mit OpenStack kompatibel ist.

source: A file used to customize a Compute instance. It can be used to inject SSH keys or a specific network configuration.
de: Eine Datei, die verwendet wird, um eine Berechnungsinstanz anzupassen. Es kann verwendet werden, um SSH-Schlüssel oder eine bestimmte Netzwerkkonfiguration zu injizieren.

source: A generic term for virtualization of network functions such as switching, routing, load balancing, and security using a combination of VMs and overlays on physical network infrastructure.
de: Ein Oberbegriff für die Virtualisierung von Netzwerkfunktionen wie Switching, Routing, Load Balancing und Security unter Verwendung einer Kombination von VMs und Overlays auf der physikalischen Netzwerkinfrastruktur.

source: A great way to get answers and insights is to post your question or problematic scenario to the OpenStack mailing list. You can learn from and help others who might have similar issues. To subscribe or view the archives, go to the `general OpenStack mailing list <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack>`_. If you are interested in the other mailing lists for specific projects or development, refer to `Mailing Lists <https://wiki.openstack.org/wiki/Mailing_Lists>`_.
de: Ein guter Weg, um Antworten und Einsichten zu erhalten, ist, Ihre Frage oder ein problematisches Szenario in die Mailingliste von OpenStack zu stellen. Sie können lernen und anderen helfen, die ähnliche Probleme haben könnten. Um die Archive zu abonnieren oder zu betrachten, gehen Sie zur "OpenStack Mailing List" <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack>`_. Wenn Sie an den anderen Mailinglisten für bestimmte Projekte oder Entwicklungen interessiert sind, finden Sie weitere Informationen unter `Mailinglisten <https://wiki.openstack.org/wiki/Mailing_Lists>`_.

source: A group of fixed and/or floating IP addresses that are assigned to a project and can be used by or assigned to the VM instances in a project.
de: Eine Gruppe von festen und/oder freien IP-Adressen, die einem Projekt zugeordnet sind und von den VM-Instanzen in einem Projekt verwendet oder zugewiesen werden können.

source: A group of interrelated web development techniques used on the client-side to create asynchronous web applications. Used extensively in horizon.
de: Eine Gruppe zusammenhängender Web-Entwicklungstechniken, die auf der Client-Seite verwendet werden, um asynchrone Web-Anwendungen zu erstellen. Benutzt weitgehend im Horizont.

source: A group of related button types within horizon. Buttons to start, stop, and suspend VMs are in one class. Buttons to associate and disassociate floating IP addresses are in another class, and so on.
de: Eine Gruppe von verwandten Schaltflächen in Horizon. Die Schaltflächen zum Starten, Stoppen und Pausieren von VMs sind in einer Klasse. Schaltflächen zum Zuweisen und Trennen von beweglichen IP-Adressen sind in einer anderen Klasse, usw.

source: A group of users; used to isolate access to Compute resources. An alternative term for a project.
de: Eine Gruppe von Benutzern; Verwendet, um den Zugriff auf Berechnungsressourcen zu isolieren. Ein alternativer Begriff für ein Projekt.

source: A grouped release of projects related to OpenStack that came out in April 2012, the fifth release of OpenStack. It included Compute (nova 2012.1), Object Storage (swift 1.4.8), Image (glance), Identity (keystone), and Dashboard (horizon). Essex is the code name for the fifth release of OpenStack. The design summit took place in Boston, Massachusetts, US and Essex is a nearby city.
de: Eine gruppierte Version von Projekten im Zusammenhang mit OpenStack, die im April 2012 veröffentlicht wurde, die fünfte Version von OpenStack. Dazu gehörten Compute (nova 2012.1), Object Storage (swift 1.4.8), Image (glance), Identity (Keystone) und Dashboard (Horizon). Essex ist der Codename für die fünfte Version von OpenStack. Der Design-Gipfel fand in Boston, Massachusetts, USA statt, und Essex ist eine nahegelegene Stadt.

source: A grouped release of projects related to OpenStack that came out in February of 2011. It included only Compute (nova) and Object Storage (swift). Bexar is the code name for the second release of OpenStack. The design summit took place in San Antonio, Texas, US, which is the county seat for Bexar county.
de: Eine gruppierte Version von Projekten im Zusammenhang mit OpenStack, die im Februar 2011 veröffentlicht wurde. Es beinhaltete nur Compute (nova) und Object Storage (swift). Bexar ist der Codename für die zweite Version von OpenStack. Der Design-Gipfel fand in San Antonio, Texas, USA, statt, dem Sitz der Grafschaft Bexar County.
