Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de

source: The transfer of data, usually in the form of files, from one computer to another.
de: Der Transfer von Daten, üblicherweise in der Form von Dateien, von einem Computer zum anderen.

source: The underlying format that a disk image for a VM is stored as within the Image service back-end store. For example, AMI, ISO, QCOW2, VMDK, and so on.
de: Das zugrunde liegende Format, in dem ein Datenträgerabbild für eine VM gespeichert ist, befindet sich im Abbilddienst-Backend-Speicher. Zum Beispiel, AMI, ISO, QCOW2, VMDK, und so weiter.

source: The universal measurement of how quickly data is transferred from place to place.
de: Das universelle Maß dafür, wie schnell Daten von Ort zu Ort übertragen werden.

source: This glossary offers a list of terms and definitions to define a vocabulary for OpenStack-related concepts.
de: Dieses Glossar bietet eine Liste von Begriffen und Definitionen, um ein Vokabular für OpenStack-bezogene Konzepte zu definieren.

source: To add to OpenStack glossary, clone the `openstack/openstack-manuals repository <https://git.openstack.org/cgit/openstack/openstack-manuals>`__ and update the source file ``doc/common/glossary.rst`` through the OpenStack contribution process.
de: Um dem OpenStack-Glossar etwas hinzuzufügen, klonen Sie das `openstack/openstack-manuals Repository <https://git.openstack.org/cgit/openstack/openstack-manuals>` und aktualisieren Sie die Quelldatei `` doc/common/glossary.rst `` durch den OpenStack Mitwirkungsprozess.

source: To provide feedback on documentation, join our IRC channel ``#openstack-doc`` on the Freenode IRC network, or `report a bug in Launchpad <https://bugs.launchpad.net/openstack/+filebug/+login>`_ and choose the particular project that the documentation is a part of.
de: Um Feedback zur Dokumentation zu geben, treten Sie unserem IRC-Kanal ``#openstack-doc``` im Freenode IRC-Netzwerk bei, oder melden Sie einen Fehler in Launchpad <https://bugs.launchpad.net/openstack/+filebug/+login>``_ und wählen Sie das jeweilige Projekt, zu dem die Dokumentation gehört.

source: Tool used for maintaining Address Resolution Protocol packet filter rules in the Linux kernel firewall modules. Used along with iptables, ebtables, and ip6tables in Compute to provide firewall services for VMs.
de: Tool, das für die Verwaltung der Adressfilterprotokoll-Paketfilterregeln in den Linuxkernel-Firewallmodulen verwendet wird. Wird zusammen mit iptables, ebtables und ip6tables in Compute verwendet, um Firewall-Services für VMs bereitzustellen.

source: Tool used in OpenStack development to ensure correctly ordered testing of changes in parallel.
de: Tool, das in der OpenStack-Entwicklung verwendet wird, um eine korrekt geordnete Prüfung von Änderungen parallel durchzuführen.

source: Tool used to set up, maintain, and inspect the tables of IPv6 packet filter rules in the Linux kernel. In OpenStack Compute, ip6tables is used along with arptables, ebtables, and iptables to create firewalls for both nodes and VMs.
de: Tool zum Einrichten, Verwalten und Prüfen der Tabellen von IPv6-Paketfilterregeln im Linux-Kernel. In OpenStack Compute werden ip6tables zusammen mit arptables, ebtables und iptables verwendet, um Firewalls für beide Knoten und VMs zu erstellen.

source: Type of Compute scheduler that evenly distributes instances among available hosts.
de: Typ des Compute Scheduler, der Instanzen gleichmäßig auf die verfügbaren Hosts verteilt.

source: UUID for each Compute or Image service VM flavor or instance type.
de: UUID für jede Compute- oder Abbilddienst VM-Variante oder jeden Instanztyp.

source: UUID used by Image service to uniquely identify each VM image.
de: UUID, die vom Abbild-Dienst verwendet wird, um jedes VM-Abbild eindeutig zu identifizieren.

source: Under the Compute distributed scheduler, this is calculated by looking at the capabilities of each host relative to the flavor of the VM instance being requested.
de: Unter dem Compute verteilten Scheduler wird dies durch Betrachten der Fähigkeiten jedes Hosts relativ zur Variante der VM-Instanz berechnet, die angefordert wird.

source: Unique ID applied to each storage volume under the Block Storage control.
de: Eindeutige ID, die auf jedem Speichervolumen unter dem Block Storage Control angewendet wird.

source: Unique ID assigned to each Networking VIF.
de: Eindeutige ID, die jedem Networking-VIF zugeordnet ist.

source: Unique ID assigned to each Object Storage request; used for debugging and tracing.
de: Eindeutige ID, die jeder Objektspeicheranforderung zugeordnet ist; Verwendet für Debugging und Tracing.

source: Unique ID assigned to each guest VM instance.
de: Eindeutige ID zugewiesen zu jeder Gast-VM-Instanz.

source: Unique ID assigned to each network segment within Networking. Same as network UUID.
de: Eindeutige ID, die jedem Netzwerksegment innerhalb von Networking zugewiesen wird. Wie bei der Netzwerk-UUID.

source: Unique ID assigned to each project by the Identity service.
de: Eindeutige ID, die jedem Projekt vom Identity Service zugewiesen wurde.

source: Unique ID assigned to each request sent to Compute.
de: Eindeutige ID, die jeder an Compute gesendeten Anfrage zugewiesen wurde.

source: Unique ID assigned to each service that is available in the Identity service catalog.
de: Eine eindeutige ID, die jedem Dienst zugeordnet ist, der im Identitätsdienstkatalog verfügbar ist.

source: Unique ID for a Networking VIF or vNIC in the form of a UUID.
de: Einzigartige ID für eine Netzwerk-VIF oder vNIC in Form einer UUID.

source: Unique ID for a Networking network segment.
de: Eindeutige ID für ein Netzwerksegment im Netzwerk.

source: Unique ID for a Networking port.
de: Eindeutige ID für einen Netzwerkanschluss.

source: Unique ID for an Object Storage object.
de: Eindeutige ID für ein Objektspeicherobjekt.

source: Unique numeric ID associated with each user in Identity, conceptually similar to a Linux or LDAP UID.
de: Einzigartige numerische ID, die jedem Benutzer in Identität zugeordnet ist, konzeptionell ähnlich einer Linux- oder LDAP-UID.

source: Unix-like computer operating system assembled under the model of free and open-source software development and distribution.
de: Unix-ähnliches Computer-Betriebssystem, das nach dem Modell der Entwicklung und Verteilung von freier und Open-Source-Software zusammengestellt wurde.

source: Used along with an EC2 access key when communicating with the Compute EC2 API; used to digitally sign each request.
de: Wird zusammen mit einem EC2-Zugriffsschlüssel bei der Kommunikation mit der Compute EC2-API verwendet; wird verwendet, um jede Anforderung digital zu signieren.

source: Used along with an EC2 secret key to access the Compute EC2 API.
de: Wird zusammen mit einem EC2 Geheimschlüssel verwendet, um auf die Compute EC2 API zuzugreifen.

source: Used along with an EKI to create an EMI.
de: Wird zusammen mit einem EKI verwendet, um ein EMI zu erstellen.

source: Used along with an ERI to create an EMI.
de: Wird zusammen mit einer ERI verwendet, um ein EMI zu erstellen.

source: Used along with arptables and ebtables, iptables create firewalls in Compute. iptables are the tables provided by the Linux kernel firewall (implemented as different Netfilter modules) and the chains and rules it stores. Different kernel modules and programs are currently used for different protocols: iptables applies to IPv4, ip6tables to IPv6, arptables to ARP, and ebtables to Ethernet frames. Requires root privilege to manipulate.
de: Verwendet zusammen mit arptables und ebtables, iptables zum Erstellen von Firewalls in Compute. Iptables sind die Tabellen, die von der Linux-Kernel-Firewall bereitgestellt werden (implementiert als verschiedene Netfilter-Module) und die Ketten und Regeln, die es speichert. Verschiedene Kernmodule und Programme werden derzeit für verschiedene Protokolle verwendet: iptables gilt für IPv4, ip6tables zu IPv6, arptables zu ARP und ebtables zu Ethernet Frames. Benötigt root-Berechtigung zum Manipulieren.

source: Used by Image service to obtain images on the local host rather than re-downloading them from the image server each time one is requested.
de: Wird vom Image-Service verwendet, um Abbilder auf dem lokalen Host zu erhalten, anstatt sie bei jeder Anforderung erneut vom Abbild-Server herunterzuladen.

source: Used by Object Storage devices to determine which storage devices are suitable for the job. Devices are weighted by size.
de: Wird von Object Storage-Geräten verwendet, um festzustellen, welche Speichergeräte für den Job geeignet sind. Geräte werden nach Größe gewichtet.

source: Used by Object Storage to determine the location of an object in the ring. Maps objects to partitions.
de: Wird von Object Storage verwendet, um die Position eines Objekts im Ring zu bestimmen. Mapt Objekte zu Partitionen.

source: Used by Object Storage to determine which partition data should reside on.
de: Wird von Object Storage verwendet, um zu bestimmen, auf welcher Partition Daten gespeichert werden sollen.

source: Used by Object Storage to push object replicas.
de: Wird von Object Storage verwendet, um Objektreplikate zu verschieben.

source: Used to mark Object Storage objects that have been deleted; ensures that the object is not updated on another node after it has been deleted.
de: Wird verwendet, um Objektspeicherobjekte zu markieren, die gelöscht wurden. Stellt sicher, dass das Objekt nach dem Löschen nicht auf einem anderen Knoten aktualisiert wird.

source: Used to restrict communications between hosts and/or nodes, implemented in Compute using iptables, arptables, ip6tables, and ebtables.
de: Wird verwendet, um die Kommunikation zwischen Hosts und/oder Knoten zu beschränken, die in Compute mit iptables, arptables, ip6tables und ebtables implementiert wurden.

source: Used to track segments of a large object within Object Storage.
de: Wird verwendet, um Segmente eines großen Objekts innerhalb des Objektspeichers zu verfolgen.

source: Users of Object Storage interact with the service through the proxy server, which in turn looks up the location of the requested data within the ring and returns the results to the user.
de: Benutzer von Object Storage interagieren mit dem Dienst über den Proxy-Server, der wiederum die Position der angeforderten Daten im Ring ansieht und die Ergebnisse an den Benutzer zurückgibt.

source: VLAN network
de: VLAN Netzwerk

source: VM image
de: VM Abbild

source: VM image container format supported by Image service.
de: VM-Abbildcontainerformat, das vom Abbild-Dienst unterstützt wird.

source: Virtual Central Processing Unit (vCPU)
de: Virtuelle Zentraleinheit (vCPU)

source: Virtual Extensible LAN (VXLAN)
de: Virtuell erweiterbares LAN (VXLAN)

source: Virtual Hard Disk (VHD)
de: Virtuelle Festplatte (VHD)

source: Virtual Network Computing (VNC)
de: Virtuelles Netzwerk-Computing (VNC)

source: Virtual network type that uses neither VLANs nor tunnels to segregate project traffic. Each flat network typically requires a separate underlying physical interface defined by bridge mappings. However, a flat network can contain multiple subnets.
de: Virtueller Netzwerktyp, der weder VLANs noch Tunnel verwendet, um den Projektverkehr zu trennen. Jedes Flachnetzwerk erfordert typischerweise eine separate zugrunde liegende physikalische Schnittstelle, die durch Brückenabbildungen definiert ist. Ein flaches Netzwerk kann jedoch mehrere Subnetze enthalten.

source: Virtualization API library used by OpenStack to interact with many of its supported hypervisors.
de: Virtualisierungs-API-Bibliothek, die von OpenStack verwendet wird, um mit vielen seiner unterstützten Hypervisoren zu interagieren.

source: Volume API
de: Datenträger API

source: Volume that does not save the changes made to it and reverts to its original state when the current user relinquishes control.
de: Datenträger, das die an ihm vorgenommenen Änderungen nicht speichert und in seinen ursprünglichen Zustand zurückkehrt, wenn der aktuelle Benutzer die Kontrolle aufgibt.

source: WSGI middleware component of Object Storage that serves container data as a static web page.
de: WSGI-Middleware-Komponente von Object Storage, die Containerdaten als statische Webseite dient.

source: Within RabbitMQ and Compute, it is the messaging interface that is used by the scheduler service to receive capability messages from the compute, volume, and network nodes.
de: Innerhalb von RabbitMQ und Compute ist es die Messaging-Schnittstelle, die vom Scheduler-Dienst verwendet wird, um Leistungsdaten von den Compute-, Volume- und Netzwerkknoten zu empfangen.

source: Workflow service (mistral)
de: Workflow Dienst (mistral)

source: X.509 is the most widely used standard for defining digital certificates. It is a data structure that contains the subject (entity) identifiable information such as its name along with its public key. The certificate can contain a few other attributes as well depending upon the version. The most recent and standard version of X.509 is v3.
de: X.509 ist der am weitesten verbreitete Standard für die Definition digitaler Zertifikate. Es handelt sich um eine Datenstruktur, die die identifizierbaren Informationen des Subjekts (der Entität) enthält, wie beispielsweise den Namen und den öffentlichen Schlüssel. Das Zertifikat kann je nach Version noch einige weitere Attribute enthalten. Die neueste und Standard-Version von X.509 ist v3.

source: Xen Cloud Platform (XCP)
de: Xen Cloud Plattform (XCP)

source: Xen Storage Manager Volume Driver
de: Xen Storage Manager Volumentreiber

source: Xen is a hypervisor using a microkernel design, providing services that allow multiple computer operating systems to execute on the same computer hardware concurrently.
de: Xen ist ein Hypervisor, der ein Mikrokernel-Design verwendet und Dienste bereitstellt, die es mehreren Computerbetriebssystemen ermöglichen, auf derselben Computerhardware gleichzeitig auszuführen.

source: `API Documentation <https://developer.openstack.org/api-guide/quick-start/>`_
de: `API Dokumentation <https://developer.openstack.org/api-guide/quick-start/>`_

source: `Bugs: Container Infrastructure Management service (magnum) <https://bugs.launchpad.net/magnum>`_
de: "Bugs": Container Infrastruktur Management Service (magnum) <https://bugs.launchpad.net/magnum>``_

source: `Bugs: OpenStack API Documentation (developer.openstack.org) <https://bugs.launchpad.net/openstack-api-site>`_
de: "Bugs": OpenStack API Dokumentation (developer.openstack.org) <https://bugs.launchpad.net/openstack-api-site>``_

source: `Bugs: OpenStack Documentation (docs.openstack.org) <https://bugs.launchpad.net/openstack-manuals>`_
de: "Bugs": OpenStack-Dokumentation (docs.openstack.org) <https://bugs.launchpad.net/openstack-manuals>``_

source: `Rocky Administrator Guides <https://docs.openstack.org/rocky/admin/>`_
de: `Rocky Administrationsanleitungen <https://docs.openstack.org/rocky/admin/>`_

source: `Rocky Configuration Guides <https://docs.openstack.org/rocky/configuration/>`_
de: `Rocky Konfigurationsanleitungen <https://docs.openstack.org/rocky/configuration/>`_

source: `Rocky Installation Guides <https://docs.openstack.org/rocky/install/>`_
de: `Rocky Installationsanleitungen <https://docs.openstack.org/rocky/install/>`_

source: `Rocky Networking Guide <https://docs.openstack.org/neutron/rocky/admin/>`_
de: `Rocky Netzwerkanleitungen <https://docs.openstack.org/neutron/rocky/admin/>`_

source: absolute limit
de: absolutes Limit

source: access control list (ACL)
de: access control list (ACL) [Zugriffskontrollliste]

source: access key
de: access key [Zugriffsschlüssel]

source: account
de: account [Konto]

source: account auditor
de: account auditor [Rechnungsprüfer]

source: account database
de: account database [Kontodatenbank]

source: account reaper
de: account reaper [Konto Reaper]

source: account server
de: account server [Kontoserver]

source: account service
de: account service [Kontodienst]

source: accounting
de: accounting [Abrechnung]

source: active/active configuration
de: aktiv/aktiv Konfiguration

source: active/passive configuration
de: aktive/passive Konfiguration

source: address pool
de: Adresspool

source: alert
de: Alarm

source: application server
de: Applikationsserver

source: associate
de: associate [zuweisen]

source: attach
de: anhängen

source: attachment (network)
de: Anhang (Netzwerk)

source: auditing
de: Auditieren

source: auth node
de: Authentifizierungsknoten

source: authentication
de: Authentifizierung

source: authentication token
de: Authentifizierungstoken

source: authorization
de: Autorisierung

source: authorization node
de: Autorisierungsknoten

source: auto declare
de: automatisch deklarieren

source: availability zone
de: Verfügbarkeitszone

source: back-end catalog
de: Backend-Katalog

source: back-end store
de: Backend-Shop

source: bandwidth
de: Bandbreite

source: base image
de: Basisabbild

source: binary
de: binär

source: bits per second (BPS)
de: Bits pro Sekunde (BPS)

source: block device
de: Blockgerät

source: bootable disk image
de: bootfähiges Disk-Abbild

source: builder file
de: Builder-Datei

source: button class
de: button class [Schaltfläche]

source: capability
de: capability [Fähigkeit]

source: capacity cache
de: capacity cache [Kapazitätszwischenspeicher]

source: capacity updater
de: capacity updater [Kapazitätsaktualisierer]

source: catalog
de: Katalog

source: catalog service
de: catalog service [Katalogdienst]

source: cell
de: cell [Zelle]

source: cell forwarding
de: cell forwarding [Zellenweiterleitung]

source: cell manager
de: cell manager [Zellenverwaltung]

source: changes since
de: changes since [Änderungen seit]

source: cloud architect
de: Cloud-Architekt

source: cloud controller node
de: Cloud-Controller-Knoten

source: community project
de: Gemeinschaftsprojekt

source: compression
de: Kompression

source: compute node
de: Compute Knoten

source: concatenated object
de: concatenated object [Verkettetes Objekt]

source: consistency window
de: consistency window [Konsistenzfenster]

source: console log
de: console log [Konsolen-Log]

source: container auditor
de: container auditor [Rechnungsprüfer]

source: container database
de: Containerdatenbank

source: container service
de: Containerdienst

source: controller node
de: Controller-Knoten

source: core API
de: core API [Kern API]

source: core service
de: core service [Kerndienst]

source: cost
de: cost [Kosten]

source: credentials
de: credentials [Zugangsdaten]

source: current workload
de: aktuelle Arbeitsbelastung

source: customer
de: Kunde

source: customization module
de: Anpassungsmodul

source: daemon
de: Dämon

source: data encryption
de: Datenverschlüsselung

source: data store
de: Datenspeicher

source: database ID
de: Datenbank-ID

source: database replicator
de: Datenbank-Replikator

source: deallocate
de: freigeben

source: deduplication
de: Deduplizierung

source: default panel
de: Standard-Panel

source: default token
de: Standard-Token

source: delayed delete
de: verzögertes Löschen

source: delivery mode
de: Liefermodus

source: deprecated auth
de: veraltetes auth

source: developer
de: Entwickler

source: device ID
de: device ID [Geräte ID]

source: device weight
de: device weight [Gerätegewichtung]

source: direct consumer
de: Direktverbraucher

source: direct exchange
de: Direkter Austausch

source: direct publisher
de: Direktpublisher

source: disassociate
de: disassoziieren

source: disk encryption
de: disk encryption [Festplattenverschlüsselung]

source: disk format
de: disk format [Festplattenformat]

source: dispersion
de: Dispergierung

source: domain
de: Domäne

source: durable exchange
de: Dauerhafter Austausch

source: durable queue
de: Dauerhafte Warteschlange

source: east-west traffic
de: Ost-West-Verkehr

source: encapsulation
de: Verkapselung

source: endpoint
de: endpunkt

source: endpoint registry
de: Endpunkt-Registrierung

source: endpoint template
de: Endpunktvorlage

source: entity
de: Entität

source: ephemeral image
de: flüchtiges Abbild

source: ephemeral volume
de: ephemerer Datenträger

source: evacuate
de: evakuieren

source: exchange type
de: exchange type [Austauschtyp]

source: exclusive queue
de: Exklusive Warteschlange

source: extended attributes (xattr)
de: Erweiterte Attribute (xattr)

source: extension
de: Erweiterung

source: external network
de: externes Netzwerk

source: extra specs
de: Extra Spezifikationen

source: fan-out exchange
de: Fan-Out Austausch

source: federated identity
de: Föderierte Identität

source: fixed IP address
de: feste IP-Adresse

source: flat network
de: flat network [Flaches Netzwerk]

source: flavor
de: flavor [Variante]

source: flavor ID
de: flavor ID [Varianten-ID]

source: gateway
de: Zahlungs-Gateway

source: generic receive offload (GRO)
de: generische Empfangsentlastung (GRO)

source: generic routing encapsulation (GRE)
de: generische Routing-Kapselung (GRE)

source: global endpoint template
de: globale Endpunktvorlage

source: golden image
de: goldenes Abbild

source: guest OS
de: Gastbetriebssystem

source: handover
de: Übergabe

source: hard reboot
de: harter Reboot

source: health monitor
de: health monitor [Gesundheitsmonitor]

source: high availability (HA)
de: hochverfügbar (HA)

source: host aggregate
de: Host-Aggregat

source: hypervisor pool
de: Hypervisor Bestand

source: identity provider
de: Identitätsanbieter

source: image
de: Abbild

source: image ID
de: Abbild-ID

source: image UUID
de: Abbild UUID

source: image cache
de: Abbilder-Cache

source: image membership
de: Abbildmitgliedschaft

source: image owner
de: Abbildbesitzer

source: image registry
de: Abbildregistrierung

source: image status
de: Abbildstatus

source: image store
de: Abbildspeicher

source: incubated project
de: Inkubationsprojekt

source: ingress filtering
de: Ingress-Filterung

source: injection
de: Datei-Injektion

source: instance
de: Instanz

source: instance UUID
de: Instanz-UUID

source: instance state
de: Instanzstatus

source: instance tunnels network
de: Instanztunnel Netzwerk

source: instance type
de: Instanztyp

source: instance type ID
de: Instanztyp-ID

source: interface
de: interface [Schnittstelle]

source: interface ID
de: interface ID [Schnittstellen-ID]

source: large object
de: großes Objekt

source: load balancer
de: Lastausgleichsvorrichtung

source: load balancing
de: Lastausgleich

source: management network
de: Managementnetzwerk

source: manifest object
de: Manifestobjekt

source: mechanism driver
de: Mechanismus-Treiber

source: membership
de: Mitgliedschaft

source: membership list
de: Mitgliederliste

source: memory overcommit
de: memory overcommit [Speicherüberbelegung]

source: message broker
de: message broker [Nachrichtenmakler]

source: message bus
de: message bus [Nachrichtenbus]

source: message queue
de: Nachrichtenwarteschlange

source: multi-factor authentication
de: Multi-Faktor-Authentifizierung

source: network
de: Netzwerk

source: network ID
de: Netzwerk-ID

source: network UUID
de: Netzwerk-UUID

source: node
de: Knoten

source: object
de: Objekt

source: object server
de: Objektserver

source: object versioning
de: Objektversionierung

source: operator
de: Betreiber

source: optional service
de: optionaler Service

source: partition index
de: Partitionsindex

source: partition shift value
de: Partitionsverschiebungswert

source: path MTU discovery (PMTUD)
de: Pfad MTU-Entdeckung (PMTUD)

source: pool
de: pool [Bestand]

source: pool member
de: pool member [Bestandteil]

source: private IP address
de: private IP-Adresse

source: private image
de: private image [privates Abbild]

source: private network
de: privates Netzwerk

source: project
de: Projekt

source: project ID
de: Projektkennung

source: protected property
de: protected property [Geschützte Eigenschaft]
