Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de

source: An Object Storage worker that scans for and deletes account databases and that the account server has marked for deletion.
de: Ein Objektspeicher-Worker, der Kontodatenbanken scannt und löscht sowie den Kontoserver zum Löschen markiert hat.

source: An OpenStack grouped release of projects that came out in the spring of 2011. It included Compute (nova), Object Storage (swift), and the Image service (glance). Cactus is a city in Texas, US and is the code name for the third release of OpenStack. When OpenStack releases went from three to six months long, the code name of the release changed to match a geography nearest the previous summit.
de: Eine OpenStack-gruppierte Freigabe von Projekten, die im Frühjahr 2011 erschienen sind. Dazu gehörten Compute (nova), Object Storage (swift) und der Abbilddienst (swift). Cactus ist eine Stadt in Texas, USA und ist der Codename für das dritte Release von OpenStack. Als sich der OpenStack-Release-Zyklus von drei auf sechs Monate änderte, änderte sich der Codename des Releases zu einer Geographie, die dem vorherigen Gipfel am nächsten liegt.

source: An OpenStack service, such as Compute, Object Storage, or Image service. Provides one or more endpoints through which users can access resources and perform operations.
de: Ein OpenStack-Dienst wie Compute, Object Storage oder Abbild-Dienst. Bietet einen oder mehrere Endpunkte, über die Benutzer auf Ressourcen zugreifen und Operationen durchführen können.

source: An OpenStack-provided image.
de: Ein von OpenStack bereitgestelltes Abbild.

source: An OpenStack-supported hypervisor.
de: Ein von OpenStack unterstützter Hypervisor.

source: An OpenStack-supported hypervisor. KVM is a full virtualization solution for Linux on x86 hardware containing virtualization extensions (Intel VT or AMD-V), ARM, IBM Power, and IBM zSeries. It consists of a loadable kernel module, that provides the core virtualization infrastructure and a processor specific module.
de: Ein OpenStack-unterstützter Hypervisor. KVM ist eine vollständige Virtualisierungslösung für Linux auf x86-Hardware mit Virtualisierungserweiterungen (Intel VT oder AMD-V), ARM, IBM Power und IBM zSeries. Es besteht aus einem ladbaren Kernelmodul, das die zentrale Virtualisierungsinfrastruktur und ein prozessorspezifisches Modul zur Verfügung stellt.

source: An administrator who has access to all hosts and instances.
de: Ein Administrator, der Zugriff auf alle Hosts und Instanzen hat.

source: An administrator-defined token used by Compute to communicate securely with the Identity service.
de: Ein vom Administrator definiertes Token, das von Compute verwendet wird, um sicher mit dem Identit#tsdienst zu kommunizieren.

source: An alpha-numeric string of text used to access OpenStack APIs and resources.
de: Eine alphanumerische Textfolge, die für den Zugriff auf OpenStack-APIs und Ressourcen verwendet wird.

source: An alternative name for :term:`Networking API <Networking API (Neutron API)>`.
de: Ein alternativer Name für :term:`Networking API <Networking API (Neutron API)>`.

source: An alternative term for :term:`project ID`.
de: Ein alternativer Ausdruck :term:`project ID`.

source: An application protocol for accessing and maintaining distributed directory information services over an IP network.
de: Ein Anwendungsprotokoll für den Zugriff auf und die Wartung von verteilten Verzeichnisinformationsdiensten über ein IP-Netzwerk.

source: An application protocol for distributed, collaborative, hypermedia information systems. It is the foundation of data communication for the World Wide Web. Hypertext is structured text that uses logical links (hyperlinks) between nodes containing text. HTTP is the protocol to exchange or transfer hypertext.
de: Ein Anwendungsprotokoll für verteilte, kollaborative, hypermedia Informationssysteme. Es ist die Grundlage der Datenkommunikation für das World Wide Web. Hypertext ist strukturierter Text, der logische Verknüpfungen (Hyperlinks) zwischen Knoten enthält, die Text enthalten. HTTP ist das Protokoll zum Austausch oder Übertragung von Hypertext.

source: An application that runs on the back-end server in a load-balancing system.
de: Eine Anwendung, die auf dem Back-End-Server in einem Load-Balancing-System läuft.

source: An authentication and authorization service for Object Storage, implemented through WSGI middleware; uses Object Storage itself as the persistent backing store.
de: Ein Authentifizierungs- und Autorisierungsdienst für Objektspeicher, der über die WSGI-Middleware implementiert ist und den Objektspeicher selbst als persistenten Backup-Speicher verwendet.

source: An authentication facility within Object Storage that enables Object Storage itself to perform authentication and authorization. Frequently used in testing and development.
de: Eine Authentifizierungseinrichtung im Objektspeicher, die es dem Objektspeicher ermöglicht, Authentifizierung und Autorisierung durchzuführen. Häufig in der Prüfung und Entwicklung verwendet.

source: An easy method to create a local LDAP directory for testing Identity and Compute. Requires Redis.
de: Eine einfache Methode zur Erstellung eines lokalen LDAP-Verzeichnisses zum testen von Identity und Compute. Benötigt Redis.

source: An element of the Compute RabbitMQ that comes to life when a RPC call is executed. It connects to a direct exchange through a unique exclusive queue, sends the message, and terminates.
de: Ein Element des Compute RabbitMQ, das zum Leben erweckt wird, wenn ein RPC-Aufruf ausgeführt wird. Es verbindet sich mit einem direkten Austausch durch eine exklusive Warteschlange, sendet die Nachricht und beendet sich.

source: An element of the Compute capacity cache that is calculated based on the number of build, snapshot, migrate, and resize operations currently in progress on a given host.
de: Ein Element des Compute Capacity Cache, das basierend auf der Anzahl der derzeit auf einem bestimmten Host laufenden Build, Snapshot, Migration und Größenänderung berechnet wird.

source: An encrypted communications protocol for secure communication over a computer network, with especially wide deployment on the Internet. Technically, it is not a protocol in and of itself; rather, it is the result of simply layering the Hypertext Transfer Protocol (HTTP) on top of the TLS or SSL protocol, thus adding the security capabilities of TLS or SSL to standard HTTP communications. Most OpenStack API endpoints and many inter-component communications support HTTPS communication.
de: Ein verschlüsseltes Kommunikationsprotokoll für eine sichere Kommunikation über ein Computernetzwerk mit besonders breiter Bereitstellung im Internet. Technisch ist es kein Protokoll an und für sich; Vielmehr ist es das Ergebnis der einfachen Überlagerung des Hypertext Transfer Protocol (HTTP) über das TLS- oder SSL-Protokoll und damit die Sicherheitsfunktionen von TLS oder SSL zu Standard-HTTP-Kommunikation. Die meisten OpenStack API-Endpunkte und viele Inter-Komponenten-Kommunikation unterstützen HTTPS-Kommunikation.

source: An entity in the context of the :term:`Shared File Systems service<Shared File Systems service (manila)>` that encapsulates interaction with the Networking service. If the driver you selected runs in the mode requiring such kind of interaction, you need to specify the share network to create a share.
de: Eine Entität im Kontext des Begriffs: "Shared File Systems Service <Shared File Systems service (manila)>`, der die Interaktion mit dem Networking Service kapselt. Wenn der von Ihnen gewählte Treiber in dem Modus läuft, der eine solche Interaktion erfordert, müssen Sie das Freigabenetzwerk angeben, um eine Freigabe zu erstellen.

source: An entity that maps Object Storage data to partitions. A separate ring exists for each service, such as account, object, and container.
de: Eine Entität, die Objektspeicherdaten an Partitionen abbildet. Ein separater Ring existiert für jeden Dienst, wie Konto, Objekt und Container.

source: An extra but helpful piece of practical advice.
de: Ein besonders hilfreicher praktischer Hinweis.

source: An iSCSI authentication method supported by Compute.
de: Eine von Compute unterstützte iSCSI Authentifizierungsmethode.

source: An in-progress specification for cloud management. Currently unsupported in OpenStack.
de: Eine in Bearbeitung befindliche Spezifikation für das Cloud-Management. Derzeit nicht unterstützt in OpenStack.

source: An integrated project that provides scalable and reliable Cloud Database-as-a-Service functionality for both relational and non-relational database engines.
de: Ein integriertes Projekt, das skalierbare und zuverlässige Cloud Database-as-a-Service Funktionalität für relationale und nicht-relationale Datenbankmaschinen bietet.

source: An interface that is plugged into a port in a Networking network. Typically a virtual network interface belonging to a VM.
de: Eine Schnittstelle, die an einen Port in einem Netzwerk angeschlossen ist. Typischerweise eine virtuelle Netzwerkschnittstelle, die zu einer VM gehört.

source: An object state in Object Storage where a new replica of the object is automatically created due to a drive failure.
de: Ein Objektzustand im Object Storage, bei dem aufgrund eines Laufwerksfehlers automatisch eine neue Kopie des Objekts erstellt wird.

source: An object within Object Storage that is larger than 5 GB.
de: Ein Objekt im Objektspeicher, das größer als 5 GB ist.

source: An official OpenStack service defined as core by DefCore Committee. Currently, consists of Block Storage service (cinder), Compute service (nova), Identity service (keystone), Image service (glance), Networking service (neutron), and Object Storage service (swift).
de: Ein offizieller OpenStack-Dienst, der als Kern von DefCore Committee definiert wurde. Derzeit besteht er aus Blockspeicherdienst (Cinder), Compute Dienst (Nova), Identitätsdienst (Keystone), Abbilddienst (Glance), Networking Dienst (Neutron) und Object Storage Dienst (Swift).

source: An official OpenStack service defined as optional by DefCore Committee. Currently, consists of Dashboard (horizon), Telemetry service (Telemetry), Orchestration service (heat), Database service (trove), Bare Metal service (ironic), and so on.
de: Ein offizieller OpenStack-Dienst, der vom DefCore Committee als optional definiert wurde. Derzeit besteht aus Dashboard (Horizon), Telemetrie-Service (Telemetry), Orchestrierungs-Service (Heat), Datenbank-Service (Trove), Bare Metal-Service (Ironic), und so weiter.

source: An open source LDAP server. Supported by both Compute and Identity.
de: Ein Open-Source-LDAP-Server. Unterstützt sowohl von Compute als auch von Identity.

source: An open source SQL toolkit for Python, used in OpenStack.
de: Ein Open-Source-SQL-Toolkit für Python, das in OpenStack verwendet wird.

source: An open source community project by SUSE that aims to provide all necessary services to quickly deploy and manage clouds.
de: Ein Open-Source-Community-Projekt von SUSE, das darauf abzielt, alle notwendigen Dienste für die schnelle Bereitstellung und Verwaltung von Clouds bereitzustellen.

source: An operating system configuration management tool supporting OpenStack deployments.
de: Ein Tool für das Konfigurationsmanagement von Betriebssystemen, das OpenStack-Implementierungen unterstützt.

source: An operating system configuration-management tool supported by OpenStack.
de: Ein von OpenStack unterstütztes Tool für das Konfigurationsmanagement von Betriebssystemen.

source: An operating system instance running under the control of a hypervisor.
de: Eine Betriebssysteminstanz, die unter der Kontrolle eines Hypervisors läuft.

source: An operating system instance that runs on top of a hypervisor. Multiple VMs can run at the same time on the same physical host.
de: Eine Betriebssysteminstanz, die auf einem Hypervisor läuft. Mehrere VMs können gleichzeitig auf demselben physischen Host ausgeführt werden.

source: An option within Compute that enables administrators to create and manage users through the ``nova-manage`` command as opposed to using the Identity service.
de: Eine Option innerhalb von Compute, die es Administratoren ermöglicht, Benutzer mit dem Befehl ``nova-manage`` zu erstellen und zu verwalten, anstatt den Identity-Dienst zu verwenden.

source: An option within Image service so that an image is deleted after a predefined number of seconds instead of immediately.
de: Eine Option innerhalb des Abbilddienstes, so dass ein Abbild nach einer vordefinierten Anzahl von Sekunden anstelle von sofort gelöscht wird.

source: Any business that provides Internet access to individuals or businesses.
de: Jedes Unternehmen, das Internet-Zugang zu Einzelpersonen oder Unternehmen bietet.

source: Any client software that enables a computer or device to access the Internet.
de: Jede Client-Software, die es einem Computer oder Gerät ermöglicht, auf das Internet zuzugreifen.

source: Any compute node that runs the network worker daemon.
de: Jeder Rechenknoten, der den Daemon des Netzwerkarbeiters ausführt.

source: Any deployment-specific information is helpful, such as whether you are using Ubuntu 14.04 or are performing a multi-node installation.
de: Alle einsatzspezifischen Informationen sind hilfreich, z.B. ob Sie Ubuntu 14.04 verwenden oder eine Multi-Node Installation durchführen.

source: Any kind of text that contains a link to some other site, commonly found in documents where clicking on a word or words opens up a different website.
de: Jede Art von Text, der einen Link zu einer anderen Website enthält, die häufig in Dokumenten gefunden wird, in denen das Anklicken eines Wortes oder der Wörter eine andere Website öffnet.

source: Any node running a daemon or worker that provides an API endpoint.
de: Jeder Knoten, der einen Daemon oder Worker ausführt, der einen API-Endpunkt bereitstellt.

source: Any piece of hardware or software that wants to connect to the network services provided by Networking, the network connectivity service. An entity can make use of Networking by implementing a VIF.
de: Jede Hardware oder Software, die sich mit den Netzwerkdiensten von Networking, dem Netzwerkverbindungsdienst, verbinden möchte. Ein Unternehmen kann das Networking nutzen, indem es ein VIF implementiert.

source: Any user, including the ``root`` user, can run commands that are prefixed with the ``$`` prompt.
de: Jeder Benutzer, auch der Benutzer ``root``, kann Befehle ausführen, denen die `` $ `` Eingabeaufforderung vorangestellt ist.

source: Apache Hadoop is an open source software framework that supports data-intensive distributed applications.
de: Apache Hadoop ist ein Open-Source-Software-Framework, das datenintensive verteilte Anwendungen unterstützt.

source: Apache License 2.0
de: Apache Lizenz 2.0

source: Application Catalog service (murano)
de: Applikationskatalog Dienst (murano)

source: Application Programming Interface (API)
de: Anwendungsprogrammierschnittstelle (API)

source: Application Service Provider (ASP)
de: Anwendungsdienstleister (ASP)

source: Association of an interface ID to a logical port. Plugs an interface into a port.
de: Verbindung einer Schnittstellen-ID zu einem logischen Port. Steckt eine Schnittstelle in einen Port.

source: Asynchronous JavaScript and XML (AJAX)
de: Asynchrones JavaScript und XML (AJAX)

source: Attachment point where a virtual interface connects to a virtual network.
de: Anhängepunkt, an dem sich eine virtuelle Schnittstelle mit einem virtuellen Netzwerk verbindet.

source: Authentication and identity service by Microsoft, based on LDAP. Supported in OpenStack.
de: Authentifizierungs- und Identitätsdienst von Microsoft, basierend auf LDAP. Wird von OpenStack unterstützt.

source: Authentication method that uses keys rather than passwords.
de: Authentifizierungsmethode, die Schlüssel und nicht Passwörter verwendet.

source: Authentication method that uses two or more credentials, such as a password and a private key. Currently not supported in Identity.
de: Authentifizierungsmethode, die zwei oder mehr Anmeldeinformationen verwendet, wie beispielsweise ein Passwort und einen privaten Schlüssel. Wird derzeit von Identity nicht unterstützt.

source: Automated software test suite designed to run against the trunk of the OpenStack core project.
de: Automatisierte Software-Test-Suite entwickelt, um gegen den Trunk des OpenStack-Kernprojekts laufen.

source: Backup, Restore, and Disaster Recovery service (freezer)
de: Backup-, Wiederherstellungs- und Notfallwiederherstellungsdienst (Freezer)

source: Be sure to include the software and package versions that you are using, especially if you are using a development branch, such as, ``"Kilo release" vs git commit bc79c3ecc55929bac585d04a03475b72e06a3208``.
de: Stellen Sie sicher, dass Sie die Software- und Paketversionen, die Sie verwenden, angeben, insbesondere wenn Sie einen Entwicklungszweig verwenden, wie z.B. ``"Kilo release" vs. git commit bc79c3ecc55929bac585d04a03475b72e06a3208``.

source: Belongs to a particular domain and is used to specify information about the domain. There are several types of DNS records. Each record type contains particular information used to describe the purpose of that record. Examples include mail exchange (MX) records, which specify the mail server for a particular domain; and name server (NS) records, which specify the authoritative name servers for a domain.
de: Gehört zu einer bestimmten Domäne und wird verwendet, um Informationen über die Domäne anzugeben. Es gibt mehrere Arten von DNS-Datensätzen. Jeder Datensatztyp enthält bestimmte Informationen, die verwendet werden, um den Zweck dieses Datensatzes zu beschreiben. Beispiele umfassen Mail-Exchange- (MX-) Datensätze, die den Mail-Server für eine bestimmte Domain angeben; Und Nameserver (NS) Datensätze, die die autorisierenden Nameserver für eine Domain angeben.

source: Block Storage API
de: Blockspeicher-API

source: Block storage that is simultaneously accessible by multiple clients, for example, NFS.
de: Blockspeicher, der gleichzeitig von mehreren Clients zugänglich ist, z. B. NFS.

source: Bootstrap Protocol (BOOTP)
de: Bootstrap-Protokoll (BOOTP)

source: Border Gateway Protocol (BGP)
de: Border Gateway Protokoll (BGP)

source: Both Image service and Compute support encrypted virtual machine (VM) images (but not instances). In-transit data encryption is supported in OpenStack using technologies such as HTTPS, SSL, TLS, and SSH. Object Storage does not support object encryption at the application level but may support storage that uses disk encryption.
de: Sowohl Abbild-Dienst als auch Compute unterstützen verschlüsselte Virtual Machine (VM)-Abbilder (aber keine Instanzen). Die Datenverschlüsselung im laufenden Betrieb wird in OpenStack durch Technologien wie HTTPS, SSL, TLS und SSH unterstützt. Object Storage unterstützt keine Objektverschlüsselung auf Anwendungsebene, kann aber Speicher unterstützen, der Festplattenverschlüsselung verwendet.

source: Both a VM container format and disk format. Supported by Image service.
de: Sowohl ein VM-Containerformat als auch ein Plattenformat. Wird vom Abbild-Dienst unterstützt.

source: Builds and manages rings within Object Storage, assigns partitions to devices, and pushes the configuration to other storage nodes.
de: Erstellt und verwaltet Ringe im Objektspeicher, ordnet den Geräten Partitionen zu und schiebt die Konfiguration auf andere Speicherknoten.

source: Can concurrently use multiple layer-2 networking technologies, such as 802.1Q and VXLAN, in Networking.
de: Kann gleichzeitig mehrere Layer-2-Netzwerktechnologien wie 802.1Q und VXLAN in Networking nutzen.

source: Causes the network interface to pass all traffic it receives to the host rather than passing only the frames addressed to it.
de: Veranlasst die Netzwerkschnittstelle, den gesamten Datenverkehr an den Host weiterzugeben, anstatt nur die an ihn adressierten Frames zu übergeben.

source: Ceph component that enables a Linux block device to be striped over multiple distributed data stores.
de: Ceph-Komponente, die es ermöglicht, eine Linux-Blockvorrichtung über mehrere verteilte Datenspeicher zu verteilen.

source: Changes to these types of disk volumes are saved.
de: Änderungen an diesen Datenträgern werden gespeichert.

source: Checks for and deletes unused VMs; the component of Image service that implements delayed delete.
de: Prüft und löscht unbenutzte VMs; die Komponente des Image-Service, die das verzögerte Löschen implementiert.

source: Checks for missing replicas and incorrect or corrupted objects in a specified Object Storage account by running queries against the back-end SQLite database.
de: Überprüft auf fehlende Replikate und falsche oder beschädigte Objekte in einem angegebenen Objektspeicherkonto, indem es Abfragen gegen das SQLite-Backend-Datenbank ausführt.

source: Checks for missing replicas or incorrect objects in specified Object Storage containers through queries to the SQLite back-end database.
de: Überprüft auf fehlende Replikate oder falsche Objekte in angegebenen Containern für Objektspeicher durch Abfragen auf der SQLite-Backend-Datenbank.

source: Chef
de: Küchenchef

source: Choosing a host based on the existence of a GPU is currently unsupported in OpenStack.
de: Die Auswahl eines Hosts basierend auf der Existenz eines GPUs wird in OpenStack derzeit nicht unterstützt.

source: Cloud Auditing Data Federation (CADF) is a specification for audit event data. CADF is supported by OpenStack Identity.
de: Cloud Auditing Data Federation (CADF) ist eine Spezifikation für Audit-Ereignisdaten. CADF wird von OpenStack Identity unterstützt.

source: Cloud Data Management Interface (CDMI)
de: Cloud Data Management Schnittstelle (CDMI)

source: Cloud Infrastructure Management Interface (CIMI)
de: Cloud Infrastructure Management Schnittstelle (CIMI)

source: Clustering service (senlin)
de: Clustering-Dienst (senlin)

source: Code name for :term:`Workflow service <Workflow service (mistral)>`.
de: Code name für :term:`Workflow service <Workflow service (mistral)>`.

source: Code name for the :term:`Backup, Restore, and Disaster Recovery service <Backup, Restore, and Disaster Recovery service (freezer)>`.
de: Codename für den :term:`Backup, Restore, and Disaster Recovery service <Backup, Restore, and Disaster Recovery service (freezer)>`.

source: Code name for the :term:`Clustering service <Clustering service (senlin)>`.
de: Codename für den :Begriff:`Clustering-Service <Clustering-Service (senlin)>`.

source: Code name for the :term:`Containers Infrastructure Management service<Container Infrastructure Management service (magnum)>`.
de: Codename für den :Begriff:`Container Infrastructure Management Service<Container Infrastructure Management Service (magnum)>`.

source: Code name for the :term:`DNS service <DNS service (designate)>`.
de: Codename für den :Begriff:`DNS-Dienst <DNS-Dienst (designate)>`.

source: Code name for the :term:`Governance service <Governance service (congress)>`.
de: Code-Name für den :term:`Governance service <Governance service (congress)>`.

source: Code name for the :term:`Infrastructure Optimization service <Infrastructure Optimization service (watcher)>`.
de: Code name für den :term:`Infrastruktur-Optimierungsservice <Infrastructure Optimization service (watcher)>`.

source: Code name for the :term:`Load-balancing service <Load-balancing service (octavia)>`.
de: Codename für den :Begriff:`Lastausgleichsservice <Lastausgleichsservice (Oktavia)>`.

source: Code name for the :term:`NFV Orchestration service <NFV Orchestration service (tacker)>`
de: Code name für den :term:`NFV Orchestration service <NFV Orchestration service (tacker)>`
