Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de

source: OpenStack distribution packages
de: OpenStack Distributionspakete

source: OpenStack is a cloud operating system that controls large pools of compute, storage, and networking resources throughout a data center, all managed through a dashboard that gives administrators control while empowering their users to provision resources through a web interface. OpenStack is an open source project licensed under the Apache License 2.0.
de: OpenStack ist ein Cloud-Betriebssystem, das große Pools von Rechen-, Speicher- und Netzwerkressourcen in einem Rechenzentrum steuert, die alle über ein Dashboard verwaltet werden, das Administratoren die Kontrolle gibt und gleichzeitig ihre Benutzer in die Lage versetzt, Ressourcen über eine Weboberfläche bereitzustellen. OpenStack ist ein Open-Source-Projekt, das unter der Apache License 2.0 lizenziert ist.

source: OpenStack mailing lists
de: OpenStack Mailinglisten

source: OpenStack project that aims to make cloud services easier to consume and integrate with application development process by automating the source-to-image process, and simplifying app-centric deployment.
de: OpenStack-Projekt, das darauf abzielt, Cloud Services einfacher zu konsumieren und in den Anwendungsentwicklungsprozess zu integrieren, indem es den Source-to-Image-Prozess automatisiert und die applikationszentrierte Bereitstellung vereinfacht.

source: OpenStack project that aims to organize, analyze and visualize OpenStack alarms and events, yield insights regarding the root cause of problems and deduce their existence before they are directly detected.
de: OpenStack-Projekt, das darauf abzielt, OpenStack-Alarme und -Ereignisse zu organisieren, zu analysieren und zu visualisieren, Erkenntnisse über die Ursache von Problemen zu gewinnen und deren Existenz abzuleiten, bevor sie direkt erkannt werden.

source: OpenStack project that aims to provide a flexible and scalable resource optimization service for multi-project OpenStack-based clouds.
de: OpenStack-Projekt, das darauf abzielt, einen flexiblen und skalierbaren Dienst zur Ressourcenoptimierung für projektübergreifende OpenStack-basierte Clouds anzubieten.

source: OpenStack project that provides a framework for performance analysis and benchmarking of individual OpenStack components as well as full production OpenStack cloud deployments.
de: OpenStack-Projekt, das ein Framework für die Leistungsanalyse und das Benchmarking einzelner OpenStack-Komponenten sowie für produktive OpenStack-Cloud-Bereitstellungen bietet.

source: OpenStack project that provides a scalable data-processing stack and associated management interfaces.
de: OpenStack-Projekt, das einen skalierbaren Datenverarbeitungsstapel und die zugehörigen Verwaltungsschnittstellen bereitstellt.

source: OpenStack project that provides scalable, on demand, self service access to authoritative DNS services, in a technology-agnostic manner.
de: OpenStack Projekt, das bei Bedarf skalierbaren Selbstbedienungs-Zugriff auf authoritative DNS Dienste bereitstellt, in einer Technologie-agnostischen Weise.

source: OpenStack project which provides an extensible, unified, web-based user interface for all OpenStack services.
de: OpenStack-Projekt, das eine erweiterbare, einheitliche, webbasierte Benutzeroberfläche für alle OpenStack-Dienste bietet.

source: OpenStack service that aims to implement Network Function Virtualization (NFV) orchestration services and libraries for end-to-end life-cycle management of network services and Virtual Network Functions (VNFs).
de: OpenStack-Dienst, der die Implementierung von Network Function Virtualization (NFV) Orchestrierungsdiensten und Bibliotheken für das End-to-End-Lifecycle-Management von Netzwerkdiensten und Virtual Network Functions (VNFs) anstrebt.

source: OpenStack supports accessing the Amazon EC2 API through Compute.
de: OpenStack unterstützt den Zugriff auf die Amazon EC2 API über Compute.

source: OpenStack supports encryption technologies such as HTTPS, SSH, SSL, TLS, digital certificates, and data encryption.
de: OpenStack unterstützt Verschlüsselungstechnologien wie HTTPS, SSH, SSL, TLS, digitale Zertifikate und Datenverschlüsselung.

source: OpenStack-on-OpenStack program. The code name for the OpenStack Deployment program.
de: OpenStack-on-OpenStack-Programm. Der Codename für das OpenStack-Bereitstellungsprogramm.

source: Opens all objects for an object server and verifies the MD5 hash, size, and metadata for each object.
de: Öffnet alle Objekte für einen Objektserver und überprüft den MD5-Hash, die Größe und die Metadaten für jedes Objekt.

source: Orchestration service (heat)
de: Orchestrierungsservice (heat)

source: Organizes and stores objects in Object Storage. Similar to the concept of a Linux directory but cannot be nested. Alternative term for an Image service container format.
de: Organisiert und speichert Objekte in Object Storage. Ähnlich wie das Konzept eines Linux-Verzeichnisses, kann aber nicht verschachtelt werden. Alternativer Begriff für ein Abbilddienstcontainerformat.

source: Pages that use HTML, JavaScript, and Cascading Style Sheets to enable users to interact with a web page or show simple animation.
de: Seiten, die HTML-, JavaScript- und Cascading-Stylesheets verwenden, um Benutzern die Möglichkeit zu geben, mit einer Webseite zu interagieren oder eine einfache Animation zu zeigen.

source: Part of the OpenStack :term:`Telemetry service <Telemetry service (telemetry)>`; gathers and stores metrics from other OpenStack services.
de: Teil des OpenStack :term: `Telemetriedienst <Telemetry service (telemetry)>`; Sammelt und speichert Metriken aus anderen OpenStack-Diensten.

source: Part of the OpenStack :term:`Telemetry service <Telemetry service (telemetry)>`; provides alarming functionality.
de: Teil des OpenStack :Begriffs:`Telemetriedienst <Telemetriedienst (Telemetrie)>`; bietet Alarmfunktionen.

source: Part of the OpenStack :term:`Telemetry service <Telemetry service (telemetry)>`; provides an indexer and time-series database.
de: Teil des OpenStack :Begriffs:`Telemetriedienst <Telemetriedienst (Telemetrie)>`; bietet einen Indexer und eine Zeitseriendatenbank.

source: Part of the OpenStack :term:`Telemetry service <Telemetry service (telemetry)>`; provides event storage.
de: Teil des OpenStack :Begriffs:`Telemetriedienst <Telemetriedienst (Telemetry)>`; bietet Ereignisspeicherung.

source: Passed to API requests and used by OpenStack to verify that the client is authorized to run the requested operation.
de: An API-Anforderungen übergeben und von OpenStack verwendet, um zu überprüfen, dass der Client autorisiert ist, den angeforderten Vorgang auszuführen.

source: Passes requests from clients to the appropriate workers and returns the output to the client after the job completes.
de: Übergibt Anfragen von Clients an die entsprechenden Worker und gibt die Ausgabe an den Client zurück, nachdem der Job abgeschlossen ist.

source: Physical host dedicated to running compute nodes.
de: Physischer Host, der zum laufenlassen von Compute Knoten vorgesehen ist.

source: Point in time since the last container and accounts database sync among nodes within Object Storage.
de: Punkt seit der letzten Container- und Konten-Datenbank-Synchronisierung unter Knoten im Objektspeicher.

source: Principal communications protocol in the internet protocol suite for relaying datagrams across network boundaries.
de: Hauptkommunikationsprotokoll in der Internetprotokoll-Suite zum Weiterleiten von Datagrammen über Netzwerkgrenzen hinweg.

source: Process of modifying IP address information while in transit. Supported by Compute and Networking.
de: Verfahren zum Ändern von IP-Adressinformationen während der Übertragung. Unterstützt durch Compute und Networking.

source: Process whereby the system firmware validates the authenticity of the code involved in the boot process.
de: Verfahren, bei dem die System-Firmware die Authentizität des am Bootvorgang beteiligten Codes überprüft.

source: Programming language used extensively in OpenStack.
de: Programmiersprache, die in OpenStack weit verbreitet ist.

source: Project name for OpenStack Network Information Service. To be merged with Networking.
de: Projektname für OpenStack Network Information Service. Um mit Networking verschmolzen zu werden.

source: Projects represent the base unit of “ownership” in OpenStack, in that all resources in OpenStack should be owned by a specific project. In OpenStack Identity, a project must be owned by a specific domain.
de: Projekte stellen die Basiseinheit des "Eigentums" in OpenStack dar, da alle Ressourcen in OpenStack im Besitz eines bestimmten Projekts sein sollten. In OpenStack Identity muss ein Projekt im Besitz einer bestimmten Domain sein.

source: Protocol that encapsulates a wide variety of network layer protocols inside virtual point-to-point links.
de: Protokoll, das eine Vielzahl von Netzwerkprotokollen in virtuellen Punkt-zu-Punkt-Verbindungen kapselt.

source: Provide as much detail as possible in the description. Paste in your command output or stack traces, links to screen shots, and any other information which might be useful.
de: Geben Sie so viele Details wie möglich in der Beschreibung an. Fügen Sie in Ihre Befehlsausgabe oder Stack-Traces, Links zu Screenshots und alle anderen Informationen, die nützlich sein könnten, hinzu.

source: Provided by Compute in the form of cloudpipes, specialized instances that are used to create VPNs on a per-project basis.
de: Von Compute in Form von Cloudpipes, spezialisierten Instanzen, die zur Erstellung von VPNs auf projektbezogener Basis verwendet werden.

source: Provided in Compute through the system usage data facility.
de: Wird in Compute über die Systemverwendungsdaten-Einrichtung bereitgestellt.

source: Provides a load balancer for TCP and HTTP-based applications that spreads requests across multiple servers.
de: Bietet einen Loadbalancer für TCP- und HTTP-basierte Anwendungen, die Anforderungen über mehrere Server verteilen.

source: Provides a mechanism for metadata exchange along the instantiated service path.
de: Bietet einen Mechanismus für den Metadatenaustausch entlang des instanziierten Dienstpfades.

source: Provides a mechanism to implement packet forwarding and routing according to the policies defined by the network administrator.
de: Bietet einen Mechanismus zur Implementierung von Paketweiterleitung und Routing entsprechend den Richtlinien, die vom Netzwerkadministrator definiert werden.

source: Provides a method of allocating space on mass-storage devices that is more flexible than conventional partitioning schemes.
de: Bietet eine Methode zur Zuweisung von Speicherplatz auf Massenspeichern, die flexibler ist als herkömmliche Partitionierungsschemata.

source: Provides a predefined list of actions that the user can perform, such as start or stop VMs, reset passwords, and so on. Supported in both Identity and Compute and can be configured using the dashboard.
de: Bietet eine vordefinierte Liste von Aktionen, die der Benutzer ausführen kann, z. B. Start oder Stopp von VMs, Rücksetzen von Passwörtern und so weiter. Unterstützt in Identity und Compute und kann über das Dashboard konfiguriert werden.

source: Provides an approach for network administrators to manage computer network services through abstraction of lower-level functionality.
de: Bietet einen Ansatz für Netzwerkadministratoren zur Verwaltung von Computernetzwerkdiensten durch Abstraktion der untergeordneten Funktionalität.

source: Provides an interface to the underlying Open vSwitch service for the Networking plug-in.
de: Bietet eine Schnittstelle zum zugrunde liegenden Open vSwitch-Dienst für das Networking-Plugin.

source: Provides data redundancy and fault tolerance by creating copies of Object Storage objects, accounts, and containers so that they are not lost when the underlying storage fails.
de: Bietet Datenredundanz und Fehlertoleranz durch das Erstellen von Kopien von Objektspeicherobjekten, Konten und Containern, so dass sie nicht verloren gehen, wenn der zugrunde liegende Speicher fehlschlägt.

source: Provides logical partitioning of Compute resources in a child and parent relationship. Requests are passed from parent cells to child cells if the parent cannot provide the requested resource.
de: Stellt eine logische Partitionierung von Compute-Ressourcen in einer untergeordneten und übergeordneten Beziehung bereit. Anfragen werden von übergeordneten Zellen an untergeordnete Zellen übergeben, wenn das übergeordnete Element die angeforderte Ressource nicht bereitstellen kann.

source: Provides support for NexentaStor devices in Compute.
de: Unterstützt NexentaStor Geräte in Compute.

source: Provides support for Open vSwitch in Networking.
de: Bietet Unterstützung für Open vSwitch im Netzwerk.

source: Provides support for VMware NSX in Neutron.
de: Bietet Unterstützung für VMware NSX in Neutron.

source: Provides support for new and specialized types of back-end storage for the Block Storage volume manager.
de: Bietet Unterstützung für neue und spezielle Backend-Storage Typen durch die Block Storage Datenträgerverwaltung.

source: Provides to the consumer an operating system and, often, a language runtime and libraries (collectively, the "platform") upon which they can run their own application code, without providing any control over the underlying infrastructure. Examples of Platform-as-a-Service providers include Cloud Foundry and OpenShift.
de: Bietet dem Verbraucher ein Betriebssystem und häufig eine Laufzeitumgebung und Bibliotheken (zusammen die "Plattform"), auf dem/der sie eigenen Applikationscode ohne Kontrolle der darunter liegenden Infrastruktur laufen lassen können. Beispiele für Platform-as-a-Service Anbieter sind Cloud Foundry oder OpenShift.

source: QEMU is a generic and open source machine emulator and virtualizer. One of the hypervisors supported by OpenStack, generally used for development purposes.
de: QEMU ist ein generischer und Open-Source-Maschinenemulator und Virtualisierer. Einer der von OpenStack unterstützten Hypervisor, der im Allgemeinen für Entwicklungszwecke verwendet wird.

source: RADOS Block Device (RBD)
de: RADOS Blockgerät (RBD)

source: RAM overcommit
de: RAM-Überlastung

source: RPC driver
de: RPC-Treiber

source: RXTX cap
de: RXTX Kappe

source: Rackspace Cloud Files
de: Rackspace Cloud Dateien

source: Reducing the size of files by special encoding, the file can be decompressed again to its original content. OpenStack supports compression at the Linux file system level but does not support compression for things such as Object Storage objects or Image service VM images.
de: Durch die Reduzierung der Dateigröße durch eine spezielle Kodierung kann die Datei wieder auf ihren ursprünglichen Inhalt dekomprimiert werden. OpenStack unterstützt die Komprimierung auf Linux-Dateisystemebene, unterstützt aber keine Komprimierung für Dinge wie Objektspeicherobjekte oder Image Service VM-Images.

source: Released as open source by NASA in 2010 and is the basis for Compute.
de: Wurde 2010 von der NASA als Open Source veröffentlicht und ist die Grundlage für Compute.

source: Released as open source by Rackspace in 2010; the basis for Object Storage.
de: Veröffentlicht als Open Source von Rackspace im Jahr 2010; die Basis für Object Storage.

source: Removes all data on the server and replaces it with the specified image. Server ID and IP addresses remain the same.
de: Entfernt alle Daten auf dem Server und ersetzt sie mit dem angegebenen Abbild. Server-ID und IP-Adressen bleiben gleich.

source: Represents a virtual, isolated OSI layer-2 subnet in Networking.
de: Stellt ein virtuelles, isoliertes OSI Layer-2-Subnetz im Netzwerk dar.

source: Responsible for managing Shared File System Service devices, specifically the back-end devices.
de: Verantwortlich für die Verwaltung von Shared File System Service Geräten, speziell die Back-End-Geräte.

source: Runs automated tests against the core OpenStack API; written in Rails.
de: Führt automatisierte Tests gegen die Kern-OpenStack-API aus; Geschrieben in Rails.

source: SINA standard that defines a RESTful API for managing objects in the cloud, currently unsupported in OpenStack.
de: SINA-Standard, der eine RESTful API für die Verwaltung von Objekten in der Cloud definiert, die derzeit in OpenStack nicht unterstützt wird.

source: SPICE provides remote desktop access to guest virtual machines. It is an alternative to VNC. SPICE is supported by OpenStack.
de: SPICE bietet Remote-Desktop-Zugriff auf virtuelle Gastmaschinen. Es ist eine Alternative zu VNC. SPICE wird von OpenStack unterstützt.

source: See API endpoint.
de: Siehe API-Endpunkt.

source: Set of bits that make up a single character; there are usually 8 bits to a byte.
de: Satz von Bits, die ein einzelnes Zeichen bilden; Es gibt normalerweise 8 Bits zu einem Byte.

source: Setting for the Compute RabbitMQ message delivery mode; can be set to either transient or persistent.
de: Einstellung für den Nachrichtenzustellmodus Compute RabbitMQ; kann entweder auf transient oder persistent eingestellt werden.

source: Soft limit on the amount of network traffic a Compute VM instance can send and receive.
de: Soft-Limit für die Menge des Netzwerkverkehrs, die eine Compute VM-Instanz senden und empfangen kann.

source: Software Development Lifecycle Automation service (solum)
de: Softwareentwicklung Lifecycle Automation Service (Solum)

source: Software component providing the actual implementation for Networking APIs, or for Compute APIs, depending on the context.
de: Softwarekomponente, die die tatsächliche Implementierung für Networking APIs oder für Compute APIs, je nach Kontext, bereitstellt.

source: Software programs used to protect sensitive information and prevent it from leaking outside a network boundary through the detection and denying of the data transportation.
de: Softwareprogramme, die verwendet werden, um sensible Informationen zu schützen und zu verhindern, dass sie außerhalb einer Netzwerkgrenze durch die Erkennung und Ablehnung des Datentransports auslaufen.

source: Software that arbitrates and controls VM access to the actual underlying hardware.
de: Software, die den VM-Zugriff auf die tatsächlich zugrunde liegende Hardware verteilt und steuert.

source: Software that enables multiple VMs to share a single physical NIC within Compute.
de: Software, die es mehreren VMs ermöglicht, ein einzelnes physisches NIC innerhalb von Compute gemeinsam zu nutzen.

source: Software that runs on a host or node and provides the features and functions of a hardware-based network switch.
de: Software, die auf einem Host oder Knoten läuft und die Funktionen eines hardwarebasierten Netzwerkswitches bietet.

source: Software-defined networking (SDN)
de: Software-definierte Netzwerke (SDN)

source: SolidFire Volume Driver
de: SolidFire Volumentreiber

source: Some tips:
de: Einige Tipps:

source: Something you must be aware of before proceeding.
de: Etwas, dass Sie zur Kenntnis nehmen müssen, bevor Sie fortfahren.

source: Special project that contains all services that are listed in the catalog.
de: Spezielles Projekt, das alle im Katalog aufgelisteten Dienste enthält.

source: Specialized microprocessor for incorporating cryptographic keys into devices for authenticating and securing a hardware platform.
de: Spezialisierter Mikroprozessor zur Integration kryptographischer Schlüssel in Vorrichtungen zur Authentifizierung und Sicherung einer Hardwareplattform.

source: Specification for managing identity in the cloud, currently unsupported by OpenStack.
de: Spezifikation für die Verwaltung von Identität in der Cloud, die derzeit nicht von OpenStack unterstützt wird.

source: Specifies additional requirements when Compute determines where to start a new instance. Examples include a minimum amount of network bandwidth or a GPU.
de: Gibt zusätzliche Anforderungen an, wenn Compute bestimmt, wo eine neue Instanz gestartet werden soll. Beispiele umfassen eine minimale Anzahl an Netzwerkbandbreite oder GPU.

source: Specifies the authentication source used by Image service or Identity. In the Database service, it refers to the extensions implemented for a data store.
de: Gibt die Authentifizierungsquelle an, die vom Image-Dienst oder der Identität verwendet wird. Im Dienst Database bezieht er sich auf die für einen Datenspeicher implementierten Erweiterungen.

source: Standard for packaging VM images. Supported in OpenStack.
de: Standard für das Verpacken von VM-Images. Wird von OpenStack unterstützt.

source: Storage protocol similar in concept to TCP/IP; encapsulates SCSI commands and data.
de: Speicherprotokoll ähnlich im Konzept zu TCP/IP; kapselt SCSI-Befehle und Daten.

source: Storage protocol that encapsulates SCSI frames for transport over IP networks. Supported by Compute, Object Storage, and Image service.
de: Speicherprotokoll, das SCSI-Frames für den Transport über IP-Netzwerke einkapselt. Unterstützt von Compute, Objektspeicher und Abbilddienst.

source: Stores CephFS metadata.
de: Speichert CephFS Metadaten.

source: String of text known only by the user; used along with an access key to make requests to the Compute API.
de: Zeichenkette aus Text, die nur dem Benutzer bekannt ist; wird zusammen mit einem Zugriffsschlüssel verwendet, um Anfragen an die Compute API zu stellen.

source: Subdivides physical CPUs. Instances can then use those divisions.
de: Unterteilt physische CPUs. Instanzen können dann diese Abteilungen nutzen.

source: Supports interaction with VMware products in Compute.
de: Unterstützt die Interaktion mit VMware Produkten in Compute.

source: Term for an :term:`Object Storage<Object Storage service (swift)>` process that runs for a long time. Can indicate a hung process.
de: Begriff für einen :term:`Object Storage<Object Storage service (swift)>` Prozess, der über einen längeren Zeitraum läuft. Kann auf einen aufgehängten Prozess hinweisen.

source: Term used in the OSI network architecture for the data link layer. The data link layer is responsible for media access control, flow control and detecting and possibly correcting errors that may occur in the physical layer.
de: In der OSI-Netzwerkarchitektur verwendeter Begriff für die Datenverbindungsschicht. Die Datenverbindungsschicht ist verantwortlich für die Medienzugriffskontrolle, die Flusskontrolle sowie das Erkennen und gegebenenfalls Korrigieren von Fehlern, die in der physikalischen Schicht auftreten können.

source: Term used in the OSI network architecture for the network layer. The network layer is responsible for packet forwarding including routing from one node to another.
de: Begriff, der in der OSI-Netzwerkarchitektur für die Netzwerkschicht verwendet wird. Die Netzwerkschicht ist für die Paketweiterleitung einschließlich der Weiterleitung von einem Knoten zum anderen verantwortlich.

source: The API used to access the OpenStack Identity service provided through keystone.
de: Die API wurde für den Zugriff auf den OpenStack Identitätsdienst verwendet, der über Keystone bereitgestellt wird.

source: The Amazon commercial block storage product.
de: Das kommerzielle Blockspeicherprodukt von Amazon.

source: The Amazon commercial compute product, similar to Compute.
de: Das kommerzielle Compute-Produkt von Amazon, ähnlich wie Compute.

source: The Apache Software Foundation supports the Apache community of open-source software projects. These projects provide software products for the public good.
de: Die Apache Software Foundation unterstützt die Apache Community von Open-Source-Softwareprojekten. In diesen Projekten werden Softwareprodukte für das Gemeinwohl bereitgestellt.
