Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de

source: public key authentication
de: Public-Key-Authentifizierung

source: rate limit
de: Ratenbegrenzung

source: raw
de: roh

source: rebalance
de: Neugewichtung

source: reboot
de: Neu starten

source: rebuild
de: wieder aufbauen

source: reference architecture
de: reference architecture [Referenzarchitektur]

source: registry
de: registry [Registrierung]

source: registry server
de: registry server [Registrierungungsserver]

source: scrubber
de: Schrubber

source: secret key
de: Geheimschlüssel

source: secure boot
de: sicherer Start

source: secure shell (SSH)
de: sichere Shell (SSH)

source: security group
de: Sicherheitsgruppe

source: segmented object
de: segmentiertes Objekt

source: self-service
de: Selbstbedienung

source: server image
de: Server-Abbild

source: service
de: Dienst

source: service ID
de: service ID [Dienstkennung]

source: service catalog
de: service catalog [Dienstekatalog]

source: share
de: Share [Freigabe]

source: share network
de: Share network [Freigabenetzwerk]

source: shared IP address
de: shared IP address [geteilte IP-Adresse]

source: snapshot
de: Momentaufnahme

source: stack
de: Stapel

source: static IP address
de: statische IP-Adresse

source: storage back end
de: Speicher-Backend

source: storage manager
de: Speichermanager

source: storage manager back end
de: Speichermanager Backend

source: storage node
de: Speicherknoten

source: storage services
de: Speicherdienstleistungen

source: strategy
de: Strategie

source: subdomain
de: Subdomäne

source: subnet
de: Subnetz

source: suspend
de: sperren

source: system usage
de: Systemauslastung

source: trusted platform module (TPM)
de: vertrauenswürdiges Plattformmodul (TPM)

source: unscoped token
de: unskopiertes Token

source: virtual IP address (VIP)
de: virtuelle IP-Adresse (VIP)

source: virtual VLAN
de: virtuelles VLAN

source: virtual machine (VM)
de: virtuelle Maschine (VM)

source: virtual private network (VPN)
de: Virtuelles Privates Netzwerk (VPN)

source: virtual switch (vSwitch)
de: virtueller Switch (vSwitch)

source: volume
de: Datenträger

source: volume ID
de: Datenträger ID

source: volume controller
de: Datenträger Controller

source: volume driver
de: Datenträgertreiber

source: volume node
de: volume node [Datenträger-Knoten]

source: volume plug-in
de: volume plug-in [Datenträger Plug-in]

source: weight
de: weight [Gewichtung]

source: weighted cost
de: weighted cost [Gewichtungskosten]

source: weighting
de: gewichten
