Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de

source: The Block Storage driver for the SolidFire iSCSI storage appliance.
de: Der Blockspeichertreiber für die SolidFire iSCSI Storage Appliance.

source: The Border Gateway Protocol is a dynamic routing protocol that connects autonomous systems. Considered the backbone of the Internet, this protocol connects disparate networks to form a larger network.
de: Das Border Gateway Protocol ist ein dynamisches Routing-Protokoll, das autonome Systeme miteinander verbindet. Als das Rückgrat des Internets, verbindet dieses Protokoll disparate Netzwerke zu einem größeren Netzwerk.

source: The Ceph storage daemon.
de: Der Ceph Speicher-Daemon.

source: The Compute RabbitMQ message exchange that remains active when the server restarts.
de: Der Compute RabbitMQ Nachrichtenaustausch, der beim Neustart des Servers aktiv bleibt.

source: The Compute VM scheduling algorithm that attempts to start a new VM on the host with the least amount of load.
de: Der Compute VM Scheduling Algorithmus, der versucht, eine neue VM auf dem Host mit der geringsten Last zu starten.

source: The Compute component that chooses suitable hosts on which to start VM instances.
de: Die Compute Komponente, die einen passenden Host zum starten von VM Instanzen auswählt.

source: The Compute component that contains a list of the current capabilities of each host within the cell and routes requests as appropriate.
de: Die Computerkomponente, die eine Liste der aktuellen Fähigkeiten eines jeden Hosts innerhalb der Zelle enthält, und leitet die Anforderungen entsprechend ab.

source: The Compute component that gives IP addresses to authorized nodes and assumes DHCP, DNS, and routing configuration and services are provided by something else.
de: Die Compute-Komponente, die IP-Adressen an autorisierte Knoten angibt und DHCP-, DNS- und Routing-Konfiguration und Dienste übernimmt, wird von etwas anderem bereitgestellt.

source: The Compute component that manages various network components, such as firewall rules, IP address allocation, and so on.
de: Die Compute-Komponente, die verschiedene Netzwerkkomponenten verwaltet, wie z.B. Firewall-Regeln, IP-Adressvergabe usw.

source: The Compute component that provides dnsmasq (DHCP, DNS, BOOTP, TFTP) and radvd (routing) services.
de: Eine Komponente von Compute, die dnsmasq (DHCP, DNS, BOOTP, TFTP) und radvd (routing) Dienste zur Verfügung stellt.

source: The Compute component that runs on each compute node and manages the VM instance lifecycle, including run, reboot, terminate, attach/detach volumes, and so on. Provided by the nova-compute daemon.
de: Die Compute Komponente, die auf jedem Compute-Knoten läuft und die VM Instanzen währen ihres Lebenszyklus verwaltet, einschließlich laufen lassen, neu starten, beenden, hinzufügen oder wegnehmen von Datenträgern und so weiter. Bereitgestellt durch den nova-compute Dämon.

source: The Compute direct exchanges, fanout exchanges, and topic exchanges use this key to determine how to process a message; processing varies depending on exchange type.
de: Die Compute Direct Exchange, Fanout Exchange und Topic Exchange verwenden diesen Schlüssel, um festzulegen, wie eine Nachricht verarbeitet werden soll; die Verarbeitung variiert je nach Austauschtyp.

source: The Compute scheduling method that attempts to fill a host with VMs rather than starting new VMs on a variety of hosts.
de: Die Compute-Scheduling-Methode, die versucht, einen Host mit VMs zu füllen, anstatt neue VMs auf einer Vielzahl von Hosts zu starten.

source: The Compute service can send alerts through its notification system, which includes a facility to create custom notification drivers. Alerts can be sent to and displayed on the dashboard.
de: Der Compute-Dienst kann über sein Benachrichtigungssystem Benachrichtigungen senden, zu dem auch die Möglichkeit zur Erstellung benutzerdefinierter Benachrichtigungstreiber gehört. Benachrichtigungen können an das Dashboard gesendet und dort angezeigt werden.

source: The Compute service provides accounting information through the event notification and system usage data facilities.
de: Der Compute-Service liefert Informationen über die Ereignisbenachrichtigung und die Systemnutzungsdaten.

source: The Compute setting that enables or disables RAM overcommitment.
de: Die Compute-Einstellung, die die RAM-Überverpflichtung aktiviert oder deaktiviert.

source: The Identity component that provides high-level authorization services.
de: Die Identitätskomponente, die hochrangige Berechtigungsdienste bereitstellt.

source: The Identity service component that provides authentication services.
de: Die Identitätsdienstkomponente, die Authentifizierungsdienste bereitstellt.

source: The Identity service endpoint template that contains services available to all projects.
de: Die Endpunktvorlage für Identitätsdienste, die Dienste enthält, die für alle Projekte verfügbar sind.

source: The Image service API endpoint for management of VM images. Processes client requests for VMs, updates Image service metadata on the registry server, and communicates with the store adapter to upload VM images from the back-end store.
de: Der Abild-Dienst API-Endpunkt für die Verwaltung von VM-Abbildern. Verarbeitet Client-Anfragen für VMs, aktualisiert Abbild-Dienst-Metadaten auf dem Registrierungsserver und kommuniziert mit dem Shop-Adapter, um VM-Abbilder aus dem Backend-Speicher hochzuladen.

source: The Launchpad bugs area
de: Die Launchpad Bugs Area

source: The Network Controller provides virtual networks to enable compute servers to interact with each other and with the public network. All machines must have a public and private network interface. A VLAN network is a private network interface, which is controlled by the ``vlan_interface`` option with VLAN managers.
de: Der Netzwerkcontroller stellt virtuelle Netzwerke zur Verfügung, um Computing-Servern zu ermöglichen, miteinander und mit dem öffentlichen Netzwerk zu interagieren. Alle Maschinen müssen über eine öffentliche und private Netzwerkschnittstelle verfügen. Ein VLAN-Netzwerk ist eine private Netzwerkschnittstelle, die von der `` vlan_interface`` Option mit VLAN-Managern gesteuert wird.

source: The Network Controller provides virtual networks to enable compute servers to interact with each other and with the public network. All machines must have a public and private network interface. A private network interface can be a flat or VLAN network interface. A flat network interface is controlled by the flat_interface with flat managers. A VLAN network interface is controlled by the ``vlan_interface`` option with VLAN managers.
de: Der Netzwerkcontroller stellt virtuelle Netzwerke zur Verfügung, um Compute-Servern zu ermöglichen, miteinander und mit dem öffentlichen Netzwerk zu interagieren. Alle Maschinen müssen über eine öffentliche und private Netzwerkschnittstelle verfügen. Eine private Netzwerkschnittstelle kann eine flache oder VLAN-Netzwerkschnittstelle sein. Eine flache Netzwerkschnittstelle wird von der Flat_interface mit Flatmanagern gesteuert. Eine VLAN-Netzwerkschnittstelle wird durch die ``vlan_interface``-Option mit VLAN-Managern gesteuert.

source: The Network Controller provides virtual networks to enable compute servers to interact with each other and with the public network. All machines must have a public and private network interface. The public network interface is controlled by the ``public_interface`` option.
de: Der Netzwerk-Controller stellt virtuelle Netzwerke zur Verfügung, damit Rechenserver untereinander und mit dem öffentlichen Netzwerk interagieren können. Alle Maschinen müssen über eine öffentliche und private Netzwerkschnittstelle verfügen. Die öffentliche Netzwerkschnittstelle wird durch die Option ``public_interface`` gesteuert.

source: The Object Storage back-end process that creates and manages object replicas.
de: Der Objektspeicher-Back-End-Prozess, der Objektrepliken erstellt und verwaltet.

source: The Object Storage component that provides container services, such as create, delete, list, and so on.
de: Die Objektspeicherungskomponente, die Containerdienste bereitstellt, z. B. Erstellen, Löschen, Listen und so weiter.

source: The Object Storage context of an account. Do not confuse with a user account from an authentication service, such as Active Directory, /etc/passwd, OpenLDAP, OpenStack Identity, and so on.
de: Der Objektspeicherungskontext eines Kontos. Verwechseln Sie es nicht mit einem Benutzerkonto von einem Authentifizierungsdienst wie Active Directory, / etc / passwd, OpenLDAP, OpenStack Identity usw.

source: The OpenStack IRC channel
de: Der OpenStack IRC Kanal

source: The OpenStack community lives in the #openstack IRC channel on the Freenode network. You can hang out, ask questions, or get immediate feedback for urgent and pressing issues. To install an IRC client or use a browser-based client, go to `https://webchat.freenode.net/ <https://webchat.freenode.net>`_. You can also use `Colloquy <http://colloquy.info/>`_ (Mac OS X), `mIRC <https://www.mirc.com/>`_ (Windows), or XChat (Linux). When you are in the IRC channel and want to share code or command output, the generally accepted method is to use a Paste Bin. The OpenStack project has one at `Paste <http://paste.openstack.org>`_. Just paste your longer amounts of text or logs in the web form and you get a URL that you can paste into the channel. The OpenStack IRC channel is ``#openstack`` on ``irc.freenode.net``. You can find a list of all OpenStack IRC channels on the `IRC page on the wiki <https://wiki.openstack.org/wiki/IRC>`_.
de: Die OpenStack-Community lebt im IRC-Kanal #openstack im Freenode-Netzwerk. Sie können herumhängen, Fragen stellen oder sofortiges Feedback bei alarmierenden und dringenden Problemen erhalten. Um einen IRC-Client zu installieren oder einen browserbasierten Client zu verwenden, gehen Sie zu `https://webchat.freenode.net/ <https://webchat.freenode.net>``_. Sie können auch `Colloquy <http://colloquy.info/>`_ (Mac OS X), `mIRC <https://www.mirc.com/>``_ (Windows) oder XChat (Linux) verwenden. Wenn Sie sich im IRC-Kanal befinden und Code oder Befehlsausgabe gemeinsam nutzen möchten, ist die allgemein akzeptierte Methode die Verwendung eines Paste Bin. Das OpenStack-Projekt hat eine unter `Paste <http://paste.openstack.org>``_. Fügen Sie einfach Ihre längeren Textmengen oder Logs in das Webformular ein und Sie erhalten eine URL, die Sie in den Channel einfügen können. Der OpenStack-IRC-Kanal ist ``#openstack`` auf `irc.freenode.net``. Eine Liste aller OpenStack IRC-Kanäle finden Sie auf der `IRC-Seite im Wiki <https://wiki.openstack.org/wiki/IRC>``_.

source: The OpenStack community values your set up and testing efforts and wants your feedback. To log a bug, you must `sign up for a Launchpad account <https://launchpad.net/+login>`_. You can view existing bugs and report bugs in the Launchpad Bugs area. Use the search feature to determine whether the bug has already been reported or already been fixed. If it still seems like your bug is unreported, fill out a bug report.
de: Die OpenStack-Community schätzt Ihre Setup- und Testbemühungen ein und wünscht Ihr Feedback. Um einen Fehler zu protokollieren, müssen SIe sich für ein Launchpad-Konto anmelden <https://launchpad.net/+login> `_. Sie können vorhandene Fehler anzeigen und Fehler im Launchpad-Bugs-Bereich melden. Verwenden Sie die Suchfunktion, um festzustellen, ob der Fehler bereits gemeldet wurde oder bereits behoben wurde. Wenn es immer noch scheint, dass Ihr Bug nicht gemeldet wurde, füllen Sie einen Bugreport aus.

source: The OpenStack configuration files use an INI format to describe options and their values. It consists of sections and key value pairs.
de: Die OpenStack-Konfigurationsdateien verwenden ein INI-Format, um Optionen und deren Werte zu beschreiben. Es besteht aus Abschnitten und Schlüsselwertpaaren.

source: The OpenStack core project that implements services and associated libraries to provide massively-scalable, on-demand, self-service access to compute resources, including bare metal, virtual machines, and containers.
de: Das OpenStack Kernprojekt, dass Dienste und Bibliotheken implementiert und massiv-skalierbaren, Selbstbedienungszugriff auf Verlangen für Compute Ressourcen bereit stellt, einschließlich Bare Metal, virtuellen Maschinen und Containern.

source: The OpenStack core project that provides eventually consistent and redundant storage and retrieval of fixed digital content.
de: Das OpenStack-Kernprojekt, das eine konsistente und redundante Speicherung und Abfrage von festen digitalen Inhalten ermöglicht.

source: The OpenStack documentation uses several typesetting conventions.
de: Die Openstack-Dokumentation verwendet mehrere Schreibweisen.

source: The OpenStack project which collects measurements of the utilization of the physical and virtual resources comprising deployed clouds, persists this data for subsequent retrieval and analysis, and triggers actions when defined criteria are met.
de: Das OpenStack-Projekt, das Messungen der Nutzung der physischen und virtuellen Ressourcen, bestehend aus implementierten Clouds, sammelt, hält diese Daten für die nachfolgende Abfrage und Analyse fort und löst Aktionen aus, wenn definierte Kriterien erfüllt sind.

source: The OpenStack project which implements services and associated libraries to provide on-demand, scalable, and technology-agnostic network abstraction.
de: Das OpenStack-Projekt, das Dienste und zugehörige Bibliotheken implementiert, um On-Demand-, skalierbare und technologieunabhängige Netzwerkabstraktion bereitzustellen.

source: The OpenStack service that implement services and libraries to provide on-demand, self-service access to Block Storage resources via abstraction and automation on top of other block storage devices.
de: Der OpenStack-Dienst, der Dienste und Bibliotheken implementiert, um On-Demand-Self-Service-Zugriff auf Blockspeicherressourcen durch Abstraktion und Automatisierung auf anderen Blockspeichergeräten zu ermöglichen.

source: The OpenStack service that provide services and associated libraries to store, browse, share, distribute and manage bootable disk images, other data closely associated with initializing compute resources, and metadata definitions.
de: Der OpenStack-Dienst, der Dienste und zugehörige Bibliotheken zum Speichern, Durchsuchen, Freigeben, Verteilen und Verwalten von bootfähigen Festplattenabbildern, anderen Daten, die eng mit der Initialisierung von Rechenressourcen verbunden sind, und Metadaten-Definitionen bereitstellt.

source: The OpenStack service that provides a multi-project, highly scalable, performant, fault-tolerant monitoring-as-a-service solution for metrics, complex event processing and logging. To build an extensible platform for advanced monitoring services that can be used by both operators and projects to gain operational insight and visibility, ensuring availability and stability.
de: Der OpenStack-Dienst, der eine projektübergreifende, hochskalierbare, performante, fehlertolerante Überwachungs-as-a-Service Lösung für Metriken, komplexe Ereignisverarbeitung und Protokollierung bietet. Aufbau einer erweiterbaren Plattform für fortschrittliche Überwachungsdienste, die sowohl von Betreibern als auch von Projekten genutzt werden kann, um betriebliche Einblicke und Transparenz zu gewinnen und Verfügbarkeit und Stabilität zu gewährleisten.

source: The OpenStack service that provides a service and associated libraries capable of managing and provisioning physical machines in a security-aware and fault-tolerant manner.
de: Der OpenStack-Dienst, der einen Dienst und zugehörige Bibliotheken bereitstellt, die in der Lage sind, physische Maschinen sicherheitsbewusst und fehlertolerant zu verwalten und bereitzustellen.

source: The OpenStack service that provides a simple YAML-based language to write workflows (tasks and transition rules) and a service that allows to upload them, modify, run them at scale and in a highly available manner, manage and monitor workflow execution state and state of individual tasks.
de: Der OpenStack-Dienst, der eine einfache YAML-basierte Sprache zur Verfügung stellt, um Workflows (Aufgaben und Übergangsregeln) zu schreiben, und einen Dienst, der es erlaubt, sie hochzuladen, zu modifizieren, sie im Maßstab und in einer hochverfügbaren Weise auszuführen, zu verwalten und zu überwachen.

source: The OpenStack service which orchestrates composite cloud applications using a declarative template format through an OpenStack-native REST API.
de: Der OpenStack-Dienst, der Composite Cloud-Anwendungen mit einem deklarativen Vorlagenformat über eine OpenStack-native REST-API orchestriert.

source: The OpenStack wiki
de: Das OpenStack Wiki

source: The POSIX-compliant file system provided by Ceph.
de: Das von Ceph bereitgestellte POSIX-konforme Dateisystem.

source: The VM instance is paused and its state is saved to disk of the host.
de: Die VM-Instanz wird angehalten und ihr Zustand wird auf der Festplatte des Hosts gespeichert.

source: The Xen administrative API, which is supported by Compute.
de: Die Xen-Administrations-API, die von Compute.

source: The `OpenStack wiki <https://wiki.openstack.org/>`_ contains a broad range of topics but some of the information can be difficult to find or is a few pages deep. Fortunately, the wiki search feature enables you to search by title or content. If you search for specific information, such as about networking or OpenStack Compute, you can find a large amount of relevant material. More is being added all the time, so be sure to check back often. You can find the search box in the upper-right corner of any OpenStack wiki page.
de: Das `OpenStack wiki <https://wiki.openstack.org/>` _ enthält eine breite Palette von Themen, aber einige der Informationen können schwer zu finden oder sind ein paar Seiten tief. Glücklicherweise können Sie mit der Wiki-Suchfunktion nach Titel oder Inhalt suchen. Wenn Sie nach bestimmten Informationen suchen, z. B. über Networking oder OpenStack Compute, finden Sie eine große Menge an relevanten Material. Mehr wird die ganze Zeit hinzugefügt. Sie finden das Suchfeld in der oberen rechten Ecke einer beliebigen OpenStack Wiki Seite.

source: The ``nova-network`` worker daemon; provides services such as giving an IP address to a booting nova instance.
de: Der Worker-Daemon ``nova-network`` stellt Dienste zur Verfügung, wie z.B. das Geben einer IP-Adresse an eine bootfähige nova-Instanz.

source: The ``root`` user must run commands that are prefixed with the ``#`` prompt. You can also prefix these commands with the :command:`sudo` command, if available, to run them.
de: Der ``root`` Benutzer muss Befehle ausführen, denen die ``# `` Eingabeaufforderung vorangestellt ist. Sie können diese Befehle auch mit dem Befehl: `sudo` voranstellen, falls vorhanden, um sie auszuführen.

source: The ability to encrypt data at the file system, disk partition, or whole-disk level. Supported within Compute VMs.
de: Die Fähigkeit, Daten im Dateisystem, auf der Festplattenpartition oder auf der Festplatte zu verschlüsseln. Unterstützt in Compute VMs.

source: The ability to guarantee certain network or storage requirements to satisfy a Service Level Agreement (SLA) between an application provider and end users. Typically includes performance requirements like networking bandwidth, latency, jitter correction, and reliability as well as storage performance in Input/Output Operations Per Second (IOPS), throttling agreements, and performance expectations at peak load.
de: Die Fähigkeit, bestimmte Netzwerk- oder Speicheranforderungen zu gewährleisten, um ein Service Level Agreement (SLA) zwischen einem Anwendungsanbieter und Endbenutzern zu erfüllen. Dazu gehören typischerweise Leistungsanforderungen wie Netzwerkbandbreite, Latenz, Jitterkorrektur und Zuverlässigkeit sowie die Speicherleistung bei Input/Output Operations Per Second (IOPS), Drosselklauseln und Leistungserwartungen bei Spitzenlast.

source: The ability to start new VM instances based on the actual memory usage of a host, as opposed to basing the decision on the amount of RAM each running instance thinks it has available. Also known as RAM overcommit.
de: Die Fähigkeit, neue VM-Instanzen auf der Grundlage der tatsächlichen Speichernutzung eines Hosts zu starten, im Gegensatz zur Entscheidung basierend auf die Menge an RAM jede laufende Instanz. Auch als RAM-Overcommit bekannt.

source: The ability to start new VM instances based on the actual memory usage of a host, as opposed to basing the decision on the amount of RAM each running instance thinks it has available. Also known as memory overcommit.
de: Die Möglichkeit, neue VM-Instanzen basierend auf der tatsächlichen Speichernutzung eines Hosts zu starten, anstatt die Entscheidung auf der Grundlage der RAM-Menge zu treffen, die jede laufende Instanz für verfügbar hält. Auch bekannt als Memory Overcommit.

source: The ability within Compute to move running virtual machine instances from one host to another with only a small service interruption during switchover.
de: Die Fähigkeit innerhalb von Compute, laufende Instanzen virtueller Maschinen von einem Host zum anderen zu verschieben, mit nur einer kleinen Dienstunterbrechung während der Umstellung.

source: The act of verifying that a user, process, or client is authorized to perform an action.
de: Der Akt der Überprüfung, ob ein Benutzer, ein Prozess oder ein Client berechtigt ist, eine Aktion durchzuführen.

source: The amount of available data used by communication resources, such as the Internet. Represents the amount of data that is used to download things or the amount of data available to download.
de: Die Menge der verfügbaren Daten, die von Kommunikationsressourcen wie dem Internet verwendet werden. Stellt die Datenmenge dar, die zum Herunterladen verwendet wird, oder die Datenmenge, die zum Herunterladen zur Verfügung steht.

source: The amount of time it takes for a new Object Storage object to become accessible to all clients.
de: Die Zeitdauer, bis ein neues Objektspeicherobjekt für alle Clients zugänglich gemacht wird.

source: The association between an Image service VM image and a project. Enables images to be shared with specified projects.
de: Die Zuordnung zwischen einem Abbilddienst-VM-Abbild und einem Projekt. Ermöglicht die Freigabe von Abbildern mit bestimmten Projekten.

source: The back-end store used by Image service to store VM images, options include Object Storage, locally mounted file system, RADOS block devices, VMware datastore, or HTTP.
de: Der Backend-Speicher, der vom Abbild-Dienst zum Speichern von VM-Abbildern verwendet wird, umfasst Object Storage, lokal eingebundene Dateisysteme, RADOS-Blockgeräte, VMware-Datenspeicher oder HTTP.

source: The code name for the eighth release of OpenStack. The design summit took place in Portland, Oregon, US and Havana is an unincorporated community in Oregon.
de: Der Codename für die achte Version von OpenStack. Der Design Summit fand in Portland, Oregon, USA statt und Havanna eine uneingetragene Gemeinde in Oregon statt.

source: The code name for the eightteenth release of OpenStack. The design summit will take place in Vancouver, Kanada. The release is named after the Rocky Mountains.
de: Der Codename für die 18. Version von OpenStack. Der Design Summit wird in Vancouver, Kanada, abgehalten. Die Version ist nach den Rocky Mountains benannt.
