Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de

source: A specification that, when implemented by a physical PCIe device, enables it to appear as multiple separate PCIe devices. This enables multiple virtualized guests to share direct access to the physical device, offering improved performance over an equivalent virtual device. Currently supported in OpenStack Havana and later releases.
de: Eine Spezifikation, die, wenn sie von einem physikalischen PCIe-Gerät implementiert wird, es ermöglicht, als mehrere separate PCIe-Geräte zu erscheinen. Dies ermöglicht es mehreren virtualisierten Gästen, direkten Zugriff auf das physische Gerät zu ermöglichen und eine verbesserte Leistung über ein gleichwertiges virtuelles Gerät zu bieten. Derzeit unterstützt in OpenStack Havanna und späteren Versionen.

source: A standardized interface for managing compute, data, and network resources, currently unsupported in OpenStack.
de: Eine standardisierte Schnittstelle zur Verwaltung von Rechen-, Daten- und Netzwerkressourcen, die derzeit in OpenStack nicht unterstützt wird.

source: A string of text provided to the client after authentication. Must be provided by the user or process in subsequent requests to the API endpoint.
de: Eine Zeichenfolge, die dem Client nach der Authentifizierung zur Verfügung gestellt wird. Muss vom Benutzer oder Prozess in nachfolgenden Anfragen an den API-Endpunkt bereitgestellt werden.

source: A subset of API calls that are accessible to authorized administrators and are generally not accessible to end users or the public Internet. They can exist as a separate service (keystone) or can be a subset of another API (nova).
de: Eine Teilmenge von API-Aufrufen, die für autorisierte Administratoren zugänglich sind und im Allgemeinen für Endbenutzer oder das öffentliche Internet nicht zugänglich sind. Sie können als separater Dienst (Keystone) oder als Teilmenge einer anderen API (nova) existieren.

source: A system by which Internet domain name-to-address and address-to-name resolutions are determined. DNS helps navigate the Internet by translating the IP address into an address that is easier to remember. For example, translating 111.111.111.1 into www.yahoo.com. All domains and their components, such as mail servers, utilize DNS to resolve to the appropriate locations. DNS servers are usually set up in a master-slave relationship such that failure of the master invokes the slave. DNS servers might also be clustered or replicated such that changes made to one DNS server are automatically propagated to other active servers. In Compute, the support that enables associating DNS entries with floating IP addresses, nodes, or cells so that hostnames are consistent across reboots.
de: Ein System, mit dem Internet Domain Name-to-Address und Address-to-Name-Auflösungen ermittelt werden. DNS hilft, das Internet zu navigieren, indem man die IP-Adresse in eine Adresse umwandelt, die einfacher zu merken ist. Zum Beispiel, übersetzen 111.111.111.1 in www.yahoo.com. Alle Domänen und deren Komponenten, wie z. B. Mailserver, verwenden DNS, um die entsprechenden Standorte zu lösen. DNS-Server werden in der Regel in einer Master-Slave-Beziehung eingerichtet, so dass der Ausfall des Masters den Slave aufruft. DNS-Server können auch gruppiert oder repliziert werden, so dass Änderungen an einem DNS-Server automatisch an andere aktive Server weitergegeben werden. Compute unterstützt die Zuordnung von DNS-Einträgen mit Floating-IP-Adressen, Knoten oder Zellen ermöglicht, so dass Hostnamen über Reboots konsistent sind.

source: A system that provides services to other system entities. In case of federated identity, OpenStack Identity is the service provider.
de: Ein System, das Dienste für andere Systementitäten bereitstellt. Im Falle einer föderierten Identität ist OpenStack Identity der Dienstanbieter.

source: A tool to automate system configuration and installation on Debian-based Linux distributions.
de: Ein Tool zur Automatisierung der Systemkonfiguration und Installation auf Debian-basierten Linux-Distributionen.

source: A tool to automate system configuration and installation on Red Hat, Fedora, and CentOS-based Linux distributions.
de: Ein Tool zur Automatisierung der Systemkonfiguration und -installation auf Red Hat-, Fedora- und CentOS-basierten Linux-Distributionen.

source: A type of VM image that exists as a single, bootable file.
de: Eine Art VM-Abbild, das als einzelne, bootfähige Datei vorliegt.

source: A type of image file that is commonly used for animated images on web pages.
de: Eine Art von Bilddatei, die häufig für animierte Bilder auf Webseiten verwendet wird.

source: A type of reboot where a physical or virtual power button is pressed as opposed to a graceful, proper shutdown of the operating system.
de: Eine Art von Neustart, wo eine physische oder virtuelle Power-Taste gedrückt wird, im Gegensatz zu einem sanften, ordnungsgemäßen Herunterfahren des Betriebssystems.

source: A unique ID given to each replica of an Object Storage database.
de: Eine eindeutige ID, die jedem Replikat einer Object Storage-Datenbank zugewiesen wird.

source: A unit of storage within Object Storage used to store objects. It exists on top of devices and is replicated for fault tolerance.
de: Eine Speichereinheit innerhalb des Objektspeichers, die zum Speichern von Objekten verwendet wird. Es existiert auf den Geräten und wird zur Fehlertoleranz repliziert.

source: A user-created Python module that is loaded by horizon to change the look and feel of the dashboard.
de: Ein benutzerdefiniertes Python-Modul, das nach Horizon geladen wird, um das Aussehen des Dashboards zu ändern.

source: A virtual network port within Networking; VIFs / vNICs are connected to a port.
de: Ein virtueller Netzwerkanschluss innerhalb von Networking; VIFs / vNICs sind mit einem Port verbunden.

source: A virtual network that provides connectivity between entities. For example, a collection of virtual ports that share network connectivity. In Networking terminology, a network is always a layer-2 network.
de: Ein virtuelles Netzwerk, das die Verbindung zwischen den Einheiten ermöglicht. Zum Beispiel eine Sammlung von virtuellen Ports, die sich die Netzwerkkonnektivität teilen. In der Netzwerkterminologie ist ein Netzwerk immer ein Layer-2-Netzwerk.

source: A web framework used extensively in horizon.
de: Ein von Horizon ausgiebig genutztes Web-Framework.

source: A worker process that verifies the integrity of Object Storage objects, containers, and accounts. Auditors is the collective term for the Object Storage account auditor, container auditor, and object auditor.
de: Ein Worker-Prozess, der die Integrität von Objekt Storage Objekten, Containern und Konten verifiziert. Auditor ist der kollektive Ausdruck für Objekt Storage Konten-Auditor, Container-Auditor und Objekt-Auditor.

source: A wrapper used by the Image service that contains a VM image and its associated metadata, such as machine state, OS disk size, and so on.
de: Ein Wrapper, der von dem Abbilddienst verwendet wird, der ein VM-Abbild und die zugehörigen Metadaten enthält, z. B. den Maschinenzustand, die Größe des Betriebssystems und so weiter.

source: API endpoint
de: API-Endpunkt

source: API extension
de: API-Erweiterung

source: API extension plug-in
de: API-Erweiterungs-Plugin

source: API key
de: API-Schlüssel

source: API used to access OpenStack :term:`Object Storage<Object Storage service (swift)>`.
de: API für den Zugriff auf OpenStack :term:`Object Storage<Object Storage service (swift)>`.

source: API used to access OpenStack Networking. Provides an extensible architecture to enable custom plug-in creation.
de: API für den Zugriff auf OpenStack Networking. Bietet eine erweiterbare Architektur, um die Erstellung benutzerdefinierter Plug-Ins zu ermöglichen.

source: AWS CloudFormation allows Amazon Web Services (AWS) users to create and manage a collection of related resources. The Orchestration service supports a CloudFormation-compatible format (CFN).
de: AWS CloudFormation ermöglicht es Amazon Web Services (AWS) Nutzern, eine Sammlung von verwandten Ressourcen zu erstellen und zu verwalten. Der Orchestrierungsdienst unterstützt ein CloudFormation-kompatibles Format (CFN).

source: AWS CloudFormation template
de: AWS CloudFormation Vorlage

source: Absolute limit on the amount of network traffic a Compute VM instance can send and receive.
de: Absolute Begrenzung der Menge des Netzwerkverkehrs, die eine Compute VM-Instanz senden und empfangen kann.

source: Acts as the gatekeeper to Object Storage and is responsible for authenticating the user.
de: Funktioniert als Gatekeeper zum Objektspeicher und ist für die Authentifizierung des Benutzers verantwortlich.

source: Address Resolution Protocol (ARP)
de: Adressauflösungsprotokoll (ARP)

source: Advanced Message Queuing Protocol (AMQP)
de: Erweitertes Nachrichtenwarteschlangenprotokoll (AMQP)

source: All OpenStack core projects are provided under the terms of the Apache License 2.0 license.
de: Alle OpenStack-Kernprojekte werden unter den Bedingungen der Apache License 2.0 Lizenz bereitgestellt.

source: Allows a user to set a flag on an :term:`Object Storage<Object Storage service (swift)>` container so that all objects within the container are versioned.
de: Ermöglicht es einem Benutzer, ein Flag auf einen :term:`Object Storage<Object Storage service (swift)>` Container zu setzen, so dass alle Objekte innerhalb des Containers versioniert werden.

source: Alphanumeric ID assigned to each Identity service role.
de: Alphanumerische ID, die jeder Identitätsdienstrolle zugeordnet ist.

source: Alternative name for the :term:`Image API`.
de: Alternativer Name für den :term:`Abbild API`.

source: Alternative name for the Block Storage API.
de: Alternativer Name für die Block Storage API.

source: Alternative term for a Networking plug-in or Networking API extension.
de: Alternativer Begriff für ein Networking-Plugin oder eine Networking-API-Erweiterung.

source: Alternative term for a RabbitMQ message exchange.
de: Alternativer Ausdruck für ein RabbitMQ Nachrichtenaustausch.

source: Alternative term for a VM image.
de: Alternativer Begriff für ein VM-Abbild.

source: Alternative term for a VM instance type.
de: Alternativer Ausdruck für VM Instanz-Typ.

source: Alternative term for a VM or guest.
de: Alternativer Begriff für eine VM oder einen Gast.

source: Alternative term for a cloud controller node.
de: Alternative Bezeichnung für einen Cloud-Controller-Knoten.

source: Alternative term for a cloudpipe.
de: Alternativer Ausdruck für Cloudpipe.

source: Alternative term for a fixed IP address.
de: Alternativer Begriff für eine feste IP-Adresse.

source: Alternative term for a flavor ID.
de: Alternativer Begriff für eine Flavor-ID.

source: Alternative term for a non-durable exchange.
de: Alternativer Begriff für eine nicht dauerhaften Austausch.

source: Alternative term for a non-durable queue.
de: Alternativer Begriff für eine nicht langlebige Warteschlange.

source: Alternative term for a virtual network.
de: Alternativer Begriff für ein virtuelles Netzwerk.

source: Alternative term for a volume plug-in.
de: Alternative Bezeichnung für ein Datenträger Plug-in.

source: Alternative term for an API extension or plug-in. In the context of Identity service, this is a call that is specific to the implementation, such as adding support for OpenID.
de: Alternativer Ausdruck für eine API Erweiterung oder ein Plug-in. Im ZUsammenhang mit dem Identitätsdienst ist dies ein implementierungsspezifischer Aufruf, wie z.B. das Hinzufügen der Unterstützung für OpenID.

source: Alternative term for an API token.
de: Alternativer Begriff für ein API-Token.

source: Alternative term for an Amazon EC2 access key. See EC2 access key.
de: Alternative Bezeichnung für einen Amazon EC2-Zugriffsschlüssel. Siehe EC2-Zugriffschluessel.

source: Alternative term for an Identity service catalog.
de: Alternativer Ausdruck für den Identity-Dienstekatalog.

source: Alternative term for an Identity service default token.
de: Alternativer Begriff für ein Identity Service Standard-Token.

source: Alternative term for an Object Storage authorization node.
de: Alternativer Begriff für einen Objektspeicherberechtigungsknoten.

source: Alternative term for an admin API.
de: Alternativer Begriff für eine Admin-API.

source: Alternative term for an ephemeral volume.
de: Alternativer Begriff für einen kurzlebigen Datenträger.

source: Alternative term for an image.
de: Alternativer Ausdruck für ein Abbild.

source: Alternative term for instance UUID.
de: Alternativer Begriff für Instanz, z.B. UUID.

source: Alternative term for non-durable.
de: Alternativer Begriff für nicht haltbar.

source: Alternative term for project.
de: Alternativer Begriff für das Projekt.

source: Alternative term for the :term:`Compute API <Compute API (nova API)>`.
de: Alternative Begriff für die :term:`Compute API <Compute API (nova API)>`.

source: Alternative term for the Identity service API.
de: Alternativer Ausdruck für die Identitätsdienst API.

source: Alternative term for the Identity service catalog.
de: Alternativer Ausdruck für den Identity-Dienstekatalog.

source: Alternative term for the Image service :term:`image registry`.
de: Alternativer Begriff für den Abbilddienst :term:`Abbildregistrierung`.

source: Alternative term for the Image service registry.
de: Alternativer Ausdruck für den Abbilddienstregistrierung.

source: An API endpoint used for both service-to-service communication and end-user interactions.
de: Ein API-Endpunkt, der sowohl für die Service-zu-Service-Kommunikation als auch für die Endbenutzer-Interaktionen verwendet wird.

source: An API on a separate endpoint for attaching, detaching, and creating block storage for compute VMs.
de: Eine API auf einem separaten Endpunkt zum Anhängen, Trennen und Erstellen von Blockspeicher für Compute VMs.

source: An API that is accessible to projects.
de: Eine API für Zugriffe auf Projekte.

source: An Amazon EBS storage volume that contains a bootable VM image, currently unsupported in OpenStack.
de: Ein Amazon EBS-Speicherdatenträger, das ein bootfähiges VM-Abbild enthält, das derzeit in OpenStack nicht unterstützt wird.

source: An Amazon EC2 concept of an isolated area that is used for fault tolerance. Do not confuse with an OpenStack Compute zone or cell.
de: Ein Amazon EC2 Konzept eines isolierten Bereichs, der zur Fehlertoleranz verwendet wird. Nicht zu verwechseln mit einer OpenStack Compute Zone oder Zelle.

source: An HTTP and reverse proxy server, a mail proxy server, and a generic TCP/UDP proxy server.
de: Ein HTTP- und Reverse-Proxy-Server, ein Mail-Proxy-Server und ein generischer TCP / UDP-Proxy-Server.

source: An IP address that a project can associate with a VM so that the instance has the same public IP address each time that it boots. You create a pool of floating IP addresses and assign them to instances as they are launched to maintain a consistent IP address for maintaining DNS assignment.
de: Eine IP-Adresse, die ein Projekt mit einer VM verknüpfen kann, so dass die Instanz bei jedem Booten die gleiche öffentliche IP-Adresse hat. Sie erstellen einen Pool von freien IP-Adressen und weisen diese beim Start Instanzen zu, um eine konsistente IP-Adresse für die Aufrechterhaltung der DNS-Zuordnung zu erhalten.

source: An IP address that can be assigned to a VM instance within the shared IP group. Public IP addresses can be shared across multiple servers for use in various high-availability scenarios. When an IP address is shared to another server, the cloud network restrictions are modified to enable each server to listen to and respond on that IP address. You can optionally specify that the target server network configuration be modified. Shared IP addresses can be used with many standard heartbeat facilities, such as keepalive, that monitor for failure and manage IP failover.
de: Eine IP-Adresse, die einer VM-Instanz innerhalb der gemeinsamen IP-Gruppe zugewiesen werden kann. Öffentliche IP-Adressen können über mehrere Server zur Verwendung in verschiedenen Hochverfügbarkeits-Szenarien freigegeben werden. Wenn eine IP-Adresse auf einen anderen Server freigegeben wird, werden die Beschränkungen des Cloud-Netzwerks geändert, um es jedem Server zu ermöglichen, auf diese IP-Adresse zu hören und darauf zu antworten. Sie können optional festlegen, dass die Zielserver-Netzwerkkonfiguration geändert wird. Gemeinsam genutzte IP-Adressen können mit vielen Standard-Heartbeat-Einrichtungen wie Keepalive verwendet werden, die auf Ausfall überwachen und IP-Failover verwalten.

source: An IP address that is accessible to end-users.
de: Eine IP-Adresse, die für Endbenutzer zugänglich ist.

source: An IP address that is associated with the same instance each time that instance boots, is generally not accessible to end users or the public Internet, and is used for management of the instance.
de: Eine IP-Adresse, die mit der gleichen Instanz verbunden ist, jedes Mal, wenn die Instanz bootet, ist im Allgemeinen nicht für Endbenutzer oder das öffentliche Internet zugänglich und wird für die Verwaltung der Instanz verwendet.

source: An IP address used for management and administration, not available to the public Internet.
de: Eine IP-Adresse, die für die Verwaltung und Verwaltung verwendet wird und nicht für das öffentliche Internet verfügbar ist.

source: An IP address, typically assigned to a router, that passes network traffic between different networks.
de: Eine IP-Adresse, die typischerweise einem Router zugewiesen wird, der den Netzwerkverkehr zwischen verschiedenen Netzwerken weiterleitet.

source: An Identity API v3 entity. Represents a collection of projects, groups and users that defines administrative boundaries for managing OpenStack Identity entities. On the Internet, separates a website from other sites. Often, the domain name has two or more parts that are separated by dots. For example, yahoo.com, usa.gov, harvard.edu, or mail.yahoo.com. Also, a domain is an entity or container of all DNS-related information containing one or more records.
de: Eine Identity API v3 Entity. Stellt eine Sammlung von Projekten, Gruppen und Benutzern dar, die administrative Grenzen für die Verwaltung von OpenStack Identity Entities definieren. Im Internet trennt man eine Website von anderen Seiten. Oft hat der Domain-Name zwei oder mehr Teile, die durch Punkte getrennt sind. Zum Beispiel, yahoo.com, usa.gov, harvard.edu oder mail.yahoo.com. Außerdem ist eine Domäne eine Entität oder ein Container aller DNS-bezogenen Informationen, die einen oder mehrere Datensätze enthalten.

source: An Identity service API access token that is associated with a specific project.
de: Ein Identitätsdienst-API-Zugriffstoken, der einem bestimmten Projekt zugeordnet ist.

source: An Identity service API endpoint that is associated with one or more projects.
de: Ein Identitätsdienst-API-Endpunkt, der mit einem oder mehreren Projekten verknüpft ist.

source: An Identity service component that manages and validates tokens after a user or project has been authenticated.
de: Eine Identitätsdienstkomponente, die Token verwaltet und validiert, nachdem sich ein Benutzer oder Projekt authentifiziert hat.

source: An Identity service feature that enables services, such as Compute, to automatically register with the catalog.
de: Eine Identitätsdienstfunktion, die Dienste, wie Compute, ermöglicht, sich automatisch mit dem Katalog zu registrieren.

source: An Identity service that lists API endpoints that are available to a user after authentication with the Identity service.
de: Ein Identitätsdienst, der API-Endpunkte auflistet, die einem Benutzer nach der Authentifizierung mit dem Identitätsdienst zur Verfügung stehen.

source: An Identity service token that is not associated with a specific project and is exchanged for a scoped token.
de: Ein Identitätsdienst-Token, der nicht einem bestimmten Projekt zugeordnet ist und gegen einen Scoped-Token ausgetauscht wird.

source: An Identity v3 API entity. Represents a collection of users that is owned by a specific domain.
de: Eine Identity v3 API-Einheit. Stellt eine Sammlung von Benutzern dar, die sich im Besitz einer bestimmten Domäne befindet.

source: An Image service VM image that is available to all projects.
de: Ein Abbild-Dienst VM-Abbild, das für alle Projekte verfügbar ist.

source: An Image service VM image that is only available to specified projects.
de: Ein Abbilddienst-VM-Abbild, das nur für bestimmte Projekte verfügbar ist.

source: An Image service container format that indicates that no container exists for the VM image.
de: Ein Abbild-Service-Containerformat, das anzeigt, dass kein Container für das VM-Abbild existiert.

source: An Image service that provides VM image metadata information to clients.
de: Ein Abbilddienst, der VM-Abbild-Metadateninformation an Mandaten zur Verfügung stellt.

source: An Internet Protocol (IP) address configured on the load balancer for use by clients connecting to a service that is load balanced. Incoming connections are distributed to back-end nodes based on the configuration of the load balancer.
de: Eine Internet Protocol (IP)-Adresse, die auf dem Load Balancer konfiguriert ist und von Clients verwendet wird, die sich mit einem Dienst verbinden, der lastverteilt ist. Eingehende Verbindungen werden entsprechend der Konfiguration des Load Balancers auf Backend-Knoten verteilt.

source: An L2 network segment within Networking.
de: Ein L2-Netzwerksegment innerhalb von Networking.

source: An Object Storage component that collects meters.
de: Eine Objektspeicherkomponente, die Zähler sammelt.

source: An Object Storage component that copies an object to remote partitions for fault tolerance.
de: Eine Objektspeicherkomponente, die ein Objekt zu fernen Partitionen für Fehlertoleranz kopiert.

source: An Object Storage component that copies changes in the account, container, and object databases to other nodes.
de: Eine Objektspeicherkomponente, die Änderungen in den Konten-, Container- und Objektdatenbanken in andere Knoten kopiert.

source: An Object Storage component that is responsible for managing objects.
de: Eine Objektspeicherkomponente, die für die Verwaltung von Objekten zuständig ist.

source: An Object Storage component that provides account services such as list, create, modify, and audit. Do not confuse with OpenStack Identity service, OpenLDAP, or similar user-account services.
de: Eine Objektspeicherungskomponente, die Kontodienste wie Liste, Erstellen, Ändern und Überprüfen bereitstellt. Verwechseln Sie nicht mit OpenStack Identity Service, OpenLDAP oder ähnlichen Benutzerkonten.

source: An Object Storage large object that has been broken up into pieces. The re-assembled object is called a concatenated object.
de: Ein Objekt Aufbewahrung eines großen Objekts, das in Stücke gebrochen wurde. Das wieder zusammengefügte Objekt wird als verkettetes Objekt bezeichnet.

source: An Object Storage middleware component that enables creation of URLs for temporary object access.
de: Eine Objektspeicher-Middleware-Komponente, die die Erstellung von URLs für den temporären Objektzugriff ermöglicht.

source: An Object Storage node that provides authorization services.
de: Ein Objektspeicherungsknoten, der Berechtigungsdienste bereitstellt.

source: An Object Storage node that provides container services, account services, and object services; controls the account databases, container databases, and object storage.
de: Ein Objekt-Speicherknoten, der Containerdienste, Kontodienste und Objektdienste bereitstellt und die Kontodatenbanken, Containerdatenbanken und Objektspeicher steuert.

source: An Object Storage server that manages containers.
de: Ein Objektspeicherserver, der Container verwaltet.
