Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de

source: Graphic Interchange Format (GIF)
de: Grafik-Austauschformat (GIF)

source: Graphics Processing Unit (GPU)
de: Grafikverarbeitungseinheit (GPU)

source: Group
de: Gruppe

source: Hadoop Distributed File System (HDFS)
de: Hadoop Verteiltes Dateisystem (HDFS)

source: Heat input in the format native to OpenStack.
de: Heat-Eingabe im Format nativ zu OpenStack.

source: Helpful information that prevents the user from making mistakes.
de: Hilfreiche Informationen, die den Benutzer davor bewahren, Fehler zu machen.

source: High-availability mode for legacy (nova) networking. Each compute node handles NAT and DHCP and acts as a gateway for all of the VMs on it. A networking failure on one compute node doesn't affect VMs on other compute nodes.
de: Hochverfügbarkeitsmodus für Legacy (nova) Netzwerke. Jeder Rechenknoten verwaltet NAT und DHCP und fungiert als Gateway für alle darauf befindlichen VMs. Ein Netzwerkausfall auf einem Rechenknoten wirkt sich nicht auf VMs auf anderen Rechenknoten aus.

source: High-performance 64-bit file system created by Silicon Graphics. Excels in parallel I/O operations and data consistency.
de: Leistungsstarkes 64-Bit-Dateisystem von Silicon Graphics. Hervorragend geeignet für parallele I/O-Operationen und Datenkonsistenz.

source: I
de: Ich

source: ID number
de: ID Nummer

source: IOPS are a common performance measurement used to benchmark computer storage devices like hard disk drives, solid state drives, and storage area networks.
de: IOPS sind eine gängige Leistungsmessung, die zum Benchmarking von Computerspeichergeräten wie Festplatten, Solid State Drives und Storage Area Networks verwendet wird.

source: IP Address Management (IPAM)
de: IP-Adressenverwaltung (IPAM)

source: IP address
de: IP-Adresse

source: IPMI is a standardized computer system interface used by system administrators for out-of-band management of computer systems and monitoring of their operation. In layman's terms, it is a way to manage a computer using a direct network connection, whether it is turned on or not; connecting to the hardware rather than an operating system or login shell.
de: IPMI ist eine standardisierte Rechnersystemschnittstelle, die von Systemadministratoren für die Out-of-Band-Verwaltung von Computersystemen und deren Überwachung verwendet wird. In einfachen Worten, ist es ein Weg, um einen Computer mit einer direkten Netzwerkverbindung zu verwalten, ob er eingeschaltet ist oder nicht; Herstellen einer Verbindung zur Hardware anstelle eines Betriebssystems oder Login-Shell.

source: IQN is the format most commonly used for iSCSI names, which uniquely identify nodes in an iSCSI network. All IQNs follow the pattern iqn.yyyy-mm.domain:identifier, where 'yyyy-mm' is the year and month in which the domain was registered, 'domain' is the reversed domain name of the issuing organization, and 'identifier' is an optional string which makes each IQN under the same domain unique. For example, 'iqn.2015-10.org.openstack.408ae959bce1'.
de: IQN ist das Format, das am häufigsten für iSCSI-Namen verwendet wird, die die Knoten in einem iSCSI-Netzwerk eindeutig identifizieren. Alle IQNs folgen dem Muster iqn.yyyy-mm.domain: identifier, wobei 'yyyy-mm' das Jahr und den Monat ist, in dem die Domain registriert wurde, 'domain' ist der umgekehrte Domainname der ausstellenden Organisation und 'identifier' Ist eine optionale Zeichenfolge, die jeden IQN unter derselben Domain eindeutig macht. Zum Beispiel, 'iqn.2015-10.org.openstack.408ae959bce1'.

source: IaaS is a provisioning model in which an organization outsources physical components of a data center, such as storage, hardware, servers, and networking components. A service provider owns the equipment and is responsible for housing, operating and maintaining it. The client typically pays on a per-use basis. IaaS is a model for providing cloud services.
de: IaaS ist ein Provisionierungsmodell, bei dem ein Unternehmen physische Komponenten eines Rechenzentrums auslagert, wie Speicher, Hardware, Server und Netzwerkkomponenten. Ein Dienstleister besitzt die Geräte und ist für die Unterbringung, den Betrieb und die Wartung verantwortlich. Der Kunde zahlt in der Regel pro Nutzung. IaaS ist ein Modell für die Bereitstellung von Cloud-Services.

source: Identity API
de: Identität API

source: Identity back end
de: Identitäts-Backend

source: Identity service (keystone)
de: Identitätsdienst (keystone)

source: Identity service API
de: Identitätsdienst API

source: If Object Storage finds objects, containers, or accounts that are corrupt, they are placed in this state, are not replicated, cannot be read by clients, and a correct copy is re-replicated.
de: Wenn Object Storage Objekte, Container oder Konten findet, die beschädigt sind, werden sie in diesen Zustand versetzt, nicht repliziert, können von Clients nicht gelesen werden und eine korrekte Kopie wird erneut repliziert.

source: If a requested resource such as CPU time, disk storage, or memory is not available in the parent cell, the request is forwarded to its associated child cells. If the child cell can fulfill the request, it does. Otherwise, it attempts to pass the request to any of its children.
de: Wenn eine angeforderte Ressource wie CPU-Zeit, Festplattenspeicher oder Speicher in der übergeordneten Zelle nicht verfügbar ist, wird die Anforderung an die zugehörigen Unterzellen weitergeleitet. Wenn die untergeordnete Zelle die Anforderung erfüllen kann, dann tut sie es. Andernfalls versucht es, die Anfrage an einen seiner Kinder weiterzuleiten.

source: If a requested resource, such as CPU time, disk storage, or memory, is not available in the parent cell, the request is forwarded to associated child cells.
de: Wenn eine angeforderte Ressource, wie CPU-Zeit, Festplattenspeicher oder Speicher, in der übergeordneten Zelle nicht verfügbar ist, wird die Anforderung an die zugehörigen Unterzellen weitergeleitet.

source: Image API
de: Abbild-API

source: Image service (glance)
de: Abbild-Dienst (glance)**

source: Impassable limits for guest VMs. Settings include total RAM size, maximum number of vCPUs, and maximum disk size.
de: Unpassierbare Grenzen für Gast-VMs. Die Einstellungen umfassen die gesamte RAM-Größe, die maximale Anzahl an vCPUs und die maximale Festplattengröße.

source: In Compute and Block Storage, the ability to set resource limits on a per-project basis.
de: Im Bereich Compute and Blockspeicher die Möglichkeit, Ressourcenbegrenzungen projektbezogen festzulegen.

source: In Compute, conductor is the process that proxies database requests from the compute process. Using conductor improves security because compute nodes do not need direct access to the database.
de: In Compute ist der Conductor der Prozess, der für eine Annäherung von Datenbankanfragen vom Compute Prozess sorgt. Die Verwendung des Conductors erhöht die Sicherheit, da Compute Knoten keinen direkten Zugriff auf die Datenbank benötigen.

source: In Object Storage, tools to test and ensure dispersion of objects and containers to ensure fault tolerance.
de: In Object Storage Werkzeuge zum Testen und Dispersion von Objekten und Containern zu gewährleisten, um Fehlertoleranz sicherzustellen.

source: In OpenStack Identity, entities represent individual API consumers and are owned by a specific domain. In OpenStack Compute, a user can be associated with roles, projects, or both.
de: In OpenStack Identity repräsentieren Entitäten einzelne API-Konsumenten und sind Eigentum einer bestimmten Domain. In OpenStack Compute kann ein Benutzer mit Rollen, Projekten oder beidem verknüpft werden.

source: In OpenStack, the API version for a project is part of the URL. For example, ``example.com/nova/v1/foobar``.
de: In OpenStack ist die API-Version für ein Projekt Teil der URL. Beispiel: `example.com/nova/v1/foobar``.

source: In a high-availability setup with an active/active configuration, several systems share the load together and if one fails, the load is distributed to the remaining systems.
de: In einem hochverfügbaren Setup mit einer aktiv/aktiven Konfiguration teilen sich mehrere Systeme die Last gemeinsam, und wenn eines ausfällt, wird die Last auf die übrigen Systeme verteilt.

source: In a high-availability setup with an active/passive configuration, systems are set up to bring additional resources online to replace those that have failed.
de: In einem hochverfügbaren Setup mit einer aktiven/passiven Konfiguration werden Systeme eingerichtet, um zusätzliche Ressourcen online zu stellen, um ausgefallene Ressourcen zu ersetzen.

source: In cryptography, an entity that issues digital certificates. The digital certificate certifies the ownership of a public key by the named subject of the certificate. This enables others (relying parties) to rely upon signatures or assertions made by the private key that corresponds to the certified public key. In this model of trust relationships, a CA is a trusted third party for both the subject (owner) of the certificate and the party relying upon the certificate. CAs are characteristic of many public key infrastructure (PKI) schemes. In OpenStack, a simple certificate authority is provided by Compute for cloudpipe VPNs and VM image decryption.
de: In der Kryptographie eine Einheit, die digitale Zertifikate ausstellt. Das digitale Zertifikat bescheinigt das Eigentum an einem öffentlichen Schlüssel durch den benannten Gegenstand des Zertifikats. Dies ermöglicht es anderen (vertrauende Parteien), sich auf Signaturen oder Behauptungen zu verlassen, die durch den privaten Schlüssel, der dem zertifizierten öffentlichen Schlüssel entspricht, gemacht werden. In diesem Modell der Vertrauensstellungen ist eine CA ein vertrauenswürdiger Dritter sowohl für das Subjekt (Besitzer) des Zertifikats als auch für die Partei, die sich auf das Zertifikat stützt. CAs sind charakteristisch für viele PKI-Systeme (Public Key Infrastructure). In OpenStack wird eine einfache Zertifizierungsstelle von Compute für Cloudpipe-VPNs und VM-Image-Entschlüsselung bereitgestellt.

source: In the context of Object Storage, this is a process that is not terminated after an upgrade, restart, or reload of the service.
de: Im Rahmen der Objektspeicherung ist dies ein Prozess, der nach einem Upgrade, Neustart oder Neuladen des Dienstes nicht beendet wird.

source: In the context of the Identity service, the worker process that provides access to the admin API.
de: Im Rahmen des Identitätsdienstes der Arbeitsprozess, der den Zugriff auf die Admin-API ermöglicht.

source: Information that consists solely of ones and zeroes, which is the language of computers.
de: Informationen, die nur aus Einsen und Nullen bestehen, was die Sprache der Computer ist.

source: Infrastructure Optimization service (watcher)
de: Infrastruktur-Optimierungsdienst (watcher)

source: Infrastructure-as-a-Service (IaaS)
de: Infrastruktur-as-a-Service (IaaS)

source: Input/Output Operations Per Second (IOPS)
de: Ein-/Ausgabevorgänge pro Sekunde (IOPS)

source: Interactions and processes that are obfuscated from the user, such as Compute volume mount, data transmission to an iSCSI target by a daemon, or Object Storage object integrity checks.
de: Interaktionen und Prozesse, die vom Benutzer verschleiert werden, wie z.B. Compute Volume Mount, Datenübertragung zu einem iSCSI-Ziel durch einen Daemon oder Object Storage Object Integrity Checks.

source: Interface within Networking that enables organizations to create custom plug-ins for advanced features, such as QoS, ACLs, or IDS.
de: Schnittstelle innerhalb von Netzwerken, die es Unternehmen ermöglicht, benutzerdefinierte Plug-Ins für erweiterte Funktionen wie QoS, ACLs oder IDS zu erstellen.

source: Internet Engineering Task Force (IETF) is an open standards organization that develops Internet standards, particularly the standards pertaining to TCP/IP.
de: Die Internet Engineering Task Force (IETF) ist eine offene Standardorganisation, die Internetstandards entwickelt, insbesondere die Standards im Zusammenhang mit TCP/IP.

source: Internet protocol (IP)
de: Internetprotokoll (IP)

source: Key Manager service (barbican)
de: Key Manager service (barbican) [Schlüsselmanager-Dienst (barbican)]

source: LBaaS feature that provides availability monitoring using the ``ping`` command, TCP, and HTTP/HTTPS GET.
de: LBaaS-Funktion, die die Verfügbarkeitsüberwachung mit dem ``ping`` Befehl, TCP und HTTP / HTTPS GET zur Verfügung stellt.

source: Layer-2 network
de: Layer-2-Netzwerk

source: Layer-3 network
de: Layer-3-Netzwerk

source: Linux containers (LXC)
de: Linux-Container (LXC)

source: Linux kernel feature that provides independent virtual networking instances on a single host with separate routing tables and interfaces. Similar to virtual routing and forwarding (VRF) services on physical network equipment.
de: Linux-Kernel-Funktion, die unabhängige virtuelle Netzwerkinstanzen auf einem einzelnen Host mit separaten Routingtabellen und Schnittstellen bereitstellt. Ähnlich wie Virtual Routing and Forwarding (VRF) Dienste auf physischen Netzwerkgeräten.

source: Linux kernel security module that provides the mechanism for supporting access control policies.
de: Linux-Kernel-Sicherheitsmodul, das den Mechanismus zur Unterstützung von Zugriffskontrollrichtlinien bereitstellt.

source: Lists allowed commands within the Compute rootwrap facility.
de: Listet zulässige Befehle innerhalb der Compute rootwrap-Funktion auf.

source: Lists containers in Object Storage and stores container information in the account database.
de: Listet Container in Object Storage auf und speichert Container-Informationen in der Account-Datenbank.

source: Load-balancing service (octavia)
de: Lastausgleichsdienst (Octavia)

source: Logical groupings of related code, such as the Block Storage volume manager or network manager.
de: Logische Gruppierungen von verwandtem Code, wie z. B. der Block Storage Volume Manager oder Netzwerk Manager.

source: Logical subdivision of an IP network.
de: Logische Unterteilung eines IP-Netzwerks.

source: Lower power consumption CPU often found in mobile and embedded devices. Supported by OpenStack.
de: CPU mit geringerem Stromverbrauch, die häufig in mobilen und eingebetteten Geräten zu finden ist. Unterstützt von OpenStack.

source: MD5 hash of an object within Object Storage, used to ensure data integrity.
de: MD5-Hash eines Objekts innerhalb des Objektspeichers, das zur Gewährleistung der Datenintegrität verwendet wird.

source: Maps Object Storage partitions to physical storage devices.
de: Maps Object Speicher-Partitionen zu physischen Speichergeräten.

source: Massively scalable distributed storage system that consists of an object store, block store, and POSIX-compatible distributed file system. Compatible with OpenStack.
de: Massiv skalierbares verteiltes Speichersystem, das aus einem Objektspeicher, einem Blockspeicher und einem POSIX-kompatiblen verteilten Dateisystem besteht. Kompatibel mit OpenStack.

source: Maximum frame or packet size for a particular network medium. Typically 1500 bytes for Ethernet networks.
de: Maximale Frame- oder Paketgröße für ein bestimmtes Netzwerkmedium. Typisch 1500 Bytes für Ethernet-Netzwerke.

source: Mechanism for highly available multi-host routing when using OpenStack Networking (neutron).
de: Mechanismus zum hochverfügbaren multi-host Routing bei der Verwendung von OpenStack Netzwerk (neutron).

source: Mechanism in IP networks to detect end-to-end MTU and adjust packet size accordingly.
de: Mechanismus in IP-Netzwerken, um die End-to-End MTU zu erkennen und die Paketgröße entsprechend anzupassen.

source: Message exchange that is cleared when the service restarts. Its data is not written to persistent storage.
de: Nachrichtenaustausch, der gelöscht wird, wenn der Dienst neu gestartet wird. Seine Daten werden nicht in persistente Speicherung geschrieben.

source: Message queue software supported by OpenStack. An alternative to RabbitMQ. Also spelled 0MQ.
de: Von OpenStack unterstützte Nachrichtenwarteschlangensoftware. Eine Alternative zu RabbitMQ. Wird auch 0MQ geschrieben.

source: Message queue software supported by OpenStack; an alternative to RabbitMQ.
de: Von OpenStack unterstützte Message Queue Software; eine Alternative zu RabbitMQ.

source: Message queue that is cleared when the service restarts. Its data is not written to persistent storage.
de: Nachrichtenwarteschlange, die gelöscht wird, wenn der Dienst neu gestartet wird. Seine Daten werden nicht in persistente Speicherung geschrieben.

source: Message service (zaqar)
de: Message service (zaqar) [Nachrichtendienst (zaqar)]

source: Metadata agent
de: Metadatenagent

source: Method of keeping a clock for a host or node correct via communication with a trusted, accurate time source.
de: Verfahren zum Halten einer Uhr für einen Host oder Knoten durch Kommunikation mit einer vertrauenswürdigen, genauen Zeitquelle.

source: Method to access VM instance consoles using a web browser. Supported by Compute.
de: Methode zum Zugriff auf eine VM Instanz-Konsole mittels Webbrowser. Von Compute unterstützt.

source: Modular system that allows the underlying message queue software of Compute to be changed. For example, from RabbitMQ to ZeroMQ or Qpid.
de: Modulares System, das es ermöglicht, die zugrunde liegende Nachrichtenwarteschlangensoftware von Compute zu ändern. Zum Beispiel von RabbitMQ zu ZeroMQ oder Qpid.

source: NetApp volume driver
de: NetApp Volume Treiber

source: Network Address Translation (NAT)
de: Netzwerk-Adressübersetzung (NAT)

source: Network File System (NFS)
de: Netzwerk-Dateisystem (NFS)

source: Network Service Header (NSH)
de: Netzwerk Service Header (NSH)

source: Network Time Protocol (NTP)
de: Netzwerkzeitprotokoll (NTP)

source: Network traffic between a user or client (north) and a server (south), or traffic into the cloud (south) and out of the cloud (north). See also east-west traffic.
de: Netzwerkverkehr zwischen einem Benutzer oder Client (Norden) und einem Server (Süden) oder Verkehr in die Cloud (Süden) und aus der Cloud (Norden). Siehe auch east-west traffic.

source: Network traffic between servers in the same cloud or data center. See also north-south traffic.
de: Netzwerkverkehr zwischen Servern in derselben Cloud oder demselben Rechenzentrum. Siehe auch Nord-Süd-Verkehr.

source: Networking API (Neutron API)
de: Netzwerk-API (Neutronen-API)

source: Networking service (neutron)
de: Netzwerkdienst (Neutron)

source: New users are assigned to this project if no project is specified when a user is created.
de: Neue Benutzer werden diesem Projekt zugeordnet, wenn beim Anlegen eines Benutzers kein Projekt angegeben wird.

source: Notices
de: Benachrichtigungen

source: Notices take these forms:
de: Benachrichtigungen haben diese Formen:

source: Number that is unique to every computer system on the Internet. Two versions of the Internet Protocol (IP) are in use for addresses: IPv4 and IPv6.
de: Nummer, die für jedes Computersystem im Internet einzigartig ist. Für die Adressen: IPv4 und IPv6 werden zwei Versionen des Internet Protocol (IP) verwendet.

source: Object Storage middleware that uploads (posts) an image through a form on a web page.
de: Objektspeicher-Middleware, die ein Abbild über ein Formular auf einer Webseite hochlädt (veröffentlicht).

source: Octavia
de: Oktavia

source: One of the RPC primitives used by the OpenStack message queue software. Sends a message and does not wait for a response.
de: Einer der RPC-Primitive, die von der OpenStack-Nachrichtenwarteschlangensoftware verwendet werden. Sendet eine Nachricht und wartet nicht auf eine Antwort.

source: One of the RPC primitives used by the OpenStack message queue software. Sends a message and waits for a response.
de: Einer der RPC-Primitive, die von der OpenStack-Nachrichtenwarteschlangensoftware verwendet werden. Sendet eine Nachricht und wartet auf eine Antwort.

source: One of the VM image disk formats supported by Image service.
de: Eine der VM-Abbild-Festplattenformate, die vom Abbilddienst unterstützt wird.

source: One of the VM image disk formats supported by Image service; an unstructured disk image.
de: Eines der vom Abbild-Service unterstützten VM-Abbild-Festplattenformate; ein unstrukturiertes Festplattenabbild.

source: One of the default roles in the Compute RBAC system and the default role assigned to a new user.
de: Eine der als Standard vorhandenen Rollen im Compute RBAC System und die Standardrolle für neue Benutzer.

source: One of the default roles in the Compute RBAC system. Enables a user to add other users to a project, interact with VM images that are associated with the project, and start and stop VM instances.
de: Eine der Standardrollen im Compute-RBAC-System. Ermöglicht es einem Benutzer, andere Benutzer einem Projekt hinzuzufügen, mit VM-Abbildern zu interagieren, die mit dem Projekt verknüpft sind, und starten und stoppen VM-Instanzen.

source: One of the default roles in the Compute RBAC system. Enables the user to allocate publicly accessible IP addresses to instances and change firewall rules.
de: Eine der Standardrollen im Compute RBAC-System. Ermöglicht es dem Benutzer, Instanzen öffentlich zugängliche IP-Adressen zuzuweisen und Firewall-Regeln zu ändern.

source: One of the default roles in the Compute RBAC system. Grants complete system access.
de: Eine der Standardrollen im Compute RBAC-System. Gewährt vollständigen Systemzugriff.

source: One of the hypervisors supported by OpenStack.
de: Eine der Hypervisor unterstützt von OpenStack.

source: One of the supported response formats in OpenStack.
de: Eines der unterstützten Antwortformate in OpenStack.

source: Open Cloud Computing Interface (OCCI)
de: Open Cloud Computing Schnittstelle (OCCI)

source: Open Virtualization Format (OVF)
de: Offenes Virtualisierungsformat (OVF)

source: Open source GUI and CLI tools used for remote console access to VMs. Supported by Compute.
de: Open-Source-GUI- und CLI-Tools für den Remote-Konsolenzugriff auf VMs. Unterstützt von Compute.

source: Open source tool used to access remote hosts through an encrypted communications channel, SSH key injection is supported by Compute.
de: Open-Source-Tool für den Zugriff auf entfernte Hosts über einen verschlüsselten Kommunikationskanal, die SSH-Schlüsselinjektion wird von Compute unterstützt.

source: Open vSwitch is a production quality, multilayer virtual switch licensed under the open source Apache 2.0 license. It is designed to enable massive network automation through programmatic extension, while still supporting standard management interfaces and protocols (for example NetFlow, sFlow, SPAN, RSPAN, CLI, LACP, 802.1ag).
de: Open vSwitch ist ein mehrschichtiger virtueller Switch in Produktionsqualität, der unter der Open-Source-Lizenz Apache 2.0 lizenziert ist. Es wurde entwickelt, um eine massive Netzwerkautomatisierung durch programmatische Erweiterung zu ermöglichen, während es gleichzeitig Standard-Management-Schnittstellen und -Protokolle unterstützt (z.B. NetFlow, sFlow, SPAN, RSPAN, CLI, LACP, 802.1ag).

source: OpenStack Networking agent that provides DHCP services for virtual networks.
de: OpenStack Netzwerk Agent, der DHCP Dienste für virtuelle Netzwerke zur Verfügung stellt.

source: OpenStack Networking agent that provides layer-2 connectivity for virtual networks.
de: OpenStack Networking Agent, der Layer-2-Konnektivität für virtuelle Netzwerke bietet.

source: OpenStack Networking agent that provides layer-3 (routing) services for virtual networks.
de: OpenStack Networking Agent, der Layer-3-Dienste (Routing) für virtuelle Netzwerke bereitstellt.

source: OpenStack Networking agent that provides metadata services for instances.
de: OpenStack Networking Agent, der Metadatendienste für Instanzen bereitstellt.
