Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc-common.po
Languages: de

source: A grouped release of projects related to OpenStack that came out in the fall of 2011, the fourth release of OpenStack. It included Compute (nova 2011.3), Object Storage (swift 1.4.3), and the Image service (glance). Diablo is the code name for the fourth release of OpenStack. The design summit took place in the Bay Area near Santa Clara, California, US and Diablo is a nearby city.
de: Eine gruppierte Freigabe von Projekten im Zusammenhang mit OpenStack, die im Herbst 2011 herauskamen, die vierte Version von OpenStack. Es enthielt Compute (nova 2011.3), Object Storage (swift 1.4.3) und den Abbilddienst (glance). Diablo ist der Codename für die vierte Version von OpenStack. Der Design Summit fand in der Bay Area in der Nähe von Santa Clara, Kalifornien, USA und Diablo ist eine nahe gelegene Stadt.

source: A grouped release of projects related to OpenStack that came out in the fall of 2012, the sixth release of OpenStack. It includes Compute (nova), Object Storage (swift), Identity (keystone), Networking (neutron), Image service (glance), and Volumes or Block Storage (cinder). Folsom is the code name for the sixth release of OpenStack. The design summit took place in San Francisco, California, US and Folsom is a nearby city.
de: Eine gruppierte Version von Projekten im Zusammenhang mit OpenStack, die im Herbst 2012 veröffentlicht wurde, die sechste Version von OpenStack. Es umfasst Compute (nova), Object Storage (swift), Identity (keystone), Networking (neutron), Image Service (glance) und Volumes or Block Storage (cinder). Folsom ist der Codename für die sechste Version von OpenStack. Der Design-Gipfel fand in San Francisco, Kalifornien, USA statt und Folsom ist eine nahegelegene Stadt.

source: A high availability system design approach and associated service implementation ensures that a prearranged level of operational performance will be met during a contractual measurement period. High availability systems seek to minimize system downtime and data loss.
de: Ein hochverfügbarer Systemdesignansatz und die damit verbundene Serviceimplementierung sorgen dafür, dass während einer vertraglichen Messperiode ein vorgegebenes operatives Leistungsniveau erreicht wird. Hochverfügbarkeits-Systeme versuchen, Systemausfallzeiten und Datenverluste zu minimieren.

source: A horizon component that stores and tracks client session information. Implemented through the Django sessions framework.
de: Eine Horizontkomponente, die Client-Sitzungsinformationen speichert und verfolgt. Implementiert durch das Django-Sessions-Framework.

source: A hybrid cloud is a composition of two or more clouds (private, community or public) that remain distinct entities but are bound together, offering the benefits of multiple deployment models. Hybrid cloud can also mean the ability to connect colocation, managed and/or dedicated services with cloud resources.
de: Eine Hybrid-Cloud ist eine Komposition von zwei oder mehreren Cloud (privat, gemeinschaftlich oder öffentlich), die unterschiedliche Einheiten bleiben, aber zusammengebunden sind und die Vorteile von mehreren Einsatzmodellen bieten. Hybrid-Cloud kann auch die Möglichkeit sein, Colocation, verwaltete und/oder dedizierte Dienste mit Cloud-Ressourcen zu verbinden.

source: A kind of web service API that uses REST, or Representational State Transfer. REST is the style of architecture for hypermedia systems that is used for the World Wide Web.
de: Eine Art von Web-Service-API, die REST oder Representational State Transfer verwendet. REST ist der Stil der Architektur für Hypermedia-Systeme, die für das World Wide Web verwendet wird.

source: A lightweight SQL database, used as the default persistent storage method in many OpenStack services.
de: Eine leichte SQL-Datenbank, die in vielen OpenStack-Diensten als Standard-Speichermethode für persistente Daten verwendet wird.

source: A list of API endpoints that are available to a user after authentication with the Identity service.
de: Eine Liste von API-Endpunkten, die einem Benutzer nach der Authentifizierung mit dem Identitätsdienst zur Verfügung stehen.

source: A list of URL and port number endpoints that indicate where a service, such as Object Storage, Compute, Identity, and so on, can be accessed.
de: Eine Liste von URL- und Portnummern-Endpunkten, die angeben, wo auf einen Dienst, wie zum Beispiel Object Storage, Compute, Identity usw., zugegriffen werden kann.

source: A list of VM images that are available through Image service.
de: Eine Liste von VM-Abbildern, die über den Abbild-Dienst verfügbar sind.

source: A list of permissions attached to an object. An ACL specifies which users or system processes have access to objects. It also defines which operations can be performed on specified objects. Each entry in a typical ACL specifies a subject and an operation. For instance, the ACL entry ``(Alice, delete)`` for a file gives Alice permission to delete the file.
de: Eine Liste der an ein Objekt angehängten Berechtigungen. Eine ACL gibt an, welche Benutzer oder Systemprozesse auf Objekte zugreifen können. Es definiert auch, welche Operationen an bestimmten Objekten durchgeführt werden können. Jeder Eintrag in einer typischen ACL gibt einen Betreff und einen Vorgang an. Zum Beispiel gibt der ACL-Eintrag ``(Alice, delete) `` für eine Datei Alice die Berechtigung zum Löschen der Datei.

source: A list of projects that can access a given VM image within Image service.
de: Eine Liste von Projekten, die auf ein bestimmtes VM-Abbild innerhalb des Abbild-Dienstes zugreifen können.

source: A load balancer is a logical device that belongs to a cloud account. It is used to distribute workloads between multiple back-end systems or services, based on the criteria defined as part of its configuration.
de: Ein Load Balancer ist eine logische Vorrichtung, die zu einem Cloud Account gehört. Es wird verwendet, um Workloads auf mehrere Backend-Systeme oder Dienste zu verteilen, basierend auf den Kriterien, die im Rahmen der Konfiguration definiert wurden.

source: A logical set of devices, such as web servers, that you group together to receive and process traffic. The load balancing function chooses which member of the pool handles the new requests or connections received on the VIP address. Each VIP has one pool.
de: Ein logischer Satz von Geräten wie Web-Servern, die Sie zusammengruppieren, um Traffic zu empfangen und zu verarbeiten. Die Loadbalancingfunktion wählt, welches Mitglied des Pools die neuen Anfragen oder Verbindungen, die auf der VIP-Adresse empfangen werden, verarbeitet. Jeder VIP hat einen Pool.

source: A mechanism that allows IPv6 packets to be transmitted over an IPv4 network, providing a strategy for migrating to IPv6.
de: Ein Mechanismus, der es ermöglicht, IPv6-Pakete über ein IPv4-Netzwerk zu übertragen und so eine Strategie für die Migration zu IPv6 bereitzustellen.

source: A mechanism that allows many resources (for example, fonts, JavaScript) on a web page to be requested from another domain outside the domain from which the resource originated. In particular, JavaScript's AJAX calls can use the XMLHttpRequest mechanism.
de: Ein Mechanismus, der viele Ressourcen (z. B. Schriftarten, JavaScript) auf einer Webseite erlaubt, die von einer anderen Domäne außerhalb der Domäne angefordert werden soll, von der die Ressource entstanden ist. Insbesondere JavaScripts AJAX-Aufrufe können den XMLHttpRequest-Mechanismus verwenden.

source: A message that is stored both in memory and on disk. The message is not lost after a failure or restart.
de: Eine Nachricht, die sowohl im Speicher als auch auf der Festplatte gespeichert ist. Die Nachricht geht nach einem Ausfall oder Restart nicht verloren.

source: A message that is stored in memory and is lost after the server is restarted.
de: Eine Nachricht, die im Speicher gespeichert ist und nach dem Neustart des Servers verloren geht.

source: A method for making file systems available over the network. Supported by OpenStack.
de: Ein Verfahren zum Bereitstellen von Dateisystemen über das Netzwerk. Unterstützt von OpenStack.

source: A method of VM live migration used by KVM to evacuate instances from one host to another with very little downtime during a user-initiated switchover. Does not require shared storage. Supported by Compute.
de: Ein Verfahren zur VM-Live-Migration, das vom KVM verwendet wird, um Instanzen von einem Host zum anderen mit sehr geringer Ausfallzeit während einer vom Benutzer initiierten Umstellung zu evakuieren. Erfordert keinen gemeinsamen Speicher. Unterstützt von Compute.

source: A method of operating system installation where a finalized disk image is created and then used by all nodes without modification.
de: Ein Verfahren zur Betriebssysteminstallation, bei dem ein finalisiertes Disk-Image erstellt und dann von allen Knoten ohne Änderung verwendet wird.

source: A method to establish trusts between identity providers and the OpenStack cloud.
de: Eine Methode, um Trusts zwischen Identitätsanbietern und der OpenStack Cloud zu etablieren.

source: A method to further subdivide availability zones into hypervisor pools, a collection of common hosts.
de: Eine Methode zur weiteren Unterteilung von Verfügbarkeitszonen in Hypervisor-Pools, eine Sammlung von gemeinsamen Hosts.

source: A minimal Linux distribution designed for use as a test image on clouds such as OpenStack.
de: Eine minimale Linux-Distribution, die als Testabbild auf Clouds wie OpenStack verwendet werden kann.

source: A model that enables access to a shared pool of configurable computing resources, such as networks, servers, storage, applications, and services, that can be rapidly provisioned and released with minimal management effort or service provider interaction.
de: Ein Modell, das den Zugriff auf einen gemeinsamen Pool von konfigurierbaren Computerressourcen wie Netzwerke, Server, Speicher, Anwendungen und Dienste ermöglicht, die mit minimalem Verwaltungsaufwand oder Interaktion mit Dienstanbietern schnell bereitgestellt und freigegeben werden können.

source: A network authentication protocol which works on the basis of tickets. Kerberos allows nodes communication over a non-secure network, and allows nodes to prove their identity to one another in a secure manner.
de: Ein Netzwerk-Authentifizierungsprotokoll, das auf der Basis von Tickets arbeitet. Kerberos ermöglicht die Kommunikation von Knoten über ein nicht sicheres Netzwerk und ermöglicht es den Knoten, ihre Identität auf sichere Weise zu beweisen.

source: A network protocol that configures devices that are connected to a network so that they can communicate on that network by using the Internet Protocol (IP). The protocol is implemented in a client-server model where DHCP clients request configuration data, such as an IP address, a default route, and one or more DNS server addresses from a DHCP server. A method to automatically configure networking for a host at boot time. Provided by both Networking and Compute.
de: Ein Netzwerkprotokoll, das Geräte, die mit einem Netzwerk verbunden sind, so konfiguriert, dass diese unter Benutzung des Interneprotokolls (IP) kommunizieren können. Das Protokoll ist implementiert in einem Client-Server-Modell, wo DHCP-Clients vom DHCP-Server Konfigurationsdaten anfragen, wie IP-Adresse, Default-Route, und eine oder mehrere DNS-Server-Adressen. Eine Methode zur automatischen Konfiguration des Netzwerkes für einen Host beim booten. Wird von Netzwerk und Compute bereitgestellt.

source: A network protocol used by a network client to obtain an IP address from a configuration server. Provided in Compute through the dnsmasq daemon when using either the FlatDHCP manager or VLAN manager network manager.
de: Ein Netzwerkprotokoll, das von einem Netzwerk-Client verwendet wird, um eine IP-Adresse von einem Konfigurationsserver zu erhalten. Wird in Compute durch den dnsmasq-Daemon bereitgestellt, wenn Sie entweder den FlatDHCP-Manager oder den VLAN-Manager-Netzwerk-Manager verwenden.

source: A network protocol used by network devices for control messages. For example, :command:`ping` uses ICMP to test connectivity.
de: Ein Netzwerkprotokoll, das von Netzwerkgeräten für Steuerungsnachrichten verwendet wird. Zum Beispiel: :command: `ping` verwendet ICMP, um Konnektivität zu testen.

source: A network segment typically used for instance Internet access.
de: Ein üblicherweise von den Instanzen für den Zugriff auf das Internet benutztes Netzwerksegment.

source: A network segment used for administration, not accessible to the public Internet.
de: Ein Netzwerksegment, das für die Verwaltung verwendet wird und nicht für das öffentliche Internet zugänglich ist.

source: A network segment used for instance traffic tunnels between compute nodes and the network node.
de: Ein Netzwerksegment, das beispielsweise Verkehrstunnel zwischen Rechenknoten und dem Netzwerkknoten verwendet.

source: A network virtualization technology that attempts to reduce the scalability problems associated with large cloud computing deployments. It uses a VLAN-like encapsulation technique to encapsulate Ethernet frames within UDP packets.
de: Eine Netzwerk-Virtualisierungstechnologie, die versucht, die Skalierbarkeitsprobleme zu reduzieren, die mit großen Cloud Computing-Bereitstellungen verbunden sind. Es verwendet eine VLAN-ähnliche Verkapselungstechnik, um Ethernet-Frames in UDP-Pakete zu verkapseln.

source: A node that provides the Object Storage proxy service.
de: Ein Knoten, der den Objektspeicher-Proxy-Dienst bereitstellt.

source: A node that runs Object Storage account, container, and object services.
de: Ein Knoten, der Object Storage Account-, Container- und Objektdienste ausführt.

source: A node that runs network, volume, API, scheduler, and image services. Each service may be broken out into separate nodes for scalability or availability.
de: Ein Knoten, der Netzwerk-, Volume, API-, Scheduler- und Abbild-Dienste ausführt. Jeder Dienst kann aus Gründen der Skalierbarkeit oder Verfügbarkeit in separate Knoten unterteilt werden.

source: A node that runs the nova-compute daemon that manages VM instances that provide a wide range of services, such as web applications and analytics.
de: Ein Knoten, auf dem der nova-compute Dämon zur Verwaltung von VM Instanzen läuft und der eine Vielzahl an Diensten bereit stellt, wie Web Applikationen und Analysen.

source: A notification driver that monitors VM instances and updates the capacity cache as needed.
de: Ein Benachrichtigungstreiber, der VM-Instanzen überwacht und den Kapazitätscache bei Bedarf aktualisiert.

source: A number within a database that is incremented each time a change is made. Used by Object Storage when replicating.
de: Eine Nummer innerhalb einer Datenbank, die bei jedem Wechsel inkrementiert wird. Wird bei der Replikation von Objektspeicher verwendet.

source: A package commonly installed in VM images that performs initialization of an instance after boot using information that it retrieves from the metadata service, such as the SSH public key and user data.
de: Ein in VM-Abbildern häufig installiertes Paket, das die Initialisierung einer Instanz nach dem Booten anhand von Informationen durchführt, die es aus dem Metadatendienst abruft, wie z.B. den öffentlichen Schlüssel SSH und Benutzerdaten.

source: A persistent storage method supported by XenAPI, such as iSCSI or NFS.
de: Eine von XenAPI unterstützte persistente Speichermethode, wie iSCSI oder NFS.

source: A person who plans, designs, and oversees the creation of clouds.
de: Eine Person, die die Erstellung von Clouds plant, gestaltet und überwacht.

source: A personality that a user assumes to perform a specific set of operations. A role includes a set of rights and privileges. A user assuming that role inherits those rights and privileges.
de: Eine Persönlichkeit, die ein Benutzer voraussetzt, einen bestimmten Satz von Operationen durchzuführen. Eine Rolle umfasst eine Reihe von Rechten und Privilegien. Ein Benutzer nimmt an, dass diese Rolle diese Rechte und Berechtigungen erbt.

source: A physical computer, not a VM instance (node).
de: Ein physikalischer Computer, keine VM-Instanze (Knoten).

source: A physical or virtual device that provides connectivity to another device or medium.
de: Ein physisches oder virtuelles Gerät, das Konnektivität zu einem anderen Gerät oder Medium bietet.

source: A physical or virtual network device that passes network traffic between different networks.
de: Eine physische oder virtuelle Netzwerkkomponente, die den Netzwerkverkehr zwischen verschiedenen Netzwerken weiterleitet.

source: A piece of software that makes available another piece of software over a network.
de: Ein Stück Software, die ein weiteres Stück Software über ein Netzwerk zur Verfügung stellt.

source: A platform that provides a suite of desktop environments that users access to receive a desktop experience from any location. This may provide general use, development, or even homogeneous testing environments.
de: Eine Plattform, die eine Reihe von Desktop-Umgebungen bereitstellt, auf die Benutzer von jedem Ort aus zugreifen können, um ein Desktop-Erlebnis zu erhalten. Dies kann allgemeine Nutzung, Entwicklung oder sogar homogene Testumgebungen ermöglichen.

source: A plug-in for the OpenStack Dashboard (horizon).
de: Ein Plugin für das OpenStack Dashboard (horizon).

source: A point-in-time copy of an OpenStack storage volume or image. Use storage volume snapshots to back up volumes. Use image snapshots to back up data, or as "gold" images for additional servers.
de: Eine Punkt-in-Zeit-Kopie eines OpenStack-Speichervolumens oder Abbildes. Verwenden Sie Speicherdatenträgerschattenkopien, um Datenträger zu sichern. Verwenden Sie Abbild-Schattenkopie zum Sichern von Daten oder als "Gold"-Abbilder für zusätzliche Server.

source: A pre-made VM image that serves as a cloudpipe server. Essentially, OpenVPN running on Linux.
de: Ein vorgefertigtes VM-Abbild, das als Cloudpipe-Server dient. Im Wesentlichen ist OpenVPN unter Linux lauffähig.

source: A process that is created when a RPC call is executed; used to push the message to the topic exchange.
de: Ein Prozess, der erstellt wird, wenn ein RPC-Aufruf ausgeführt wird; Verwendet, um die Nachricht an den Topic Exchange zu schieben.

source: A process that runs in the background and waits for requests. May or may not listen on a TCP or UDP port. Do not confuse with a worker.
de: Ein Prozess, der im Hintergrund läuft und auf Anfragen wartet. Kann an einem TCP- oder UDP-Port lauschen oder auch nicht. Verwechseln Sie nicht mit einem Arbeiter.

source: A program that keeps the Image service VM image cache at or below its configured maximum size.
de: Ein Programm, das die Abbilder im VM-Abbild-Zwischenspeicher an oder unter der konfigurierten maximalen Größe hält.

source: A programming language that is used to create systems that involve more than one computer by way of a network.
de: Eine Programmiersprache, die verwendet wird, um Systeme zu schaffen, die mehr als einen Computer über ein Netzwerk beinhalten.

source: A project that is not officially endorsed by the OpenStack Foundation. If the project is successful enough, it might be elevated to an incubated project and then to a core project, or it might be merged with the main code trunk.
de: Ein Projekt, das nicht offiziell von der OpenStack Foundation unterstützt wird. Wenn das Projekt erfolgreich genug ist, kann es zu einem inkubierten Projekt und dann zu einem Kernprojekt erhoben werden, oder es kann mit dem Hauptcode-Trunk zusammengeführt werden.

source: A project that ports the shell script-based project named DevStack to Python.
de: Ein Projekt, das das Shellskript-basierte Projekt DevStack nach Python portiert.

source: A recommended architecture for an OpenStack cloud.
de: Eine empfohlene Architektur für eine OpenStack CLoud.

source: A record that specifies information about a particular domain and belongs to the domain.
de: Ein Datensatz der Informationen zu einer bestimmten Domäne sowie Zugehörigkeiten zu der Domäne beinhaltet.

source: A remote, mountable file system in the context of the :term:`Shared File Systems service<Shared File Systems service (manila)>`. You can mount a share to, and access a share from, several hosts by several users at a time.
de: Ein entferntes, einhängfähiges Dateisystem im Kontext von :term: `Shared File Systems Service <Shared File Systems service (manila)>`. Sie können eine Freigabe an eine beliebige Share von mehreren Hosts von mehreren Benutzern aufrufen.

source: A routing algorithm in the Compute RabbitMQ.
de: Ein Routing-Algorithmus im Compute RabbitMQ.

source: A routing table that is created within the Compute RabbitMQ during RPC calls; one is created for each RPC call that is invoked.
de: Eine Routingtabelle, die in Compute RabbitMQ während RPC Aufrufen erstellt wird, eine für jeden RPC Aufruf.

source: A running VM, or a VM in a known state such as suspended, that can be used like a hardware server.
de: Eine laufende VM oder eine VM in einem bekannten Zustand, z.B. ausgesetzt, die wie ein Hardware-Server verwendet werden kann.

source: A scheduling method used by Compute that randomly chooses an available host from the pool.
de: Eine Planungsmethode benutzt von Compute, die nach dem Zufallsprinzip einen verfügbaren Computer vom Bestand auswählt.

source: A scripting language that is used to build web pages.
de: Eine Skriptsprache zur Erstellung von Webseiten.

source: A security model that focuses on data confidentiality and controlled access to classified information. This model divides the entities into subjects and objects. The clearance of a subject is compared to the classification of the object to determine if the subject is authorized for the specific access mode. The clearance or classification scheme is expressed in terms of a lattice.
de: Ein Sicherheitsmodell, das sich auf die Vertraulichkeit von Daten und den kontrollierten Zugriff auf vertrauliche Informationen konzentriert. Dieses Modell unterteilt die Entitäten in Subjekte und Objekte. Die Freigabe eines Subjekts wird mit der Klassifizierung des Objekts verglichen, um festzustellen, ob das Subjekt für die jeweilige Zugriffsart berechtigt ist. Das Freigabe- oder Klassifizierungsschema wird in Form eines Gitters ausgedrückt.

source: A set of OpenStack resources created and managed by the Orchestration service according to a given template (either an AWS CloudFormation template or a Heat Orchestration Template (HOT)).
de: Eine Reihe von OpenStack-Ressourcen, die vom Orchestrierungsdienst nach einer bestimmten Vorlage erstellt und verwaltet werden (entweder eine AWS CloudFormation-Vorlage oder eine Heat Orchestration Template (HOT)).

source: A set of network traffic filtering rules that are applied to a Compute instance.
de: Ein Satz von Netzwerkverkehrsfilterregeln, die auf eine Compute-Instanz angewendet werden.

source: A set of segment objects that Object Storage combines and sends to the client.
de: Ein Satz Segmentobjekte, die Objekt Storage kombiniert und zum Client sendet.

source: A special Object Storage object that contains the manifest for a large object.
de: Ein spezielles Objektspeicherobjekt, das das Manifest für ein großes Objekt enthält.

source: A special type of VM image that is booted when an instance is placed into rescue mode. Allows an administrator to mount the file systems for an instance to correct the problem.
de: Eine spezielle Art von VM-Abbild, das gestartet wird, wenn eine Instanz in den Rettungsmodus versetzt wird. Ermöglicht einem Administrator, die Dateisysteme für eine Instanz zu installieren, um das Problem zu beheben.
