Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: This script dumps the entire MySQL database and deletes any backups older than seven days.
de: Dieses Skript sichert die gesamte MySQL-Datenbank und löscht alle Backups, die älter als sieben Tage sind.
id: Skrip ini membuang seluruh database MySQL dan menghapus cadangan yang lebih lama dari tujuh hari.

source: This script is specific to a certain OpenStack installation and must be modified to fit your environment. However, the logic should easily be transferable.
de: Dieses Skript ist spezifisch für eine bestimmte OpenStack-Installation und muss an Ihre Umgebung angepasst werden. Die Logik sollte jedoch leicht übertragbar sein.
id: Skrip ini khusus untuk instalasi OpenStack tertentu dan harus dimodifikasi agar sesuai dengan lingkungan Anda. Namun, logikanya harus mudah dipindahtangankan.

source: This section covers specific examples of configuration options you might consider tuning. It is by no means an exhaustive list.
de: In diesem Abschnitt werden konkrete Beispiele für Konfigurationsoptionen vorgestellt, die Sie in Betracht ziehen könnten. Es handelt sich bei weitem nicht um eine vollständige Liste.
id: Bagian ini mencakup contoh spesifik opsi konfigurasi yang dapat Anda pertimbangkan untuk penyetelan. Ini tidak berarti daftar lengkap.

source: This section describes the process to upgrade a basic OpenStack deployment based on the basic two-node architecture in the `Installation Tutorials and Guides <https://docs.openstack.org/rocky/install/>`_. All nodes must run a supported distribution of Linux with a recent kernel and the current release packages.
de: Dieser Abschnitt beschreibt den Prozess zum Aktualisieren einer grundlegenden OpenStack-Bereitstellung auf der Grundlage der grundlegenden Zweiknotenarchitektur in den `Installations-Tutorials und -Anleitungen <https://docs.openstack.org/rocky/install/>`_. Alle Knoten müssen eine unterstützte Distribution von Linux mit einem aktuellen Kernel und den aktuellen Release-Paketen ausführen.
id: Bagian ini menjelaskan proses untuk upgrade penyebaran OpenStack dasar berdasarkan arsitektur two-node dasar di `Installation Tutorials and Guides <https://docs.openstack.org/rocky/install/>` _. Semua node harus menjalankan distribusi Linux yang didukung dengan kernel terbaru dan paket rilis saat ini.

source: This section discusses which files and directories should be backed up regularly, organized by service.
de: In diesem Abschnitt wird besprochen, welche Dateien und Verzeichnisse regelmäßig gesichert werden sollten, organisiert nach Diensten.
id: Bagian ini membahas file dan direktori mana yang harus didukung secara teratur, yang diatur oleh layanan.

source: This section lists several of the most important Use Cases that demonstrate the main functions and abilities of Shared File Systems service:
de: In diesem Abschnitt sind einige der wichtigsten Anwendungsfälle aufgeführt, die die wichtigsten Funktionen und Fähigkeiten des Dienstes Shared File Systems demonstrieren:

source: This section provides guidance for rolling back to a previous release of OpenStack. All distributions follow a similar procedure.
de: Dieser Abschnitt enthält Anleitungen für das Zurücksetzen auf eine frühere Version von OpenStack. Alle Distributionen folgen einem ähnlichen Verfahren.
id: Bagian ini memberikan panduan untuk memutar kembali (rolling back) ke rilis OpenStack sebelumnya. Semua distribusi mengikuti prosedur serupa.

source: This section provides tips on resolving common RabbitMQ issues.
de: Dieser Abschnitt enthält Tipps zur Lösung häufiger Probleme mit RabbitMQ.
id: Bagian ini memberikan tips untuk menyelesaikan masalah-masalah umum RabbitMQ.

source: This section was intended as a brief introduction to some of the most useful of many OpenStack commands. For an exhaustive list, please refer to the `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`__. We hope your users remain happy and recognize your hard work! (For more hard work, turn the page to the next chapter, where we discuss the system-facing operations: maintenance, failures and debugging.)
de: Dieser Abschnitt sollte eine kurze Einführung in einige der nützlichsten der vielen OpenStack-Befehle sein. Eine vollständige Liste finden Sie im `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`__. Wir hoffen, dass Ihre Nutzer zufrieden bleiben und Ihre harte Arbeit! anerkennen (Für mehr harte Arbeit blättern Sie die Seite zum nächsten Kapitel, wo wir die systembezogenen Operationen besprechen: Wartung, Ausfälle und Debugging.)

source: This step applies if you have already restarted only the OpenStack components, and cannot connect to the RabbitMQ service.
de: Dieser Schritt gilt, wenn Sie bereits nur die OpenStack-Komponenten neu gestartet haben und keine Verbindung zum RabbitMQ-Dienst herstellen können.
id: Langkah ini berlaku jika Anda telah memulai kembali hanya komponen OpenStack, dan tidak dapat terhubung ke layanan RabbitMQ.

source: This step completes the rollback procedure. You should remove the upgrade release repository and run :command:`apt-get update` to prevent accidental upgrades until you solve whatever issue caused you to roll back your environment.
de: Dieser Schritt schließt den Rollback-Vorgang ab. Sie sollten das Upgrade-Release-Repository entfernen und :command:`apt-get update` ausführen, um versehentliche Upgrades zu verhindern, bis Sie das Problem lösen, das Sie veranlasst hat, Ihre Umgebung zurückzusetzen.
id: Langkah ini melengkapi prosedur rollback. Anda harus menghapus repositori rilis upgrade dan menjalankan :command:`apt-get update`untuk mencegah upgrade yang tidak disengaja sampai Anda memecahkan masalah apa pun yang menyebabkan Anda roll back lingkungan Anda.

source: This user data can be put in a file on your local system and then passed in at instance creation with the flag ``--user-data <user-data-file>``.
de: Diese Benutzerdaten können in eine Datei auf Ihrem lokalen System abgelegt und dann bei der Instanzerstellung mit dem Flag ``--user-data <user-data-file>`` übergeben werden.

source: This user was the only user on the node (new node)
de: Dieser Benutzer war der einzige Benutzer auf dem Knoten (neuer Knoten).
id: Pengguna ini adalah satu-satunya pengguna pada node (node baru)

source: Thoroughly review the `release notes <https://releases.openstack.org/>`_ to learn about new, updated, and deprecated features. Find incompatibilities between versions.
de: Lesen Sie die `Release Notes <https://releases.openstack.org/>`_, um mehr über neue, aktualisierte und veraltete Funktionen zu erfahren. Finden Sie Inkompatibilitäten zwischen Versionen.
id: Tinjau sepenuhnya `release notes <https://releases.openstack.org/>` _ untuk mempelajari tentang fitur-fitur baru, yang diperbarui, dan usang. Temukan ketidaksesuaian antar versi.

source: Though many successfully use the various python-\*client code as an effective SDK for interacting with OpenStack, consistency between the projects and documentation availability waxes and wanes. To combat this, an `effort to improve the experience <https://wiki.openstack.org/wiki/PythonOpenStackSDK>`_ has started. Cross-project development efforts in OpenStack have a checkered history, such as the `unified client project <https://wiki.openstack.org/wiki/OpenStackClient>`_ having several false starts. However, the early signs for the SDK project are promising, and we expect to see results during the Juno cycle.
de: Obwohl viele erfolgreich die verschiedenen Python-\*Client-Codes als effektives SDK für die Interaktion mit OpenStack verwenden, nimmt die Konsistenz zwischen den Projekten und der Verfügbarkeit der Dokumentation zu. Um dies zu bekämpfen, hat ein `Bemühung, die Erfahrung <https://wiki.openstack.org/wiki/PythonOpenStackSDK>`_ zu verbessern, begonnen. Projektübergreifende Entwicklungsbemühungen in OpenStack haben eine wechselnde Historie, wie z.B. das `Unified Client Project <https://wiki.openstack.org/wiki/OpenStackClient>`_ mit mehreren Fehlstarts. Die ersten Anzeichen für das SDK-Projekt sind jedoch vielversprechend, und wir erwarten Ergebnisse während des Juno-Zyklus.
id: Meskipun banyak yang berhasil menggunakan berbagai kode python-\*client sebagai SDK yang efektif untuk berinteraksi dengan OpenStack, konsistensi antara proyek dan ketersediaan dokumentasi semakin berkurang. Untuk mengatasi ini, sebuah `effort to improve the experience <https://wiki.openstack.org/wiki/PythonOpenStackSDK>`_ telah dimulai. Upaya pengembangan lintas proyek di OpenStack memiliki sejarah kotak-kotak (checkered history), seperti `unified client project <https://wiki.openstack.org/wiki/OpenStackClient>`_ memiliki beberapa kesalahan awal. Namun, tanda-tanda awal untuk proyek SDK cukup menjanjikan, dan kami berharap dapat melihat hasilnya selama siklus Juno.

source: Through ``nova-network`` or ``neutron``, OpenStack Compute automatically manages iptables, including forwarding packets to and from instances on a compute node, forwarding floating IP traffic, and managing security group rules. In addition to managing the rules, comments (if supported) will be inserted in the rules to help indicate the purpose of the rule.
de: Über ``nova-network`` oder ``neutron`` verwaltet OpenStack Compute automatisch iptables, einschließlich der Weiterleitung von Paketen zu und von Instanzen auf einem Compute-Knoten, der Weiterleitung von Floating IP-Traffic und der Verwaltung von Sicherheitsgruppenregeln. Zusätzlich zur Verwaltung der Regeln werden Kommentare (falls unterstützt) in die Regeln eingefügt, um den Zweck der Regel anzugeben.
id: Melalui ``nova-network`` atau ``neutron``, OpenStack Compute secara otomatis mengelola iptables, termasuk meneruskan paket ke dan dari instance pada node komputasi, meneruskan lalu lintas IP mengambang, dan mengatur aturan grup keamanan. Selain mengelola aturan, komentar (jika didukung) akan dimasukkan dalam aturan untuk membantu menunjukkan tujuan aturan.

source: Tim Bell from CERN gave us feedback on the outline before we started and reviewed it mid-week.
de: Tim Bell vom CERN gab uns vor Beginn des Projekts Feedback zu dem Entwurf und überprüfte ihn Mitte der Woche.
id: Tim Bell dari CERN memberi kami umpan balik tentang garis besar sebelum kami memulai dan meninjaunya pertengahan minggu.

source: To accept the sharing, you need to update the member status:
de: Um die Freigabe zu akzeptieren, müssen Sie den Mitgliederstatus aktualisieren:
id: Untuk menerima berbagi, Anda perlu memperbarui status anggota:

source: To access the instance's disk (``/var/lib/nova/instances/instance-xxxxxx/disk``), use the following steps:
de: Um auf das Laufwerk der Instanz zuzugreifen (``/var/lib/nova/instances/instance-xxxxxxxxxx/disk``), führen Sie die folgenden Schritte aus:
id: Untuk mengakses disk instance (``/var/lib/nova/instances/instance-xxxxxx/disk``), gunakan langkah-langkah berikut:

source: To add a DEBUG logging statement, you would do:
de: Um eine DEBUG-Protokollanweisung hinzuzufügen, würden Sie dies tun:
id: Untuk menambahkan pernyataan logging DEBUG, Anda harus melakukan:

source: To add a project through the command line, you must use the OpenStack command line client.
de: Um ein Projekt über die Befehlszeile hinzuzufügen, müssen Sie den OpenStack-Kommandozeilen-Client verwenden.
id: Untuk menambahkan proyek melalui command line, Anda harus menggunakan klien command line OpenStack.

source: To add logging statements, the following line should be near the top of the file. For most files, these should already be there:
de: Um Protokollierungsanweisungen hinzuzufügen, sollte die folgende Zeile am Anfang der Datei stehen. Für die meisten Dateien sollten diese bereits vorhanden sein:
id: Untuk menambahkan pernyataan logging, baris berikut harus di dekat bagian atas file. Untuk sebagian besar file, ini seharusnya sudah ada:

source: To add new volumes, you need only a volume size in gigabytes. Either put these into the :guilabel:`Create Volume` web form or use the command line:
de: Um neue Datenträger hinzuzufügen, benötigen Sie nur eine Datenträgergröße in Gigabyte. Geben Sie diese entweder in das Webformular :guilabel:`Create Volume` ein oder verwenden Sie die Befehlszeile:
id: Untuk menambahkan volume baru, Anda hanya perlu ukuran volume dalam gigabyte. Masukkan ini ke formulir web :guilabel:`Create Volume` atau gunakan command line:

source: To address this issue:
de: Um dieses Problem zu lösen:
id: Untuk mengatasi masalah ini:

source: To apply or update account quotas on a project:
de: Um Kontoquoten auf ein Projekt anzuwenden oder zu aktualisieren:
id: Untuk menerapkan atau memperbarui kuota akun pada suatu proyek:

source: To associate a key with an instance on boot, add ``--key-name mykey`` to your command line. For example:
de: Um einen Schlüssel einer Instanz beim Booten zuzuordnen, fügen Sie ``--key-name mykey`` zu Ihrer Kommandozeile hinzu. Zum Beispiel:

source: To associate or disassociate a floating IP with a server from the command line, use the following commands:
de: Um eine Floating IP einem Server von der Befehlszeile aus zuzuordnen oder zu trennen, verwenden Sie die folgenden Befehle:

source: To avoid this situation, create a highly available cloud controller cluster. This is outside the scope of this document, but you can read more in the `OpenStack High Availability Guide <https://docs.openstack.org/ha-guide/index.html>`_.
de: Um diese Situation zu vermeiden, erstellen Sie einen hochverfügbaren Cloud-Controller-Cluster. Dies liegt außerhalb des Umfangs dieses Dokuments, aber Sie können mehr im `OpenStack High Availability Guide <https://docs.openstack.org/ha-guide/index.html>`_ lesen.
id: Untuk menghindari situasi ini, buat kluster pengendali cloud yang sangat tersedia. Ini di luar ruang lingkup dokumen ini, tetapi Anda dapat membaca lebih lanjut di `OpenStack High Availability Guide <https://docs.openstack.org/ha-guide/index.html>`_.

source: To begin, configure all OpenStack components to log to the syslog log file in addition to their standard log file location. Also, configure each component to log to a different syslog facility. This makes it easier to split the logs into individual components on the central server:
de: Konfigurieren Sie zunächst alle OpenStack-Komponenten so, dass sie sich zusätzlich zu ihrem Standard-Logfile-Speicherort in der syslog-Logdatei anmelden. Konfigurieren Sie auch jede Komponente so, dass sie sich bei einer anderen Syslog-Funktion anmeldet. Dies erleichtert die Aufteilung der Protokolle in einzelne Komponenten auf dem zentralen Server:
id: Untuk memulai, konfigurasikan semua komponen OpenStack untuk masuk ke file log syslog di samping lokasi file log standar mereka. Juga, konfigurasikan setiap komponen untuk masuk ke fasilitas syslog yang berbeda. Ini membuatnya lebih mudah untuk membagi log menjadi komponen-komponen tersendiri di server pusat:

source: To boot normally from an image and attach block storage, map to a device other than vda. You can find instructions for launching an instance and attaching a volume to the instance and for copying the image to the attached volume in the `OpenStack End User Guide <https://docs.openstack.org/user-guide/dashboard-launch-instances.html>`__.
de: Um normal von einem Abbild zu booten und Blockspeicher anzuhängen, ordnen Sie das Gerät einem anderen Gerät als vda zu. Anweisungen zum Starten einer Instanz und zum Anhängen eines Datenträgers an die Instanz sowie zum Kopieren des Abbildes auf den angehängten Datenträger finden Sie im `OpenStack End User Guide <https://docs.openstack.org/user-guide/dashboard-launch-instances.html>`__.

source: To change the name of a share, or update its description, or level of visibility for other tenants, use this command:
de: Verwenden Sie diesen Befehl, um den Namen einer Freigabe zu ändern, ihre Beschreibung zu aktualisieren oder die Sichtbarkeit für andere Mandanten zu erhöhen:

source: To confirm that creation has been successful, see the share in the share list:
de: Um zu bestätigen, dass die Erstellung erfolgreich war, siehe die Freigabe in der Freigabeliste:

source: To control a share network, Shared File Systems service requires interaction with Networking service to manage share servers on its own. If the selected driver runs in a mode that requires such kind of interaction, you need to specify the share network when a share is created. For the information on share creation, see :ref:`create_share` earlier in this chapter. Initially, check the existing share networks type list by:
de: Um ein Freigabe-Netzwerk zu steuern, erfordert der Dienst Shared File Systems die Interaktion mit dem Networking-Dienst, um Share-Server selbst zu verwalten. Wenn der ausgewählte Treiber in einem Modus ausgeführt wird, der eine solche Art von Interaktion erfordert, müssen Sie das Freigabennetzwerk angeben, wenn eine Freigabe erstellt wird. Informationen zur Erstellung von Freigaben finden Sie unter :ref:`create_share` früher in diesem Kapitel. Überprüfen Sie zunächst die vorhandene Typenliste der Freigabenetzwerke nach:

source: To create a development environment, you can use DevStack. DevStack is essentially a collection of shell scripts and configuration files that builds an OpenStack development environment for you. You use it to create such an environment for developing a new feature.
de: Um eine Entwicklungsumgebung zu erstellen, können Sie DevStack verwenden. DevStack ist im Wesentlichen eine Sammlung von Shellskripten und Konfigurationsdateien, die eine OpenStack-Entwicklungsumgebung für Sie erstellt. Sie verwenden es, um eine solche Umgebung für die Entwicklung eines neuen Features zu schaffen.
id: Untuk membuat lingkungan pengembangan, Anda dapat menggunakan DevStack. DevStack pada dasarnya adalah kumpulan skrip shell dan file konfigurasi yang membangun lingkungan pengembangan OpenStack untuk Anda. Anda menggunakannya untuk membuat lingkungan seperti itu untuk mengembangkan fitur baru.

source: To create a project through the OpenStack dashboard:
de: So erstellen Sie ein Projekt über das OpenStack-Dashboard:
id: Untuk membuat proyek melalui dasbor OpenStack:

source: To create a scheduler, you must inherit from the class ``nova.scheduler.driver.Scheduler``. Of the five methods that you can override, you *must* override the two methods marked with an asterisk (\*) below:
de: Um einen Scheduler zu erstellen, müssen Sie von der Klasse ``nova.scheduler.driver.driver.scheduleuler`` erben. Von den fünf Methoden, die Sie überschreiben können, müssen Sie die beiden Methoden, die mit einem Sternchen (\*) gekennzeichnet sind, *überschreiben*:
id: Untuk membuat penjadwal, Anda harus mewarisi dari kelas ``nova.scheduler.driver.Scheduler``. Dari lima metode yang dapat Anda timpa, Anda *must* mengganti dua metode yang ditandai dengan tanda bintang (\*) di bawah ini:

source: To create a user, you need the following information:
de: Um einen Benutzer anzulegen, benötigen Sie die folgenden Informationen:

source: To create security group rules for a cluster of instances, use RemoteGroups.
de: Um Sicherheitsgruppenregeln für einen Cluster von Instanzen zu erstellen, verwenden Sie RemoteGroups.
id: Untuk membuat aturan grup keamanan untuk sekelompok instance, gunakan RemoteGroups.

source: To deal with the "dirty" buffer issue, we recommend using the sync command before snapshotting:
de: Um das Problem des "dirty" Puffers zu lösen, empfehlen wir, vor der Schattenkopie den Sync-Befehl zu verwenden:

source: To delete an image, just execute:
de: Um ein Abbild zu löschen, führen Sie es einfach aus:
id: Untuk menghapus image, cukup jalankan:

source: To delete instances from the dashboard, select the :guilabel:`Delete Instance` action next to the instance on the :guilabel:`Instances` page.
de: Um Instanzen aus dem Dashboard zu löschen, wählen Sie die Aktion :guilabel:`Delete Instance` neben der Instanz auf der Seite :guilabel:`Instances`.

source: To demonstrate customizing OpenStack, we'll create an example of a Compute scheduler that randomly places an instance on a subset of hosts, depending on the originating IP address of the request and the prefix of the hostname. Such an example could be useful when you have a group of users on a subnet and you want all of their instances to start within some subset of your hosts.
de: Um die Anpassung von OpenStack zu demonstrieren, erstellen wir ein Beispiel für einen Compute-Scheduler, der eine Instanz zufällig auf einer Teilmenge von Hosts platziert, abhängig von der ursprünglichen IP-Adresse der Anfrage und dem Präfix des Hostnamens. Ein solches Beispiel könnte nützlich sein, wenn Sie eine Gruppe von Benutzern in einem Subnetz haben und möchten, dass alle ihre Instanzen innerhalb einer Teilmenge Ihrer Hosts starten.
id: Untuk mendemonstrasikan penyesuaian OpenStack, kami akan membuat contoh penjadwal Compute yang secara acak menempatkan instance pada subset host, tergantung pada alamat IP asal permintaan dan awalan nama host. Contoh seperti itu bisa berguna ketika Anda memiliki sekelompok pengguna di subnet dan Anda ingin semua instance mereka dimulai dalam beberapa subset dari host Anda.

source: To determine the potential features going in to future releases, or to look at features implemented previously, take a look at the existing blueprints such as `OpenStack Compute (nova) Blueprints <https://blueprints.launchpad.net/nova>`_, `OpenStack Identity (keystone) Blueprints <https://blueprints.launchpad.net/keystone>`_, and release notes.
de: Um die potenziellen Funktionen für zukünftige Versionen zu ermitteln oder um die zuvor implementierten Funktionen zu betrachten, werfen Sie einen Blick auf die vorhandenen Blueprints wie `OpenStack Compute (nova) Blueprints <https://blueprints.launchpad.net/nova>`_, `OpenStack Identity (keystone) Blueprints <https://blueprints.launchpad.net/keystone>`_ und Release Notes.
id: Untuk menentukan fitur potensial yang masuk ke rilis mendatang, atau untuk melihat fitur yang diterapkan sebelumnya, lihat cetak biru yang ada seperti `OpenStack Compute (nova) Blueprints <https://blueprints.launchpad.net/nova>`_, `OpenStack Identity (keystone) Blueprints <https://blueprints.launchpad.net/keystone>`_, dan catatan rilis.

source: To disable DEBUG-level logging, edit ``/etc/nova/nova.conf`` file as follows:
de: Um die Protokollierung auf DEBUG-Ebene zu deaktivieren, bearbeiten Sie die Datei ``/etc/nova/nova.conf`` wie folgt:
id: Untuk menonaktifkan logging tingkat DEBUG, edit file ``/etc/nova/nova.conf`` sebagai berikut:

source: To discover how API requests should be structured, read the `OpenStack API Reference <https://docs.openstack.org/api-quick-start/index.html>`_. To chew through the responses using jq, see the `jq Manual <http://stedolan.github.io/jq/manual/>`_.
de: Um herauszufinden, wie API-Anfragen strukturiert sein sollten, lesen Sie die `OpenStack API Referenz <https://docs.openstack.org/api-quick-start/index.html>`_. Um die Antworten mit jq durchzukauen, lesen Sie bitte das `jq Handbuch <http://stedolan.github.io/jq/manual/>`_.

source: To do this, generate a list of instance UUIDs that are hosted on the failed node by running the following query on the nova database:
de: Erzeugen Sie dazu eine Liste von Instanz-UUIDs, die auf dem ausgefallenen Knoten gehostet werden, indem Sie die folgende Abfrage auf der nova-Datenbank ausführen:
id: Untuk melakukan ini, buat daftar instance UUID yang di-host pada node gagal dengan menjalankan query berikut pada database nova:

source: To effectively disable the libvirt live snapshotting, until the problem is resolved, add the below setting to nova.conf.
de: Um die Live-Schattenkopie von libvirt effektiv zu deaktivieren, bis das Problem behoben ist, fügen Sie die folgende Einstellung zu nova.conf hinzu.
