Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: There is a configuration option in ``/etc/glance/glance-api.conf`` that limits the number of members allowed per image, called ``image_member_quota``, set to 128 by default. That setting is a different quota from the storage quota.
de: Es gibt eine Konfigurationsoption in ``/etc/glance/glance/glance-api.conf``, die die Anzahl der zulässigen Mitglieder pro Abbld begrenzt, genannt ``image_member_quota``, standardmäßig auf 128 gesetzt. Diese Einstellung ist eine andere Quote als die Speicherquote.
id: Ada opsi konfigurasi di ``/etc/glance/glance-api.conf`` yang membatasi jumlah anggota yang diizinkan per image, yang disebut ``image_member_quota``, yang diatur ke 128 secara default. Pengaturan itu adalah kuota yang berbeda dari kuota penyimpanan.

source: There is a lot of useful information in ``context``, ``request_spec``, and ``filter_properties`` that you can use to decide where to schedule the instance. To find out more about what properties are available, you can insert the following log statements into the ``schedule_run_instance`` method of the scheduler above:
de: Es gibt viele nützliche Informationen in ``context``, ```request_spec`` und ``filter_properties``, die Sie verwenden können, um zu entscheiden, wo Sie die Instanz planen möchten. Um mehr darüber zu erfahren, welche Eigenschaften verfügbar sind, können Sie die folgenden Protokollanweisungen in die Methode ``schedule_run_instance`` des obigen Schedulers einfügen:
id: Ada banyak informasi berguna dalam ``context``, ``request_spec``, dan ``filter_properties`` yang dapat Anda gunakan untuk memutuskan di mana harus menjadwalkan instance. Untuk mengetahui lebih lanjut tentang properti apa yang tersedia, Anda dapat memasukkan pernyataan log berikut ke dalam metode ``schedule_run_instance`` dari penjadwal di atas:

source: There is a lot of useful information in ``env`` and ``conf`` that you can use to decide what to do with the request. To find out more about what properties are available, you can insert the following log statement into the ``__init__`` method:
de: Es gibt viele nützliche Informationen in ``env`` und ``conf```, mit denen Sie entscheiden können, was mit der Anfrage geschehen soll. Um mehr darüber zu erfahren, welche Eigenschaften verfügbar sind, können Sie die folgende Log-Anweisung in die Methode ``__init__`` einfügen:
id: Ada banyak informasi berguna dalam ``env`` dan ``conf`` yang dapat Anda gunakan untuk memutuskan apa yang harus dilakukan dengan permintaan tersebut. Untuk mengetahui lebih lanjut tentang properti apa yang tersedia, Anda dapat memasukkan pernyataan log berikut ke dalam metode ``__init__``:

source: There is a pair of useful commands that help manipulate share networks. To start, check the network list:
de: Es gibt ein Paar nützlicher Befehle, die bei der Manipulation von Freigabenetzwerken helfen. Überprüfen Sie zunächst die Netzwerkliste:

source: There is nothing OpenStack-specific in being aware of the steps needed to access block devices from within the instance operating system, potentially formatting them for first use and being cautious when removing them. What is specific is how to create new volumes and attach and detach them from instances. These operations can all be done from the :guilabel:`Volumes` page of the dashboard or by using the ``openstack`` command-line client.
de: Es ist nichts OpenStack-spezifisches, sich der Schritte bewusst zu sein, die erforderlich sind, um auf Blockgeräte innerhalb des Instanzbetriebssystems zuzugreifen, sie möglicherweise für die erste Verwendung zu formatieren und vorsichtig zu sein, wenn man sie entfernt. Das Besondere daran ist, wie man neue Datenträger erstellt und sie anhängt und von Instanzen trennt. Diese Operationen können alle über die Seite :guilabel:`Volumes` des Dashboards oder über den Befehlszeilen-Client ``openstack`` durchgeführt werden.
id: Tidak ada yang spesifik dengan OpenStack untuk mengetahui langkah-langkah yang diperlukan untuk mengakses perangkat blok dari dalam sistem operasi instance, berpotensi memformatnya untuk penggunaan pertama dan berhati-hati saat melepaskannya. Yang spesifik adalah bagaimana membuat volume baru dan melampirkan dan melepaskannya dari instance. Semua operasi ini dapat dilakukan dari halaman :guilabel:`Volumes` dashboard atau dengan menggunakan klien command-line ``openstack``.

source: Therefore, the fastest way to get your feature request up for consideration is to create an Etherpad with your ideas and propose a session to the PTG. If the PTG has already passed, you may also create a blueprint directly. Read this `blog post about how to work with blueprints <http://vmartinezdelacruz.com/how-to-work-with-blueprints-without-losing-your-mind/>`_ the perspective of Victoria Martínez, a developer intern.
de: Daher ist der schnellste Weg, Ihre Feature-Anfrage zur Prüfung zu stellen, ein Etherpad mit Ihren Ideen zu erstellen und im PTG eine Sitzung vorzuschlagen. Wenn der PTG bereits gehalten wurde, können Sie auch direkt eine Blueprint erstellen. Lesen Sie diesen `Blogbeitrag über die Arbeit mit Blueprints <http://vmartinezdelacruz.com/how-to-work-with-blueprints-without-losing-your-mind/>`_ aus der Perspektive von Victoria Martínez, einer Praktikantin für Entwickler.
id: Karena itu, cara tercepat untuk mempertimbangkan permintaan fitur Anda adalah dengan membuat Etherpad dengan ide-ide Anda dan mengusulkan sesi ke PTG. Jika PTG telah lulus, Anda juga dapat membuat cetak biru secara langsung. Baca ini `blog post about how to work with blueprints <http://vmartinezdelacruz.com/how-to-work-with-blueprints-without-losing-your-mind/>`_ perspektif Victoria Martínez, pengembang intern.

source: These actions effectively take the storage node out of the storage cluster.
de: Diese Aktion nimmt den Storage Node aus dem Storage Cluster heraus.
id: Tindakan ini secara efektif mengambil node penyimpanan dari cluster penyimpanan.

source: These are configurable by admin users (the rights may also be delegated to other users by redefining the access controls for ``compute_extension:flavormanage`` in ``/etc/nova/policy.json`` on the ``nova-api`` server). To get the list of available flavors on your system, run:
de: Diese sind von Admin-Benutzern konfigurierbar (die Rechte können auch an andere Benutzer delegiert werden, indem die Zugriffskontrollen für ``compute_extension:flavormanage`` in ``/etc/nova/policy.json`` auf dem `nova-api`` Server neu definiert werden). Um die Liste der verfügbaren Flavors auf Ihrem System zu erhalten, führen Sie run:
id: Ini dapat dikonfigurasi oleh pengguna admin (hak juga dapat didelegasikan kepada pengguna lain dengan mendefinisikan kembali kontrol akses untuk ``compute_extension: flavormanage`` di ``/etc/nova/policy.json`` pada ``nova-api` `server). Untuk mendapatkan daftar flavor yang tersedia di sistem Anda, jalankan:

source: These are shared legendary tales of image disappearances, VM massacres, and crazy troubleshooting techniques that result in hard-learned lessons and wisdom.
de: Dies sind legendäre Geschichten über das Verschwinden von Abbildern, VM-Massaker und verrückte Fehlerbehebungstechniken, die zu schwer erlernbaren Lektionen und Weisheit führen.

source: These changes have facilitated the first proper OpenStack upgrade guide, found in :doc:`ops-upgrades`, and will continue to improve in the next release.
de: Diese Änderungen haben den ersten richtigen OpenStack-Upgrade-Leitfaden erleichtert, der in :doc:`ops-upgrades` zu finden ist, und werden in der nächsten Version weiter verbessert.
id: Perubahan ini telah memfasilitasi panduan peningkatan OpenStack pertama yang tepat, ditemukan di :doc:`ops-upgradeades`, dan akan terus meningkat pada rilis berikutnya.

source: These rules are all "allow" type rules, as the default is deny. This example shows the full port range for all protocols allowed from all IPs. This section describes the most common security group rule parameters:
de: Diese Regeln sind alle "allow"-Typenregeln, da der Standard abgelehnt wird. Dieses Beispiel zeigt den vollen Portbereich für alle Protokolle, die von allen IPs erlaubt sind. In diesem Abschnitt werden die gängigsten Parameter für Sicherheitsgruppenregeln beschrieben:
id: Aturan-aturan ini semua aturan jenis "allow" , karena standarnya ditolak. Contoh ini menunjukkan kisaran port lengkap untuk semua protokol yang diizinkan dari semua IP. Bagian ini menjelaskan parameter aturan grup keamanan yang paling umum:

source: These security domains can be individually or collectively mapped to an OpenStack deployment. The cloud operator should be aware of the appropriate security concerns. Security domains should be mapped out against your specific OpenStack deployment topology. The domains and their trust requirements depend upon whether the cloud instance is public, private, or hybrid.
de: Diese Sicherheitsdomänen können einzeln oder gemeinsam einer OpenStack-Bereitstellung zugeordnet werden. Der Cloud-Betreiber sollte sich der entsprechenden Sicherheitsbedenken bewusst sein. Sicherheitsdomänen sollten auf Ihre spezifische OpenStack-Bereitstellungstopologie abgestimmt sein. Die Domänen und ihre Vertrauensanforderungen hängen davon ab, ob die Cloud-Instanz öffentlich, privat oder hybrid ist.
id: Domain keamanan ini dapat dipetakan secara individual atau kolektif ke penyebaran OpenStack. Operator cloud harus mengetahui masalah keamanan yang sesuai. Domain keamanan harus dipetakan terhadap topologi penyebaran OpenStack spesifik Anda. Domain dan persyaratan kepercayaan mereka bergantung pada apakah mesin virtual tersebut publik, pribadi, atau hibrid.

source: These steps depend on your underlying distribution, but in general you should be looking for :command:`purge` commands in your package manager, like :command:`aptitude purge ~c $package`. Following this, you can look for orphaned files in the directories referenced throughout this guide. To uninstall the database properly, refer to the manual appropriate for the product in use.
de: Diese Schritte hängen von der zugrunde liegenden Distribution ab, aber im Allgemeinen sollten Sie nach :command:`purge` Befehlen in Ihrem Paketmanager suchen, wie :command:`aptitude purge ~c $package`. Anschließend können Sie in den Verzeichnissen, auf die in diesem Handbuch verwiesen wird, nach verwaisten Dateien suchen. Um die Datenbank ordnungsgemäß zu deinstallieren, lesen Sie bitte das für das verwendete Produkt entsprechende Handbuch.
id: Langkah-langkah ini tergantung pada distribusi mendasar Anda, tetapi secara umum Anda harus mencari perintah :command:`purge` di manajer paket Anda, seperti :command:`aptitude purge ~c $package`. Setelah ini, Anda dapat mencari file-file tanpa induk (orphaned) di direktori yang dirujuk di seluruh panduan ini. Untuk menghapus instalan database dengan benar, lihat manual yang sesuai untuk produk yang digunakan.

source: These tunnels use the regular routing tables on the host to route the resulting GRE packet, so there is no requirement that GRE endpoints are all on the same layer-2 network, unlike VLAN encapsulation.
de: Diese Tunnel verwenden die regulären Routingtabellen auf dem Host, um das resultierende GRE-Paket zu routen, so dass es keine Anforderung gibt, dass sich die GRE-Endpunkte alle im gleichen Layer-2-Netzwerk befinden, im Gegensatz zur VLAN-Kapselung.
id: Terowongan ini menggunakan tabel routing biasa pada host untuk merutekan paket GRE yang dihasilkan, jadi tidak ada persyaratan bahwa endpoint GRE semua pada jaringan layer-2 yang sama, tidak seperti enkapsulasi VLAN.

source: These two statements are produced by our middleware and show that the request was sent from our DevStack instance and was allowed.
de: Diese beiden Anweisungen werden von unserer Middleware erzeugt und zeigen, dass die Anfrage von unserer DevStack-Instanz gesendet wurde und erlaubt war.
id: Kedua pernyataan ini diproduksi oleh middleware kami dan menunjukkan bahwa permintaan dikirim dari instance DevStack kami dan diizinkan.

source: Thinking it was just a one-off issue, I terminated the instance and launched a new one. By then, the conference call ended and I was off to the data center.
de: Da ich dachte, es sei nur ein einmaliges Problem, beendete ich die Instanz und startete eine neue. Zu diesem Zeitpunkt endete die Telefonkonferenz und ich ging ins Rechenzentrum.
id: Berpikir itu hanya masalah satu kali, saya menghentikan instance dan meluncurkan yang baru. Pada saat itu, panggilan konferensi berakhir dan saya pergi ke pusat data.

source: This appendix contains a small selection of use cases from the community, with more technical detail than usual. Further examples can be found on the `OpenStack website <https://www.openstack.org/user-stories/>`_.
de: Dieser Anhang enthält eine kleine Auswahl von Anwendungsfällen aus der Community, mit mehr technischen Details als sonst. Weitere Beispiele finden Sie auf der `OpenStack-Website <https://www.openstack.org/user-stories/>`_.
id: Apendiks ini berisi sejumlah kecil kasus penggunaan dari komunitas, dengan lebih banyak detail teknis dari biasanya. Contoh lebih lanjut dapat ditemukan di `OpenStack website <https://www.openstack.org/user-stories/>`_.

source: This attribute value matches the specified IP prefix as the source IP address of the IP packet.
de: Dieser Attributwert entspricht dem angegebenen IP-Präfix als Quell-IP-Adresse des IP-Pakets.
id: Nilai atribut ini cocok dengan awalan IP yang ditentukan sebagai alamat IP sumber dari paket IP.

source: This book contains several parts to show best practices and tips for the repeated operations for running OpenStack clouds.
de: Dieses Buch enthält mehrere Teile, die Best Practices und Tipps für die wiederholten Operationen zum Ausführen von OpenStack-Clouds zeigen.

source: This book is for those of you starting to run OpenStack clouds as well as those of you who were handed an operational one and want to keep it running well. Perhaps you're on a DevOps team, perhaps you are a system administrator starting to dabble in the cloud, or maybe you want to get on the OpenStack cloud team at your company. This book is for all of you.
de: Dieses Buch ist für diejenigen unter Ihnen, die anfangen, OpenStack-Clouds zu betreiben, sowie für diejenigen unter Ihnen, denen eine operative Cloud übergeben wurde und die sie gut laufen lassen wollen. Vielleicht sind Sie in einem DevOps-Team, vielleicht sind Sie ein Systemadministrator, der sich in der Cloud zurechtfindet, oder vielleicht möchten Sie in Ihrem Unternehmen in das OpenStack-Cloud-Team aufgenommen werden. Dieses Buch ist für euch alle.

source: This bug report was the key to everything: `KVM images lose connectivity with bridged network <https://bugs.launchpad.net/ubuntu/+source/qemu-kvm/+bug/997978>`_.
de: Dieser Fehlerbericht war der Schlüssel zu allem: `KVM-Bilder verlieren die Verbindung zum überbrückten Netzwerk <https://bugs.launchpad.net/ubuntu/+source/qemu-kvm/+bug/997978>`_.
id: Laporan bug ini adalah kunci dari segalanya: `KVM images lose connectivity with bridged network <https://bugs.launchpad.net/ubuntu/+source/qemu-kvm/+bug/997978>`_.

source: This chapter describes only how to back up configuration files and databases that the various OpenStack components need to run. This chapter does not describe how to back up objects inside Object Storage or data contained inside Block Storage. Generally these areas are left for users to back up on their own.
de: In diesem Kapitel wird nur beschrieben, wie Sie Konfigurationsdateien und Datenbanken sichern, die von den verschiedenen OpenStack-Komponenten ausgeführt werden müssen. Dieses Kapitel beschreibt nicht, wie Sie Objekte im Objektspeicher oder Daten im Blockspeicher sichern können. Im Allgemeinen bleiben diese Bereiche den Benutzern überlassen, um selbstständig zu sichern.
id: Bab ini hanya menjelaskan cara mencadangkan file konfigurasi dan database yang harus dijalankan oleh berbagai komponen OpenStack. Bab ini tidak menjelaskan cara membuat cadangan objek di dalam Object Storage atau data yang terkandung di dalam Block Storage. Umumnya area ini dibiarkan bagi pengguna untuk membuat cadangan sendiri.

source: This chapter describes what you need to back up within OpenStack as well as best practices for recovering backups.
de: Dieses Kapitel beschreibt, was Sie innerhalb von OpenStack sichern müssen, sowie bewährte Verfahren zur Wiederherstellung von Backups.

source: This chapter focuses on the second path for customizing OpenStack by providing two examples for writing new features. The first example shows how to modify Object Storage service (swift) middleware to add a new feature, and the second example provides a new scheduler feature for Compute service (nova). To customize OpenStack this way you need a development environment. The best way to get an environment up and running quickly is to run DevStack within your cloud.
de: Dieses Kapitel konzentriert sich auf den zweiten Weg zur Anpassung von OpenStack, indem es zwei Beispiele für das Schreiben neuer Features enthält. Das erste Beispiel zeigt, wie man die Middleware des Object Storage Service (swift) ändert, um eine neue Funktion hinzuzufügen, und das zweite Beispiel zeigt eine neue Scheduler-Funktion für den Compute Service (nova). Um OpenStack auf diese Weise anzupassen, benötigen Sie eine Entwicklungsumgebung. Der beste Weg, eine Umgebung schnell in Betrieb zu nehmen, ist, DevStack in Ihrer Cloud auszuführen.
id: Bab ini berfokus pada jalur kedua untuk menyesuaikan OpenStack dengan memberikan dua contoh untuk menulis fitur baru. Contoh pertama menunjukkan bagaimana mengubah layanan Object Storage (swift) middleware untuk menambahkan fitur baru, dan contoh kedua menyediakan fitur penjadwal baru untuk layanan Compute (nova). Untuk menyesuaikan OpenStack dengan cara ini, Anda memerlukan lingkungan pengembangan. Cara terbaik untuk mendapatkan lingkungan dan berjalan cepat adalah menjalankan DevStack di cloud Anda.

source: This chapter goes into the common failures that the authors have seen while running clouds in production, including troubleshooting.
de: Dieses Kapitel geht auf die häufigsten Fehler ein, die die Autoren beim Ausführen von Clouds in der Produktion gesehen haben, einschließlich der Fehlerbehebung.

source: This chapter helps you set up your working environment and use it to take a look around your cloud.
de: Dieses Kapitel hilft Ihnen, Ihre Arbeitsumgebung einzurichten und damit einen Blick in Ihre Cloud zu werfen.
id: Bab ini membantu Anda mengatur lingkungan kerja Anda dan menggunakannya untuk melihat-lihat cloud Anda.

source: This chapter is written to let you get your hands wrapped around your OpenStack cloud through command-line tools and understanding what is already set up in your cloud.
de: Dieses Kapitel wurde geschrieben, damit Sie Ihre Hände mit Hilfe von Befehlszeilen-Tools um Ihre OpenStack-Cloud legen und verstehen können, was bereits in Ihrer Cloud eingerichtet ist.

source: This chapter provides upgrade information based on the architectures used in this book.
de: Dieses Kapitel enthält Upgrade-Informationen zu den in diesem Buch verwendeten Architekturen.

source: This chapter shows you how to use OpenStack cloud resources and how to train your users.
de: In diesem Kapitel erfahren Sie, wie Sie die OpenStack-Cloud-Ressourcen nutzen und wie Sie Ihre Benutzer schulen können.

source: This chapter shows you where OpenStack places logs and how to best read and manage logs for monitoring purposes.
de: In diesem Kapitel erfahren Sie, wo OpenStack Protokolle platziert und wie Sie Protokolle für Überwachungszwecke am besten lesen und verwalten können.

source: This chapter walks through user-enabling processes that all admins must face to manage users, give them quotas to parcel out resources, and so on.
de: Dieses Kapitel führt durch Prozesse zur Benutzeraktivierung, mit denen alle Administratoren konfrontiert werden, um Benutzer zu verwalten, ihnen Quoten zu geben, um Ressourcen zu verteilen, und so weiter.

source: This command creates a project named ``demo``. Optionally, you can add a description string by appending ``--description PROJECT_DESCRIPTION``, which can be very useful. You can also create a project in a disabled state by appending ``--disable`` to the command. By default, projects are created in an enabled state.
de: Dieser Befehl erstellt ein Projekt mit dem Namen ``demo``. Optional können Sie eine Beschreibungszeichenfolge hinzufügen, indem Sie ``--description PROJECT_DESCRIPTION`` anhängen, was sehr nützlich sein kann. Sie können ein Projekt auch in einem deaktivierten Zustand erstellen, indem Sie dem Befehl ``--disable`` anhängen. Standardmäßig werden Projekte in einem aktivierten Zustand erstellt.
id: Perintah ini membuat proyek bernama ``demo``. Secara opsional, Anda dapat menambahkan string deskripsi dengan menambahkan ``--deskripsi PROJECT_DESCRIPTION``, yang dapat sangat berguna. Anda juga dapat membuat proyek dalam keadaan dinonaktifkan dengan menambahkan ``--disable`` ke perintah. Secara default, proyek dibuat dalam keadaan diaktifkan.

source: This command displays a list of how many instances a tenant has running and some light usage statistics about the combined instances. This command is useful for a quick overview of your cloud, but it doesn't really get into a lot of details.
de: Dieser Befehl zeigt eine Liste der laufenden Instanzen eines Mandanten und einige leichte Nutzungsstatistiken über die kombinierten Instanzen an. Dieser Befehl ist nützlich für einen schnellen Überblick über Ihre Cloud, aber er geht nicht wirklich auf viele Details ein.
id: Perintah ini menampilkan daftar berapa banyak instance yang telah dijalankan penyewa dan beberapa statistik penggunaan ringan tentang instance gabungan. Perintah ini berguna untuk tinjauan umum cepat cloud Anda, tetapi tidak terlalu banyak detail.

source: This command will create a public share with the following parameters: ``name = netapp1``, ``spec_driver_handles_share_servers = False``
de: Dieser Befehl erstellt eine öffentliche Freigabe mit den folgenden Parametern: ``name = netapp1``, ``spec_driver_handles_share_servers = False``

source: This configuration will result in a separate log file for each compute node as well as an aggregated log file that contains nova logs from all nodes.
de: Diese Konfiguration führt zu einer separaten Protokolldatei für jeden Compute-Knoten sowie zu einer aggregierten Protokolldatei, die nova-Protokolle von allen Knoten enthält.
id: Konfigurasi ini akan menghasilkan file log terpisah untuk setiap node komputasi serta file log gabungan yang berisi log nova dari semua node.

source: This creates a 10 GB volume. To list existing volumes and the instances they are connected to, if any:
de: Dadurch wird ein 10 GB großer Datenträger erstellt. Auflistung der vorhandenen Datenträger und der Instanzen, mit denen sie verbunden sind, falls vorhanden:
id: Ini menghasilkan volume 10 GB. Untuk membuat daftar volume yang ada dan instance yang terhubung, jika ada:

source: This creates a key named ``mykey``, which you can associate with instances. The file ``mykey.pem`` is the private key, which should be saved to a secure location because it allows root access to instances the ``mykey`` key is associated with.
de: Dadurch wird ein Schlüssel namens ``mykey`` erzeugt, den du mit Instanzen verknüpfen kannst. Die Datei ``mykey.pem`` ist der private Schlüssel, der an einem sicheren Ort gespeichert werden sollte, da er den Root-Zugriff auf Instanzen ermöglicht, denen der ``mykey`` Schlüssel zugeordnet ist.
