Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: Sometimes an instance is terminated but the floating IP was not correctly disassociated from that instance. Because the database is in an inconsistent state, the usual tools to disassociate the IP no longer work. To fix this, you must manually update the database.
de: Manchmal wird eine Instanz beendet, aber die Floating IP wurde nicht korrekt von dieser Instanz getrennt. Da sich die Datenbank in einem inkonsistenten Zustand befindet, funktionieren die üblichen Werkzeuge zur Trennung der IP nicht mehr. Um dies zu beheben, müssen Sie die Datenbank manuell aktualisieren.
id: Terkadang sebuah instance dihentikan tetapi IP mengambang tidak dipisahkan dengan benar dari instance itu. Karena database berada dalam keadaan tidak konsisten, alat yang biasa digunakan untuk memisahkan IP tidak lagi berfungsi. Untuk memperbaikinya, Anda harus memperbarui basis data secara manual.

source: Sometimes it appears that a share hangs in one of transitional states (i.e. ``creating, deleting, managing, unmanaging, extending, and shrinking``). In that case, to delete it, you need :command:`manila force-delete share_name_or_ID` command and administrative permissions to run it:
de: Manchmal scheint es, dass eine Freigabe in einem der Übergangszustände hängt (d.h. "Erstellen, Löschen, Verwalten, Entmanagen, Vergrößern und Verkleinern"). In diesem Fall benötigen Sie zum Löschen den Befehl :command:`manila force-delete share_name_or_ID` und administrative Berechtigungen, um ihn auszuführen:

source: Source ``openrc`` to set up your environment variables for the CLI:
de: Quelle ``openrc``, um Ihre Umgebungsvariablen für die CLI einzurichten:
id: Sumber ``openrc`` untuk mengatur variabel lingkungan Anda untuk CLI:

source: Source openrc to set up your environment variables for the CLI:
de: Quelle openrc, um Ihre Umgebungsvariablen für die CLI einzurichten:
id: Sumber openrc untuk mengatur variabel lingkungan Anda untuk CLI:

source: Specific Configuration Topics
de: Spezifische Konfigurationsthemen
id: Topik Konfigurasi Khusus

source: Specifies the size of a secondary ephemeral data disk. This is an empty, unformatted disk and exists only for the life of the instance.
de: Gibt die Größe einer sekundären ephemeren Datenplatte an. Dies ist eine leere, unformatierte Festplatte und existiert nur für das Leben der Instanz.
id: Menentukan ukuran disk data sementara sekunder. Ini adalah disk kosong yang tidak diformat dan hanya ada selama masa pakai instance.

source: Specify quotas for existing users or tenants
de: Geben Sie Quoten für bestehende Benutzer oder Mandanten an
id: Tentukan kuota untuk pengguna atau tenant yang ada

source: StackTach is a tool that collects and reports the notifications sent by nova. Notifications are essentially the same as logs but can be much more detailed. Nearly all OpenStack components are capable of generating notifications when significant events occur. Notifications are messages placed on the OpenStack queue (generally RabbitMQ) for consumption by downstream systems. An overview of notifications can be found at `System Usage Data <https://wiki.openstack.org/wiki/SystemUsageData>`_.
de: StackTach ist ein Tool, das die von nova gesendeten Benachrichtigungen sammelt und meldet. Benachrichtigungen sind im Wesentlichen die gleichen wie Protokolle, können aber viel detaillierter sein. Fast alle OpenStack-Komponenten sind in der Lage, Benachrichtigungen zu generieren, wenn signifikante Ereignisse eintreten. Benachrichtigungen sind Nachrichten, die auf der OpenStack-Warteschlange (in der Regel RabbitMQ) für den Verbrauch durch nachgelagerte Systeme platziert werden. Eine Übersicht über die Benachrichtigungen finden Sie unter `Systemnutzungsdaten <https://wiki.openstack.org/wiki/SystemUsageData>`_.
id: StackTach adalah alat yang mengumpulkan dan melaporkan pemberitahuan yang dikirim oleh nova. Notifikasi pada dasarnya sama dengan log tetapi bisa lebih detail. Hampir semua komponen OpenStack mampu menghasilkan notifikasi ketika peristiwa signifikan terjadi. Notifikasi adalah pesan yang ditempatkan pada antrian OpenStack (umumnya RabbitMQ) untuk dikonsumsi oleh sistem hilir. Tinjauan umum pemberitahuan dapat ditemukan di `System Usage Data <https://wiki.openstack.org/wiki/SystemUsageData>`_.

source: Standard backup best practices apply when creating your OpenStack backup policy. For example, how often to back up your data is closely related to how quickly you need to recover from data loss.
de: Bei der Erstellung Ihrer OpenStack-Backup-Richtlinie gelten die üblichen Backup-Best Practices. Zum Beispiel hängt die Häufigkeit der Sicherung Ihrer Daten eng damit zusammen, wie schnell Sie nach einem Datenverlust wiederherstellen müssen.
id: Praktik terbaik cadangan standar berlaku saat membuat kebijakan cadangan OpenStack Anda. Misalnya, seberapa sering membuat cadangan data Anda terkait erat dengan seberapa cepat Anda perlu pulih dari kehilangan data.

source: Start the ``nova-compute`` service:
de: Starten Sie den Dienst ``nova-compute``:
id: Mulai layanan ``nova-compute``:

source: Starting Instances
de: Startinstanzen

source: Stop all OpenStack services.
de: Stoppen Sie alle OpenStack-Dienste.
id: Hentikan semua layanan OpenStack.

source: Stop the ``nova-compute`` service:
de: Beenden Sie den Dienst ``nova-compute``:
id: Hentikan layanan ``nova-compute``:

source: Storage Node Failures and Maintenance
de: Storage Node Fehler und Wartung
id: Kegagalan Storage Node dan Pemeliharaan

source: Strengthen the system against incidents, generally by reducing if not actually eliminating vulnerabilities.
de: Stärkung des Systems gegen Vorfälle, im Allgemeinen durch Reduzierung oder gar Beseitigung von Schwachstellen.
id: Perkuat sistem terhadap insiden, umumnya dengan mengurangi jika tidak benar-benar menghilangkan kerentanan.

source: Summary
de: Zusammenfassung
id: Ringkasan

source: Support for global clustering of object storage servers is available for all supported releases. You would implement these global clusters to ensure replication across geographic areas in case of a natural disaster and also to ensure that users can write or access their objects more quickly based on the closest data center. You configure a default region with one zone for each cluster, but be sure your network (WAN) can handle the additional request and response load between zones as you add more zones and build a ring that handles more zones. Refer to `Geographically Distributed Swift Considerations <https://docs.openstack.org/swift/latest/admin_guide.html#geographically-distributed-swift-considerations>`_ in the documentation for additional information.
de: Die Unterstützung für das globale Clustering von Object Storage Servern ist für alle unterstützten Releases verfügbar. Sie würden diese globalen Cluster implementieren, um im Falle einer Naturkatastrophe die Replikation über geografische Gebiete hinweg sicherzustellen und um sicherzustellen, dass Benutzer ihre Objekte schneller schreiben oder darauf zugreifen können, basierend auf dem nächstgelegenen Rechenzentrum. Sie konfigurieren eine Standardregion mit einer Zone für jeden Cluster, aber stellen Sie sicher, dass Ihr Netzwerk (WAN) die zusätzliche Anfrage- und Antwortlast zwischen den Zonen bewältigen kann, wenn Sie weitere Zonen hinzufügen und einen Ring aufbauen, der mehr Zonen verarbeitet. Weitere Informationen finden Sie in der Dokumentation unter `Geographically Distributed Swift Considerations <https://docs.openstack.org/swift/latest/admin_guide.html#geographically-distributed-swift-considerations>`_.
id: Dukungan untuk pengelompokan global server penyimpanan objek tersedia untuk semua rilis yang didukung. Anda akan mengimplementasikan kluster global ini untuk memastikan replikasi di seluruh wilayah geografis jika terjadi bencana alam dan juga untuk memastikan bahwa pengguna dapat menulis atau mengakses objek mereka lebih cepat berdasarkan pusat data terdekat. Anda mengonfigurasikan wilayah default dengan satu zona untuk setiap cluster, tetapi pastikan jaringan Anda (WAN) dapat menangani permintaan tambahan dan respons di antara zona saat Anda menambahkan lebih banyak zona dan membangun cincin yang menangani lebih banyak zona. Mengacu pada `Geographically Distributed Swift Considerations <https://docs.openstack.org/swift/latest/admin_guide.html#geographically-distributed-swift-considerations>`_ dalam dokumentasi untuk informasi tambahan.

source: Sure enough, the user had been periodically refreshing the console log page on the dashboard and the 5G file was traversing the Rabbit cluster to get to the dashboard.
de: Tatsächlich hatte der Benutzer die Konsolenprotokollseite auf dem Dashboard regelmäßig aktualisiert und die 5G-Datei durchquerte den Rabbit-Cluster, um zum Dashboard zu gelangen.
id: Benar saja, pengguna telah secara berkala me-refresh halaman log konsol di dashboard dan file 5G melintasi cluster Rabbit untuk sampai ke dashboard.

source: Suspend I/O to the disks, similar to the Linux ``fsfreeze -f`` operation.
de: Suspendieren Sie die I/Os auf den Festplatten, ähnlich wie beim Linux-Betrieb ``fsfsfreeze -f``.

source: Suspend the instance using the :command:`virsh` command, taking note of the internal ID:
de: Suspendieren Sie die Instanz mit dem Befehl :command:`virsh` unter Beachtung der internen ID:
id: Tangguhkan instance menggunakan perintah :command:`virsh` , perhatikan ID internal:

source: Suspend the instance using the ``virsh`` command.
de: Suspendieren Sie die Instanz mit dem Befehl ``virsh``.
id: Tangguhkan instance menggunakan perintah ``virsh``.

source: Swap space to free up memory for processes, as an independent area of the physical disk used only for swapping and nothing else.
de: Swap Space, um Speicher für Prozesse freizugeben, als unabhängiger Bereich der physischen Festplatte, der nur für Swapping und nichts anderes verwendet wird.
id: Tukar ruang untuk membebaskan memori untuk proses, sebagai area independen dari disk fisik yang hanya digunakan untuk bertukar dan tidak ada yang lain.

source: Swift should notice the new disk and that no data exists. It then begins replicating the data to the disk from the other existing replicas.
de: Swift sollte die neue Festplatte bemerken und feststellen, dass keine Daten vorhanden sind. Es beginnt dann mit der Replikation der Daten auf die Festplatte von den anderen vorhandenen Replikaten.
id: Swift harus memperhatikan disk baru dan tidak ada data. Kemudian mulai mereplikasi data ke disk dari replika lain yang ada.

source: Switch back to the ``n-sch`` screen. Among the log statements, you'll see the line:
de: Wechseln Sie zurück zum Bildschirm ``n-sch``. Unter den Protokollanweisungen sehen Sie die Zeile:
id: Beralih kembali ke layar ``n-sch``. Di antara pernyataan log, Anda akan melihat baris:

source: Syslog choices
de: Syslog-Auswahlen
id: Pilihan syslog

source: Systems Administration
de: Systemadministration
id: Systems Administration (administrasi sistem)

source: Sébastien Han has written excellent blogs and generously gave his permission for re-use.
de: Sébastien Han hat ausgezeichnete Blogs geschrieben und großzügig seine Erlaubnis zur Wiederverwendung erteilt.
id: Sébastien Han telah menulis blog yang luar biasa dan dengan murah hati memberikan izin untuk digunakan kembali.

source: Table OpenStack log locations
de: Tabelle OpenStack-Protokollspeicherorte
id: Tabel lokasi log OpenStack

source: Table. Example service restoration priority list
de: Tabelle. Beispiel Service Wiederherstellungsprioritätenliste
id: Table. Contoh daftar prioritas pemulihan layanan

source: Table. Flavor parameters
de: Tabelle. Variantenparameter

source: Table. OpenStack default flavors
de: Tabelle. OpenStack-Standardvarianten
id: Table. flavor standar OpenStack

source: Table. OpenStack segregation methods
de: Tabelle. OpenStack-Separationsverfahren
id: Table. Metode segregasi OpenStack

source: Table: Block Storage quota descriptions
de: Tabelle: Beschreibungen der Speicherquoten blockieren
id: Table: Deskripsi kuota Block Storage

source: Tailing Logs
de: Nachlaufprotokolle

source: Taking Snapshots
de: Aufnahme von Schattenkopien

source: Taking the first 11 characters, we can construct a device name of tapff387e54-9e from this output.
de: Aus den ersten 11 Zeichen können wir aus dieser Ausgabe einen Gerätenamen von tapff387e54-9e konstruieren.
id: Mengambil 11 karakter pertama, kita dapat membuat nama perangkat tapff387e54-9e dari output ini.

source: Tales From the Cryp^H^H^H^H Cloud
de: Geschichten aus der Cryp^H^H^H^H^H^H^H Cloud

source: Telemetry
de: Telemetrie

source: Telemetry Service
de: Telemetriedienst
id: Layanan Telemetry

source: Telemetry service - In typical environments, updating the Telemetry service only requires restarting the service.
de: Telemetriedienst - In typischen Umgebungen erfordert die Aktualisierung des Telemetriedienstes nur einen Neustart des Dienstes.
id: Layanan Telemetry - Dalam lingkungan tipikal, update layanan Telemetry hanya membutuhkan restarting layanan.

source: Tenants in multi-site installations need isolation from each other. The main challenge is ensuring tenant networks function across regions which is not currently supported in OpenStack Networking (neutron). Therefore an external system may be required to manage mapping. Tenant networks may contain sensitive information requiring accurate and consistent mapping to ensure that a tenant in one site does not connect to a different tenant in another site.
de: Mandanten in standortübergreifenden Installationen müssen voneinander isoliert werden. Die größte Herausforderung besteht darin, sicherzustellen, dass Mandantennetzwerke in allen Regionen funktionieren, die derzeit nicht von OpenStack Networking (Neutron) unterstützt werden. Daher kann ein externes System erforderlich sein, um das Mapping zu verwalten. Mandantennetzwerke können sensible Informationen enthalten, die eine genaue und konsistente Zuordnung erfordern, um sicherzustellen, dass ein Mandante an einem Standort nicht mit einem anderen Mandanten an einem anderen Standort verbunden ist.
id: Penyewa di instalasi multi-situs membutuhkan isolasi satu sama lain. Tantangan utama adalah memastikan fungsi jaringan penyewa di seluruh wilayah yang saat ini tidak didukung di OpenStack Networking (neutron). Oleh karena itu sistem eksternal mungkin diperlukan untuk mengelola pemetaan. Jaringan penyewa dapat berisi informasi sensitif yang membutuhkan pemetaan yang akurat dan konsisten untuk memastikan bahwa penyewa di satu situs tidak terhubung ke penyewa yang lain di situs lain.

source: Test the middleware from outside DevStack on a remote machine that has access to your DevStack instance:
de: Testen Sie die Middleware von außerhalb von DevStack auf einem entfernten Computer, der Zugriff auf Ihre DevStack-Instanz hat:
id: Uji middleware dari luar DevStack pada mesin jarak jauh yang memiliki akses ke instance DevStack Anda:

source: Test your middleware with the ``swift`` CLI. Start by switching to the shell screen and finish by switching back to the ``swift-proxy`` screen to check the log output:
de: Testen Sie Ihre Middleware mit der ``swift`` CLI. Beginnen Sie, indem Sie zum Shell-Bildschirm wechseln und beenden Sie ihn, indem Sie zum ``swift-proxy`` Bildschirm zurückkehren, um die Protokollausgabe zu überprüfen:
id: Uji middleware Anda dengan CLI ``swift``. Mulailah dengan beralih ke layar shell dan selesai dengan beralih kembali ke layar ``swift-proxy`` untuk memeriksa output log:

source: Test your scheduler with the nova CLI. Start by switching to the ``shell`` screen and finish by switching back to the ``n-sch`` screen to check the log output:
de: Testen Sie Ihren Scheduler mit der nova CLI. Beginnen Sie mit dem Umschalten auf den Bildschirm ``Shell`` und gehen Sie anschließend zurück zum Bildschirm ``n-sch``, um die Protokollausgabe zu überprüfen:
id: Uji penjadwal Anda dengan nova CLI. Mulailah dengan beralih ke layar ``shell`` dan selesai dengan beralih kembali ke layar ``n-sch`` untuk memeriksa output log:

source: That made no sense.
de: Das ergab keinen Sinn.
id: Itu tidak masuk akal.

source: Thaw (unfreeze) the system
de: Auftauen (Auftauen) des Systems

source: The "cluster" rule allows SSH access from any other instance that uses the ``global-http`` group.
de: Die "Cluster"-Regel erlaubt den SSH-Zugriff von jeder anderen Instanz aus, die die Gruppe ``global-http`` verwendet.
id: Aturan "cluster" memungkinkan akses SSH dari setiap instance lain yang menggunakan grup ``global-http``.

source: The 1gb NIC was still alive and active
de: Das 1gb NIC war noch am Leben und aktiv
id: NIC 1GB masih hidup dan aktif

source: The :command:`nova reboot` command wasn't working, so I used :command:`virsh`, but it immediately came back with an error saying it was unable to find the backing disk. In this case, the backing disk is the Glance image that is copied to ``/var/lib/nova/instances/_base`` when the image is used for the first time. Why couldn't it find it? I checked the directory and sure enough it was gone.
de: Der Befehl :command:`nova reboot` funktionierte nicht, also benutzte ich :command:`virsh`, aber er kam sofort mit einem Fehler zurück, der besagt, dass er die Backup-Disk nicht finden konnte. In diesem Fall ist die Backup-Disk das Glance-Abbild, das bei der ersten Verwendung des Abbildes nach ``/var/lib/nova/instances/_base`` kopiert wird. Warum konnte sie es nicht finden? Ich habe das Verzeichnis überprüft und bin sicher, dass es weg ist.
id: Perintah :command: `nova reboot` tidak berfungsi, jadi saya gunakan :command:`virsh`, tetapi segera kembali dengan kesalahan yang mengatakan itu tidak dapat menemukan backing disk. Dalam hal ini, disk pendukung adalah Glance image yang disalin ke ``/var/lib/nova/instances/_base`` saat image digunakan untuk pertama kalinya. Mengapa tidak bisa menemukannya? Saya memeriksa direktori dan cukup yakin sudah hilang.

source: The :command:`openstack flavor create` command allows authorized users to create new flavors. Additional flavor manipulation commands can be shown with the following command:
de: Der Befehl :command:`openstack flavor create` ermöglicht es autorisierten Benutzern, neue Varianten zu erstellen. Zusätzliche Befehle zur Manipulation von Varianten können mit dem folgenden Befehl angezeigt werden:
id: Perintah :command:`openstack flavour create` memungkinkan pengguna yang berwenang untuk membuat flavor baru. Perintah manipulasi flavor tambahan dapat ditunjukkan dengan perintah berikut:

source: The :command:`openstack image create` command provides a large set of options for working with your image. For example, the ``--min-disk`` option is useful for images that require root disks of a certain size (for example, large Windows images). To view these options, run:
de: Der Befehl :command:`openstack image create` bietet eine Vielzahl von Optionen für die Arbeit mit Ihrem Abbild. Die Option ``--min-disk`` ist beispielsweise nützlich für Abbilder, die Root-Disks einer bestimmten Größe erfordern (z.B. große Windows Abbilder). Um diese Optionen anzuzeigen, führen Sie aus:
id: Perintah :command:`openstack image create` menyediakan sejumlah besar opsi untuk bekerja dengan image Anda. Sebagai contoh, opsi ``--min-disk`` berguna untuk image yang membutuhkan disket root dengan ukuran tertentu (misalnya, image Windows besar). Untuk melihat opsi ini, jalankan:

source: The CSAIL cloud is currently 64 physical nodes with a total of 768 physical cores and 3,456 GB of RAM. Persistent data storage is largely outside the cloud on NFS, with cloud resources focused on compute resources. There are more than 130 users in more than 40 projects, typically running 2,000–2,500 vCPUs in 300 to 400 instances.
de: Die CSAIL-Cloud besteht derzeit aus 64 physikalischen Knoten mit insgesamt 768 physikalischen Kernen und 3.456 GB RAM. Persistente Datenspeicherung liegt auf NFS weitgehend außerhalb der Cloud, wobei sich die Cloud-Ressourcen auf Compute-Ressourcen konzentrieren. Es gibt mehr als 130 Benutzer in mehr als 40 Projekten, die typischerweise 2.000-2.500 vCPUs in 300 bis 400 Instanzen ausführen.
id: Cloud CSAIL saat ini adalah 64 node fisik dengan total 768 core fisik dan 3.456 GB RAM. Penyimpanan data yang persisten sebagian besar berada di luar cloud di NFS, dengan sumber daya cloud terfokus pada sumber daya komputasi. Ada lebih dari 130 pengguna di lebih dari 40 proyek, biasanya menjalankan 2.000–2.500 vCPU dalam 300 hingga 400 instance.

source: The I/O statistics of your storage services
de: Die I/O-Statistiken Ihrer Speicherdienste
id: Statistik I/O dari layanan penyimpanan Anda

source: The ID of the volume to boot from, as shown in the output of :command:`openstack volume list`
de: Die ID des Datenträgers, von dem gebootet werden soll, wie in der Ausgabe des Befehls :`openstack volume list` gezeigt

source: The Image service and the Database
de: Der Abbild-Dienst und die Datenbank
id: Layanan Image dan Basis Data

source: The Modular Layer 2 plug-in is a framework allowing OpenStack Networking to simultaneously utilize the variety of layer-2 networking technologies found in complex real-world data centers. It currently works with the existing Open vSwitch, Linux Bridge, and Hyper-V L2 agents and is intended to replace and deprecate the monolithic plug-ins associated with those L2 agents.
de: Das Modular Layer 2 Plug-in ist ein Framework, das es OpenStack Networking ermöglicht, die Vielfalt der Layer-2-Netzwerktechnologien in komplexen Rechenzentren gleichzeitig zu nutzen. Es arbeitet derzeit mit den bestehenden Open vSwitch-, Linux Bridge- und Hyper-V L2-Agenten und soll die monolithischen Plug-Ins dieser L2-Agenten ersetzen und verwerfen.
id: Plug-in Modular Layer 2 adalah kerangka kerja yang memungkinkan OpenStack Networking untuk secara simultan memanfaatkan berbagai teknologi jaringan layer-2 yang ditemukan di pusat data dunia nyata yang kompleks. Saat ini bekerja dengan agen Open vSwitch, Linux Bridge, dan Hyper-V L2 yang ada dan dimaksudkan untuk mengganti dan mencabut plug-in monolitik yang terkait dengan agen L2 tersebut.

source: The Open vSwitch driver should and usually does manage this automatically, but it is useful to know how to do this by hand with the :command:`ovs-vsctl` command. This command has many more subcommands than we will use here; see the man page or use :command:`ovs-vsctl --help` for the full listing.
de: Der Open vSwitch-Treiber sollte und wird dies in der Regel automatisch verwalten, aber es ist nützlich zu wissen, wie man dies von Hand mit dem Befehl :command:`ovs-vsctl` macht. Dieser Befehl hat viel mehr Unterbefehle, als wir hier verwenden werden; siehe man page oder verwenden Sie den Befehl :command:`ovs-vsctl --help` für die vollständige Liste.
id: Driver Open vSwitch harus dan biasanya mengelola ini secara otomatis, tetapi berguna untuk mengetahui bagaimana melakukan ini dengan tangan dengan perintah :command: `ovs-vsctl`. Perintah ini memiliki lebih banyak sub perintah daripada yang akan kita gunakan di sini; lihat halaman manual atau gunakan :command:`ovs-vsctl --help` untuk daftar lengkap.

source: The OpenStack Dashboard provides a graphical interface to manage users. This section describes user management with the Dashboard.
de: Das OpenStack Dashboard bietet eine grafische Oberfläche zur Verwaltung von Benutzern. Dieser Abschnitt beschreibt die Benutzerverwaltung mit dem Dashboard.
