Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: Grep for 0x<``provider:segmentation_id``>, 0x3 in this case, in the output of ``ovs-ofctl dump-flows br-tun``:
de: Grep für 0x<``provider:segmentation_id``>, 0x3 in diesem Fall, in der Ausgabe von ``ovs-ofctl dump-flows br-tun``:
id: Grep untuk 0x<`` provider: segmentation_id``>, 0x3 dalam hal ini, dalam output dari ``ovs-ofctl dump-flows br-tun``:

source: Grep for the ``provider:segmentation_id``, 2113 in this case, in the output of :command:`ovs-ofctl dump-flows br-int`:
de: Grep für den ``Provider:segmentation_id``, 2113 in diesem Fall, in der Ausgabe von :command:`ovs-ofctl dump-flows br-int`:
id: Grep untuk ``provider:segmentation_id``, 2113 dalam hal ini, dalam output dari :command:`ovs-ofctl dump-flows br-int`:

source: Guest security domains
de: Gastsicherheitsdomänen
id: Domain keamanan guest

source: Handling a Complete Failure
de: Behandlung eines kompletten Fehlers
id: Menangani Kegagalan Lengkap

source: Hardware Procurement
de: Hardware-Beschaffung
id: Pengadaan Perangkat Keras

source: Hardware does not have to be consistent, but it should at least have the same type of CPU to support instance migration.
de: Die Hardware muss nicht konsistent sein, aber sie sollte zumindest den gleichen CPU-Typ haben, um die Instanzmigration zu unterstützen.
id: Perangkat keras tidak harus konsisten, tetapi setidaknya harus memiliki jenis CPU yang sama untuk mendukung migrasi instance.

source: Hardware for compute nodes. Typically 256 or 144 GB memory, two processors, 24 cores. 4–6 TB direct attached storage, typically in a RAID 5 configuration.
de: Hardware für Compute-Knoten. Typischerweise 256 oder 144 GB Speicher, zwei Prozessoren, 24 Kerne. 4-6 TB direkt angeschlossener Speicher, typischerweise in einer RAID 5-Konfiguration.
id: Perangkat keras untuk komputasi node. Biasanya memori 256 atau 144 GB, dua prosesor, 24 core. Penyimpanan langsung terpasang 4–6 TB, biasanya dalam konfigurasi RAID 5.

source: Hardware for controller nodes, used for all stateless OpenStack API services. About 32–64 GB memory, small attached disk, one processor, varied number of cores, such as 6–12.
de: Hardware für Steuerungsknoten, die für alle zustandslosen OpenStack-API-Dienste verwendet wird. Etwa 32-64 GB Arbeitsspeicher, kleine angeschlossene Festplatte, ein Prozessor, unterschiedliche Anzahl von Kernen, wie z.B. 6-12.
id: Perangkat keras untuk node pengontrol, digunakan untuk semua layanan OpenStack API stateless. Tentang memori 32–64 GB, disk kecil yang terpasang, satu prosesor, jumlah core yang bervariasi, seperti 6-12.

source: Hardware for storage nodes. Typically for these, the disk space is optimized for the lowest cost per GB of storage while maintaining rack-space efficiency.
de: Hardware für Speicherknoten. Typischerweise ist der Festplattenspeicher für die niedrigsten Kosten pro GB Speicherplatz optimiert, während die Effizienz des Racks erhalten bleibt.
id: Perangkat keras untuk node penyimpanan. Biasanya untuk ini, ruang disk dioptimalkan untuk biaya terendah per GB penyimpanan sambil mempertahankan efisiensi ruang rak (rack-space).

source: He re-enabled the switch ports and the two compute nodes immediately came back to life.
de: Er aktivierte die Switch-Ports wieder und die beiden Compute-Knoten erwachten sofort zum Leben.
id: Dia mengaktifkan kembali port switch dan kedua node komputasi segera hidup kembali.

source: Health Insurance Portability and Accountability Act (HIPAA)
de: Krankenversicherungsgesetz (Health Insurance Portability and Accountability Act, HIPAA)

source: Here are snippets of the default nova ``policy.json`` file:
de: Hier sind Ausschnitte aus der Standarddatei nova ``policy.json``:

source: Here is an example error log:
de: Hier ist ein Beispiel für ein Fehlerprotokoll:
id: Berikut ini contoh log kesalahan:

source: Here is an example of a log message with the corresponding ERROR (Python traceback) immediately following:
de: Hier ist ein Beispiel für eine Logmeldung mit dem entsprechenden ERROR (Python-Traceback) unmittelbar danach:
id: Berikut adalah contoh dari pesan log dengan ERROR (Python traceback) yang sesuai segera berikut:

source: Here is an example using the ratios for gathering scalability information for the number of VMs expected as well as the storage needed. The following numbers support (200 / 2) × 16 = 1600 VM instances and require 80 TB of storage for ``/var/lib/nova/instances``:
de: Hier ist ein Beispiel anhand der Verhältnisse zur Erfassung von Skalierungsinformationen für die Anzahl der erwarteten VMs sowie den benötigten Speicherplatz. Die folgenden Zahlen unterstützen (200 / 2) × 16 = 1600 VM-Instanzen und benötigen 80 TB Speicherplatz für ``/var/lib/nova/instances``:
id: Berikut adalah contoh menggunakan rasio untuk mengumpulkan informasi skalabilitas untuk jumlah VM yang diharapkan serta penyimpanan yang dibutuhkan. Angka-angka berikut ini mendukung (200/2) × 16 = 1600 VM instance dan membutuhkan penyimpanan 80 TB untuk ``/var/lib/nova/instances``:

source: Here we can see that the request was denied because the remote IP address wasn't in the set of allowed IPs.
de: Hier sehen wir, dass die Anfrage abgelehnt wurde, weil die entfernte IP-Adresse nicht im Satz der erlaubten IPs enthalten war.
id: Di sini kita dapat melihat bahwa permintaan ditolak karena alamat IP jarak jauh tidak dalam set IP yang diizinkan.

source: Here you can see packets received on port ID 1 with the VLAN tag 2113 are modified to have the internal VLAN tag 7. Digging a little deeper, you can confirm that port 1 is in fact ``int-br-eth1``:
de: Hier sehen Sie, dass Pakete, die auf Port ID 1 mit dem VLAN-Tag 2113 empfangen wurden, so modifiziert werden, dass sie den internen VLAN-Tag 7 haben. Wenn Sie etwas tiefer graben, können Sie bestätigen, dass Port 1 tatsächlich ``int-br-eth1`` ist:
id: Di sini Anda dapat melihat paket yang diterima pada port ID 1 dengan tag VLAN 2113 dimodifikasi untuk memiliki tag VLAN internal 7. Menggali lebih dalam, Anda dapat mengonfirmasi bahwa port 1 sebenarnya ``int-br-eth1``:

source: Here's a quick list of various to-do items for each hour, day, week, month, and year. Please note that these tasks are neither required nor definitive but helpful ideas:
de: Hier ist eine kurze Liste der verschiedenen To-Do-Elemente für jede Stunde, jeden Tag, jede Woche, jeden Monat und jedes Jahr. Bitte beachten Sie, dass es sich bei diesen Aufgaben weder um erforderliche noch um endgültige, sondern um hilfreiche Ideen handelt:
id: Berikut adalah daftar singkat berbagai hal yang harus dilakukan untuk setiap jam, hari, minggu, bulan, dan tahun. Harap perhatikan bahwa tugas-tugas ini tidak diperlukan atau ide yang pasti tetapi membantu:

source: Here, the ID associated with the instance is ``faf7ded8-4a46-413b-b113-f19590746ffe``. If you search for this string on the cloud controller in the ``/var/log/nova-*.log`` files, it appears in ``nova-api.log`` and ``nova-scheduler.log``. If you search for this on the compute nodes in ``/var/log/nova-*.log``, it appears in ``nova-compute.log``. If no ERROR or CRITICAL messages appear, the most recent log entry that reports this may provide a hint about what has gone wrong.
de: Hier lautet die der Instanz zugeordnete ID ``faf7ded8-4a46-413b-b113-f19590746ffe``. Wenn Sie nach dieser Zeichenkette auf dem Cloud-Controller in den Dateien ``/var/log/nova-*.log`` suchen, erscheint sie in `nova-api.log`` und `nova-scheduler.log``. Wenn Sie dies auf den Compute-Knoten in ``/var/log/nova-*.log`` suchen, erscheint es in ``nova-compute.log``. Wenn keine ERROR oder CRITICAL Meldungen angezeigt werden, kann der letzte Protokolleintrag, der dies meldet, einen Hinweis darauf geben, was falsch gelaufen ist.
id: Di sini, ID yang terkait dengan instance adalah ``faf7ded8-4a46-413b-b113-f19590746ffe``. Jika Anda mencari string ini pada pengontrol cloud di file ``/var/log/nova-*.log``, muncul di ``nova-api.log`` dan `` nova-scheduler.log`` . Jika Anda mencari ini di compute nodes di ``/var/log/nova-*.log``, muncul di ``nova-compute.log``. Jika tidak ada pesan ERROR atau CRITICAL yang muncul, entri log terbaru yang melaporkan ini dapat memberikan petunjuk tentang apa yang salah.

source: Here, the external server received the ping request and sent a ping reply. On the compute node, you can see that both the ping and ping reply successfully passed through. You might also see duplicate packets on the compute node, as seen above, because ``tcpdump`` captured the packet on both the bridge and outgoing interface.
de: Hier hat der externe Server die Ping-Anfrage empfangen und eine Ping-Antwort gesendet. Auf dem Compute-Knoten sehen Sie, dass sowohl die Ping- als auch die Ping-Antwort erfolgreich durchlaufen wurden. Möglicherweise sehen Sie auch doppelte Pakete auf dem Compute-Knoten, wie oben beschrieben, weil ``tcpdump`` das Paket sowohl auf der Bridge als auch auf der ausgehenden Schnittstelle erfasst hat.
id: Di sini, server eksternal menerima permintaan ping dan mengirim balasan ping. Pada node komputasi, Anda dapat melihat bahwa ping dan balasan ping berhasil dilewati. Anda mungkin juga melihat paket duplikat pada node komputasi, seperti yang terlihat di atas, karena ``tcpdump`` menangkap paket di kedua jembatan dan antarmuka keluar.

source: Here, two floating IPs are available. The first has been allocated to a project, while the other is unallocated.
de: Hier stehen zwei Floating IPs zur Verfügung. Der erste wurde einem Projekt zugeordnet, während der andere nicht zugeordnet ist.
id: Di sini, dua IP mengambang tersedia. Yang pertama telah dialokasikan untuk proyek, sementara yang lain tidak dialokasikan.

source: Here, you see three flows related to this GRE tunnel. The first is the translation from inbound packets with this tunnel ID to internal VLAN ID 1. The second shows a unicast flow to output port 53 for packets destined for MAC address fa:16:3e:a6:48:24. The third shows the translation from the internal VLAN representation to the GRE tunnel ID flooded to all output ports. For further details of the flow descriptions, see the man page for ``ovs-ofctl``. As in the previous VLAN example, numeric port IDs can be matched with their named representations by examining the output of ``ovs-ofctl show br-tun``.
de: Hier sehen Sie drei Strömungen, die sich auf diesen GRE-Tunnel beziehen. Die erste ist die Übersetzung von eingehenden Paketen mit dieser Tunnel-ID in die interne VLAN-ID 1. Die zweite zeigt einen Unicastfluss zum Ausgabeport 53 für Pakete, die für die MAC-Adresse fa:16:3e:a6:48:24 bestimmt sind. Die dritte zeigt die Übersetzung von der internen VLAN-Darstellung in die GRE-Tunnel-ID, die an allen Ausgangsports geflutet wird. Weitere Details zu den Ablaufbeschreibungen finden Sie in der Man Page für ``ovs-ofctl``. Wie im vorherigen VLAN-Beispiel können numerische Port-IDs mit ihren benannten Darstellungen verglichen werden, indem man die Ausgabe von `ovs-ofctl show br-tun`` untersucht.
id: Di sini, Anda melihat tiga aliran yang terkait dengan terowongan GRE ini. Yang pertama adalah aliran terjemahan dari paket inbound dengan ID terowongan ini ke ID VLAN internal 1. Yang kedua menunjukkan aliran unicast ke port output 53 untuk paket yang ditujukan untuk alamat MAC fa:16:3e:a6:48:24. Yang ketiga menunjukkan aliran terjemahan dari representasi VLAN internal ke terowongan GRE yang ID dibanjiri ke semua port output. Untuk detail lebih lanjut dari deskripsi aliran, lihat halaman manual untuk ``ovs-ofctl``. Seperti pada contoh VLAN sebelumnya, ID port numerik dapat dicocokkan dengan representasi namanya dengan memeriksa output ``ovs-ofctl show br-tun``.

source: Herein lies a selection of tales from OpenStack cloud operators. Read, and learn from their wisdom.
de: Hier finden Sie eine Auswahl von Geschichten von OpenStack-Cloud-Betreibern. Lies und lerne aus ihrer Weisheit.
id: Di sinilah letak berbagai kisah dari operator cloud OpenStack. Baca, dan belajarlah dari kebijaksanaan mereka.

source: High Availability
de: Hochverfügbarkeit
id: Ketersediaan Tinggi

source: Host aggregates
de: Host-Aggregate

source: Host aggregates and instance-type extra specs are used to provide two different resource allocation ratios. The default resource allocation ratios we use are 4:1 CPU and 1.5:1 RAM. Compute-intensive workloads use instance types that require non-oversubscribed hosts where ``cpu_ratio`` and ``ram_ratio`` are both set to 1.0. Since we have hyper-threading enabled on our compute nodes, this provides one vCPU per CPU thread, or two vCPUs per physical core.
de: Host-Aggregate und instanzartige Extra-Spezifikationen werden verwendet, um zwei verschiedene Ressourcenzuweisungsverhältnisse bereitzustellen. Die von uns verwendeten Standardverhältnisse für die Ressourcenzuweisung sind 4:1 CPU und 1,5:1 RAM. Rechenintensive Workloads verwenden Instanztypen, die nicht überverkaufte Hosts erfordern, bei denen ``cpu_ratio`` und ``ram_ratio`` beide auf 1,0 gesetzt sind. Da wir Hyper-Threading auf unseren Compute-Knoten aktiviert haben, erhalten Sie eine vCPU pro CPU-Thread oder zwei vCPUs pro physischem Kern.
id: Agregat host dan spesifikasi tambahan tipe instanace digunakan untuk menyediakan dua rasio alokasi sumber daya yang berbeda. Rasio alokasi sumber daya default yang kami gunakan adalah 4:1 CPU dan 1.5:1 RAM. Beban kerja intensif-komputasi menggunakan tipe instance yang memerlukan non-oversubscribed host dimana ``cpu_ratio`` dan ``ram_ratio`` keduanya diatur ke 1.0. Karena kami memiliki hyper-threading yang diaktifkan pada node komputasi kami, ini menyediakan satu vCPU per utas CPU, atau dua vCPU per core fisik.

source: Host aggregates zone
de: Host-Aggregate Zone
id: Zona agregat host

source: Hourly
de: Stündlich
id: Per jam

source: How Do I Modify an Existing Flavor?
de: Wie modifiziere ich eine bestehende Variante?
id: Bagaimana Saya Memodifikasi Flavor yang Ada?

source: How This Book Is Organized
de: Wie dieses Buch organisiert ist

source: How many backups to keep?
de: Wie viele Backups müssen aufbewahrt werden?
id: Berapa banyak cadangan yang harus disimpan?

source: How much storage is required ``(flavor disk size × number of instances)``
de: Wie viel Speicherplatz wird benötigt ``(Flavor Disk Size × Number of Instances)``
id: Berapa banyak penyimpanan yang dibutuhkan ``(flavor disk size × number of instances)``

source: How networks attach to hypervisors can expose security vulnerabilities. To mitigate hypervisor breakouts, separate networks from other systems and schedule instances for the network onto dedicated Compute nodes. This prevents attackers from having access to the networks from a compromised instance.
de: Wie Netzwerke an Hypervisoren anbinden, kann Sicherheitsschwachstellen aufdecken. Um Hypervisor-Ausbrüche zu minimieren, trennen Sie Netzwerke von anderen Systemen und planen Sie Instanzen für das Netzwerk auf dedizierten Compute-Knoten. Dadurch wird verhindert, dass Angreifer von einer kompromittierten Instanz aus Zugriff auf die Netzwerke haben.
id: Bagaimana jaringan dilampirkan ke hypervisor dapat mengekspos kerentanan keamanan. Untuk mengurangi gangguan hypervisor, pisahkan jaringan dari sistem lain dan jadwalkan instance untuk jaringan ke node Compute khusus. Ini mencegah penyerang memiliki akses ke jaringan dari instance yang dikompromikan.

source: How often should backups be tested?
de: Wie oft sollten Backups getestet werden?
id: Seberapa sering cadangan harus diuji?

source: How to Contribute to This Book
de: Wie man zu diesem Buch beiträgt

source: However, hardware choice is important for many applications, so if that applies to you, consider that there are several software distributions available that you can run on servers, storage, and network products of your choosing. Canonical (where OpenStack replaced Eucalyptus as the default cloud option in 2011), Red Hat, and SUSE offer enterprise OpenStack solutions and support. You may also want to take a look at some of the specialized distributions, such as those from Rackspace, Piston, SwiftStack, or Cloudscaling.
de: Die Hardware-Auswahl ist jedoch für viele Anwendungen wichtig, wenn das auf Sie zutrifft, sollten Sie bedenken, dass es mehrere Software-Distributionen gibt, die Sie auf Servern, Speichern und Netzwerkprodukten Ihrer Wahl ausführen können. Canonical (wo OpenStack Eucalyptus als Standard-Cloud-Option im Jahr 2011 ersetzt hat), Red Hat und SUSE bieten OpenStack-Lösungen und -Support für Unternehmen. Sie können auch einen Blick auf einige der spezialisierten Distributionen werfen, wie beispielsweise die von Rackspace, Piston, SwiftStack oder Cloudscaling.

source: However, that is not to say that it needs to be the same size or use identical hardware as the production environment. It is important to consider the hardware and scale of the cloud that you are upgrading. The following tips can help you minimise the cost:
de: Das heißt jedoch nicht, dass sie die gleiche Größe haben oder identische Hardware wie die Produktionsumgebung verwenden muss. Es ist wichtig, die Hardware und den Umfang der Cloud zu berücksichtigen, die Sie aktualisieren. Die folgenden Tipps können Ihnen helfen, die Kosten zu minimieren:
id: Namun, itu tidak berarti bahwa ukurannya harus sama atau menggunakan perangkat keras yang identik dengan lingkungan produksi. Penting untuk mempertimbangkan perangkat keras dan skala cloud yang sedang Anda upgrade. Kiat-kiat berikut dapat membantu Anda meminimalkan biaya:

source: However, the enticing part of OpenStack might be to build your own private cloud, and there are several ways to accomplish this goal. Perhaps the simplest of all is an appliance-style solution. You purchase an appliance, unpack it, plug in the power and the network, and watch it transform into an OpenStack cloud with minimal additional configuration.
de: Der verlockende Teil von OpenStack könnte jedoch darin bestehen, eine eigene private Cloud aufzubauen, und es gibt mehrere Möglichkeiten, dieses Ziel zu erreichen. Die vielleicht einfachste von allen ist eine Lösung im Appliance-Stil. Sie kaufen eine Appliance, entpacken sie, schließen den Strom und das Netzwerk an und beobachten, wie sie sich mit minimaler zusätzlicher Konfiguration in eine OpenStack-Cloud verwandelt.

source: However, this guide has a different audience—those seeking flexibility from the OpenStack framework by deploying do-it-yourself solutions.
de: Dieser Leitfaden hat jedoch ein anderes Publikum, das nach Flexibilität aus dem OpenStack-Framework sucht, indem es Do-it-yourself-Lösungen einsetzt.

source: However, you need more than the core count alone to estimate the load that the API services, database servers, and queue servers are likely to encounter. You must also consider the usage patterns of your cloud.
de: Sie benötigen jedoch mehr als nur die Kernzahl, um die Belastung abzuschätzen, der die API-Dienste, Datenbankserver und Queue-Server wahrscheinlich ausgesetzt sind. Sie müssen auch das Nutzungsverhalten Ihrer Cloud berücksichtigen.
id: Namun, Anda membutuhkan lebih dari jumlah core saja untuk memperkirakan beban yang mungkin dihadapi oleh layanan API, server database, dan server antrian. Anda juga harus mempertimbangkan pola penggunaan cloud Anda.

source: Hypervisor security
de: Hypervisor-Sicherheit
id: Keamanan hypervisor

source: Hypervisor security is not an issue if the security of instances is not important. However, enterprises can minimize vulnerability by avoiding hardware sharing with others in a public cloud.
de: Hypervisor-Sicherheit ist kein Thema, wenn die Sicherheit von Instanzen nicht wichtig ist. Unternehmen können jedoch die Schwachstelle minimieren, indem sie die gemeinsame Nutzung von Hardware mit anderen in einer Public Cloud vermeiden.
id: Keamanan hypervisor bukan masalah jika keamanan instance tidak penting. Namun, perusahaan dapat meminimalkan kerentanan dengan menghindari berbagi perangkat keras dengan orang lain di cloud publik.

source: I checked Glance and noticed that this image was a snapshot that the user created. At least that was good news—this user would have been the only user affected.
de: Ich überprüfte Glance und bemerkte, dass dieses Abbild eine Schattenkopie war, die der Benutzer erstellt hatte. Zumindest das waren gute Nachrichten - dieser Benutzer wäre der einzige betroffene Benutzer gewesen.
id: Saya memeriksa Glance dan memperhatikan bahwa image ini adalah snapshot yang dibuat pengguna. Setidaknya itu adalah kabar baik — pengguna ini akan menjadi satu-satunya pengguna yang terpengaruh.

source: I just upgraded OpenStack from Grizzly to Havana 2013.2-2 using the RDO repository and everything was running pretty well—except the EC2 API.
de: Ich habe gerade OpenStack von Grizzly auf Havana 2013.2-2 mit dem RDO-Repository aktualisiert und alles lief ziemlich gut, außer der EC2-API.
id: Saya baru saja memutakhirkan OpenStack dari Grizzly ke Havana 2013.2-2 menggunakan repositori RDO dan semuanya berjalan cukup baik — kecuali EC2 API.

source: I logged into the cloud controller and was able to both ``ping`` and SSH into the problematic compute node which seemed very odd. Usually if I receive this type of alert, the compute node has totally locked up and would be inaccessible.
de: Ich habe mich in den Cloud-Controller eingeloggt und konnte sowohl ``ping`` als auch SSH in den problematischen Compute-Knoten einbinden, was sehr seltsam erschien. Normalerweise, wenn ich diese Art von Warnung erhalte, hat sich der Compute-Knoten vollständig blockiert und wäre unzugänglich.
id: Saya masuk ke cloud controller dan bisa ``ping`` dan SSH ke node komputasi bermasalah yang tampak sangat aneh. Biasanya jika saya menerima jenis peringatan ini, node komputasi telah benar-benar terkunci dan tidak dapat diakses.

source: I looked at the status of both NICs in the bonded pair and saw that neither was able to communicate with the switch port. Seeing as how each NIC in the bond is connected to a separate switch, I thought that the chance of a switch port dying on each switch at the same time was quite improbable. I concluded that the 10gb dual port NIC had died and needed replaced. I created a ticket for the hardware support department at the data center where the node was hosted. I felt lucky that this was a new node and no one else was hosted on it yet.
de: Ich betrachtete den Status der beiden NICs im gebundenen Paar und sah, dass keiner von beiden in der Lage war, mit dem Switch-Port zu kommunizieren. Als ich sah, wie jedes NIC in der Verbindung mit einem separaten Switch verbunden ist, dachte ich, dass die Chance, dass ein Switch-Port gleichzeitig an jedem Switch stirbt, ziemlich unwahrscheinlich war. Ich kam zu dem Schluss, dass das 10gb Dual-Port NIC gestorben war und ersetzt werden musste. Ich habe ein Ticket für die Hardware-Supportabteilung im Rechenzentrum erstellt, in dem der Knoten gehostet wurde. Ich hatte das Glück, dass dies ein neuer Knoten war und niemand sonst auf ihm gehostet wurde.
id: Saya melihat status kedua NIC pada pasangan terikat dan melihat bahwa tidak ada yang dapat berkomunikasi dengan port switch. Melihat bagaimana masing-masing NIC dalam ikatan terhubung ke switch terpisah, saya berpikir bahwa peluang port switch mati pada setiap switch pada saat yang sama cukup mustahil. Saya menyimpulkan bahwa port ganda 10GB NIC telah mati dan perlu diganti. Saya membuat tiket untuk departemen dukungan perangkat keras di pusat data tempat node di-host. Saya merasa beruntung bahwa ini adalah node baru dan belum ada orang lain yang meng-host-nya.
