Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: Network troubleshooting can be challenging. A network issue may cause problems at any point in the cloud. Using a logical troubleshooting procedure can help mitigate the issue and isolate where the network issue is. This chapter aims to give you the information you need to identify any issues for ``nova-network`` or OpenStack Networking (neutron) with Linux Bridge or Open vSwitch.
de: Die Fehlerbehebung im Netzwerk kann eine Herausforderung darstellen. Ein Netzwerkproblem kann an jeder Stelle in der Cloud zu Problemen führen. Die Verwendung einer logischen Fehlerbehebungsmethode kann helfen, das Problem zu mildern und zu isolieren, wo sich das Netzwerkproblem befindet. Dieses Kapitel soll Ihnen die Informationen geben, die Sie benötigen, um Probleme mit ``nova-network`` oder OpenStack Networking (neutron) mit Linux Bridge oder Open vSwitch zu identifizieren.
id: Pemecahan masalah jaringan bisa jadi menantang. Masalah jaringan dapat menyebabkan masalah kapan saja di cloud. Menggunakan prosedur pemecahan masalah logis dapat membantu mengurangi masalah dan mengisolasi di mana masalah jaringan berada. Bab ini bertujuan untuk memberi Anda informasi yang Anda butuhkan untuk mengidentifikasi masalah apa pun untuk ``nova-network`` atau OpenStack Networking (neutron) dengan Linux Bridge atau Open vSwitch.

source: Network usage (bandwidth and IP usage)
de: Netzwerknutzung (Bandbreite und IP-Nutzung)
id: Penggunaan jaringan (bandwidth dan penggunaan IP)

source: Networking
de: Netzwerk
id: Networking (jaringan)

source: Networking configuration just for PXE booting
de: Netzwerkkonfiguration nur für das PXE-Booten
id: Konfigurasi jaringan hanya untuk boot PXE

source: Networking security
de: Netzwerksicherheit
id: Keamanan jaringan

source: Networking service
de: Netzwerkdienst (neutron)
id: Layanan Networking

source: Networking service - Edit the configuration file and restart the service.
de: Netzwerkdienst - Bearbeiten Sie die Konfigurationsdatei und starten Sie den Dienst neu.
id: Layanan Networking - Edit file konfigurasi dan restart layanan.

source: Networking service is used by the Shared File Systems service to directly operate with share servers. For switching interaction with Networking service on, create a share specifying a share network. To use "share servers" mode even being out of OpenStack, a network plugin called StandaloneNetworkPlugin is used. In this case, provide network information in the configuration: IP range, network type, and segmentation ID. Also you can add security services to a share network (see section `“Networking” <https://docs.openstack.org/manila/latest/admin/shared-file-systems-networking.html>`__ in OpenStack Manila Administrator Guide).
de: Der Netzwerkdienst wird vom Dienst Shared File Systems verwendet, um direkt mit Share-Servern zu arbeiten. Um die Interaktion mit dem Networking-Dienst einzuschalten, erstellen Sie eine Freigabe, die ein Freigabenetzwerk angibt. Um den Modus "Share Server" auch außerhalb von OpenStack nutzen zu können, wird ein Netzwerk-Plugin namens StandaloneNetworkPlugin verwendet. Geben Sie in diesem Fall in der Konfiguration Netzwerkinformationen an: IP-Bereich, Netzwerktyp und Segmentierungs-ID. Sie können auch Sicherheitsdienste zu einem Freigabennetzwerk hinzufügen (siehe Abschnitt `"Networking" <https://docs.openstack.org/manila/latest/admin/shared-file-systems-networking.html>`__ im OpenStack Manila Administrator Guide).

source: New API Versions
de: Neue API-Versionen
id: Versi API Baru

source: Next, create ``/etc/rsyslog.d/client.conf`` with the following line:
de: Als nächstes erstellen Sie ``/etc/rsyslog.d/client.conf`` mit der folgenden Zeile:
id: Selanjutnya, buat ``/etc/rsyslog.d/client.conf`` dengan baris berikut:

source: Next, find the fixed IP entry for that UUID:
de: Suchen Sie nun den festen IP-Eintrag für diese UUID:
id: Selanjutnya, cari entri IP tetap untuk UUID itu:

source: Next, manually detach and reattach the volumes, where X is the proper mount point:
de: Als nächstes müssen Sie die Volumes manuell trennen und wieder anhängen, wobei X der richtige Einhängepunkt ist:
id: Selanjutnya, lepaskan dan pasang kembali volume secara manual, di mana X adalah titik pemasangan yang tepat:

source: Next, open a new shell to the instance and then ping the external host where ``tcpdump`` is running. If the network path to the external server and back is fully functional, you see something like the following:
de: Als nächstes öffnen Sie eine neue Shell für die Instanz und pingen dann den externen Host, auf dem ``tcpdump`` läuft. Wenn der Netzwerkpfad zum externen Server und zurück voll funktionsfähig ist, sehen Sie so etwas wie das Folgende:
id: Selanjutnya, buka shell baru ke instance dan kemudian ping host eksternal di mana ``tcpdump`` sedang berjalan. Jika jalur jaringan ke server eksternal dan kembali berfungsi penuh, Anda melihat sesuatu seperti berikut:

source: Next, physically remove the disk from the server and replace it with a working disk.
de: Als Nächstes, entfernen SIe die Platte aus dem Server und ersetzen sie sie durch eine funktionierende.
id: Selanjutnya, secara fisik menghapus disk dari server dan menggantinya dengan disk yang berfungsi.

source: Next, redistribute the ring files to the other nodes:
de: Als Nächstes, verteilen Sie die Ring Dateien zu den anderen Nodes neu:
id: Selanjutnya, mendistribusikan kembali file ring ke node lain:

source: Next, the ``libvirtd`` daemon was run on the command line. Finally a helpful error message: it could not connect to d-bus. As ridiculous as it sounds, libvirt, and thus ``nova-compute``, relies on d-bus and somehow d-bus crashed. Simply starting d-bus set the entire chain back on track, and soon everything was back up and running.
de: Als nächstes wurde der Daemon ``libvirtd`` auf der Kommandozeile ausgeführt. Schließlich eine hilfreiche Fehlermeldung: Es konnte keine Verbindung zum D-Bus hergestellt werden. So lächerlich es auch klingen mag, libvirt und damit ``nova-compute``, verlässt sich auf d-bus und ist irgendwie d-bus abgestürzt. Durch den einfachen Start des D-Bus wurde die gesamte Kette wieder auf Kurs gebracht, und schon bald war alles wieder einsatzbereit.
id: Selanjutnya, daemon ``libvirtd`` dijalankan pada command line. Akhirnya muncul pesan kesalahan yang bermanfaat: tidak dapat terhubung ke d-bus. Kedengarannya konyol, libvirt, dan karenanya ``nova-compute``, bergantung pada d-bus dan entah bagaimana d-bus jatuh. Cukup memulai d-bus, atur seluruh rantai kembali ke jalurnya, dan segera semuanya kembali dan berjalan.

source: Next, the ``nova`` database contains three tables that store usage information.
de: Als nächstes enthält die ``nova``-Datenbank drei Tabellen, die Nutzungsinformationen speichern.
id: Selanjutnya, database ``nova`` berisi tiga tabel yang menyimpan informasi penggunaan.

source: Next, the internal bridge, ``br-int``, contains ``int-eth1-br``, which pairs with ``phy-eth1-br`` to connect to the physical network shown in the previous bridge, ``patch-tun``, which is used to connect to the GRE tunnel bridge and the TAP devices that connect to the instances currently running on the system:
de: Als nächstes enthält die interne Brücke, `br-int``, `int-eth1-br``, die sich mit ``phy-eth1-br`` paart, um sich mit dem physikalischen Netzwerk zu verbinden, das in der vorherigen Brücke gezeigt wird, `Patch-Tun``, das verwendet wird, um sich mit der GRE-Tunnelbrücke und den TAP-Geräten zu verbinden, die sich mit den derzeit auf dem System laufenden Instanzen verbinden:
id: Selanjutnya, jembatan internal, ``br-int``, berisi ``int-eth1-br``, yang berpasangan dengan ``phy-eth1-br`` untuk menyambung ke jaringan fisik yang ditunjukkan pada jembatan sebelumnya, ``patch-tun``, yang digunakan untuk menghubungkan ke jembatan terowongan GRE dan perangkat TAP yang terhubung ke instance yang sedang berjalan pada sistem:

source: Next, the packets from either input go through the integration bridge, again just as on the compute node.
de: Anschließend durchlaufen die Pakete von beiden Eingaben die Integrationsbrücke, wiederum genau wie auf dem Compute-Knoten.
id: Selanjutnya, paket-paket dari salah satu input masuk melalui jembatan integrasi, lagi seperti pada node komputasi.

source: Next, update the nova database to indicate that all instances that used to be hosted on c01.example.com are now hosted on c02.example.com:
de: Aktualisieren Sie anschließend die nova-Datenbank, um anzuzeigen, dass alle Instanzen, die bisher auf c01.example.com gehostet wurden, nun auf c02.example.com gehostet werden:
id: Selanjutnya, perbarui database nova untuk menunjukkan bahwa semua instance yang dulu di-host di c01.example.com sekarang di-host di c02.example.com:

source: Node type
de: Knotentyp

source: Not all packets have a size of 1500. Running the :command:`ls` command over SSH might only create a single packets less than 1500 bytes. However, running a command with heavy output, such as :command:`ps aux` requires several packets of 1500 bytes.
de: Nicht alle Pakete haben eine Größe von 1500. Die Ausführung des Befehls :command:`ls` über SSH kann dazu führen, dass nur einzelne Pakete mit weniger als 1500 Bytes erstellt werden. Um jedoch einen Befehl mit starker Ausgabe auszuführen, wie z.B. :command:`ps aux`, sind mehrere Pakete von 1500 Bytes erforderlich.
id: Tidak semua paket memiliki ukuran 1500. Menjalankan perintah :command:`ls` di atas SSH mungkin hanya membuat paket tunggal kurang dari 1500 byte. Namun, menjalankan perintah dengan output yang berat, seperti :command:`ps aux` membutuhkan beberapa paket 1500 byte.

source: Not entirely network specific, but it contains information about the instance that is utilizing the ``fixed_ip`` and optional ``floating_ip``.
de: Nicht ganz netzwerkspezifisch, aber es enthält Informationen über die Instanz, die das ``fixed_ip`` und optional ``floating_ip`` verwendet.
id: Tidak sepenuhnya spesifik jaringan, tetapi berisi informasi tentang instance yang menggunakan ``fixed_ip`` dan opsional ``floating_ip``.

source: Now try the command from Step 10 again and it succeeds. There are no objects in the container, so there is nothing to list; however, there is also no error to report.
de: Versuchen Sie nun den Befehl aus Schritt 10 erneut und er ist erfolgreich. Es gibt keine Objekte im Container, also gibt es nichts aufzulisten, aber es gibt auch keinen Fehler zu melden.
id: Sekarang coba perintah dari Langkah 10 lagi dan berhasil. Tidak ada benda di dalam kontainer, jadi tidak ada yang perlu didaftar; Namun, tidak ada kesalahan untuk dilaporkan.

source: Now you can import a previously backed-up database:
de: Jetzt können Sie eine zuvor gesicherte Datenbank importieren:
id: Sekarang Anda dapat mengimpor basis data yang dicadangkan sebelumnya:

source: Now you can refer to your token on the command line as ``$TOKEN``.
de: Nun können Sie Ihr Token auf der Kommandozeile als ``$TOKEN`` bezeichnen.
id: Sekarang Anda dapat merujuk token Anda pada command line sebagai ``$TOKEN``.

source: Number of Block Storage snapshots allowed per tenant.
de: Anzahl der erlaubten Blockspeicher-Schattenkopien pro Mandant.
id: Jumlah snapshot Block Storage diizinkan per tenant.

source: Number of Block Storage volumes allowed per tenant
de: Anzahl der zulässigen Blockspeicher-Datenträger pro Mandant
id: Jumlah volume Block Storage yang diizinkan per tenant

source: Number of bytes allowed per injected file path.
de: Anzahl der zulässigen Bytes pro injiziertem Dateipfad.
id: Jumlah byte yang diizinkan per jalur file yang disuntikkan.

source: Number of content bytes allowed per injected file.
de: Anzahl der zulässigen Inhaltsbytes pro injizierter Datei.
id: Jumlah byte konten yang diizinkan per file yang disuntikkan.

source: Number of fixed IP addresses allowed per project. This number must be equal to or greater than the number of allowed instances.
de: Anzahl der pro Projekt zulässigen festen IP-Adressen. Diese Zahl muss gleich oder größer sein als die Anzahl der erlaubten Instanzen.
id: Jumlah alamat IP tetap yang diizinkan per proyek. Jumlah ini harus sama dengan atau lebih besar dari jumlah instance yang diizinkan.

source: Number of floating IP addresses allowed per project.
de: Anzahl der zulässigen freien IP-Adressen pro Projekt.
id: Jumlah alamat IP mengambang yang diizinkan per proyek.

source: Number of injected files allowed per project.
de: Anzahl der injizierten Dateien, die pro Projekt erlaubt sind.
id: Jumlah file yang disuntikkan diizinkan per proyek.

source: Number of instance cores allowed per project.
de: Anzahl der pro Projekt zulässigen Instanzkerne.
id: Jumlah core instance yang diizinkan per proyek.

source: Number of instances allowed per project.
de: Anzahl der erlaubten Instanzen pro Projekt.
id: Jumlah instance yang diizinkan per proyek.

source: Number of key pairs allowed per user.
de: Anzahl der zulässigen Schlüsselpaare pro Benutzer.
id: Jumlah pasangan kunci yang diizinkan per pengguna.

source: Number of metadata items allowed per instance.
de: Anzahl der zulässigen Metadatenelemente pro Instanz.
id: Jumlah item metadata diizinkan per instance.

source: Number of security group rules per project.
de: Anzahl der Sicherheitsgruppenregeln pro Projekt.
id: Jumlah aturan grup keamanan per proyek.

source: Number of security groups per project.
de: Anzahl der Sicherheitsgruppen pro Projekt.
id: Jumlah grup keamanan per proyek.

source: Number of server groups per project.
de: Anzahl der Servergruppen pro Projekt.
id: Jumlah grup server per proyek.

source: Number of servers per server group.
de: Anzahl der Server pro Servergruppe.
id: Jumlah server per grup server.

source: Number of virtual CPUs presented to the instance.
de: Anzahl der virtuellen CPUs, die der Instanz präsentiert werden.
id: Jumlah CPU virtual disajikan ke instance.

source: Number of volume gigabytes allowed per tenant
de: Anzahl der zulässigen Datenträger-Gigabyte pro Mandant
id: Jumlah gigabyte volume yang diizinkan per tenant

source: OK, so where is the MTU issue coming from? Why haven't we seen this in any other deployment? What's new in this situation? Well, new data center, new uplink, new switches, new model of switches, new servers, first time using this model of servers… so, basically everything was new. Wonderful. We toyed around with raising the MTU at various areas: the switches, the NICs on the compute nodes, the virtual NICs in the instances, we even had the data center raise the MTU for our uplink interface. Some changes worked, some didn't. This line of troubleshooting didn't feel right, though. We shouldn't have to be changing the MTU in these areas.
de: OK, woher kommt also die MTU-Problematik? Warum haben wir das bei keinem anderen Einsatz gesehen? Was ist in dieser Situation neu? Nun, neues Rechenzentrum, neuer Uplink, neue Switches, neues Switch-Modell, neue Server, erstes Mal mit diesem Server-Modell.... also war im Grunde alles neu. Wunderbar. Wir haben mit der Erhöhung der MTU an verschiedenen Stellen herumgespielt: die Switches, die NICs auf den Compute-Knoten, die virtuellen NICs in den Instanzen, wir haben sogar das Rechenzentrum die MTU für unsere Uplink-Schnittstelle anheben lassen. Einige Änderungen funktionierten, andere nicht. Diese Art der Fehlersuche fühlte sich jedoch nicht richtig an. Wir sollten in diesen Bereichen nicht die MTU wechseln müssen.
id: Oke, jadi dari mana datangnya masalah MTU? Mengapa kami belum melihat ini di penyebaran lain? Apa yang baru dalam situasi ini? Nah, pusat data baru, uplink baru, switch baru, model switch baru, server baru, pertama kali menggunakan model server ini ... jadi, pada dasarnya semuanya baru. Hebat. Kami bermain-main dengan menaikkan MTU di berbagai bidang: sakelar, NIC pada node komputasi, NIC virtual dalam instance, kami bahkan meminta pusat data menaikkan MTU untuk antarmuka uplink kami. Beberapa perubahan berhasil, beberapa tidak. Baris pemecahan masalah (line of troubleshooting) ini rasanya tidak benar. Kita tidak harus mengubah MTU di area ini.

source: Object Storage
de: Objekt Speicher

source: Obtain the UUID of the image:
de: Erhalten Sie die UUID des Abbildes:
id: Dapatkan UUID image:

source: Obtain the UUID of the project with which you want to share your image, let's call it target project. Unfortunately, non-admin users are unable to use the :command:`openstack` command to do this. The easiest solution is to obtain the UUID either from an administrator of the cloud or from a user located in the target project.
de: Erhalten Sie die UUID des Projekts, für das Sie Ihr Abbild freigeben möchten, nennen wir es Zielprojekt. Leider können Nichtadministratoren den Befehl :command:`openstack` nicht verwenden, um dies zu tun. Die einfachste Lösung besteht darin, die UUID entweder von einem Administrator der Cloud oder von einem Benutzer im Zielprojekt zu erhalten.
id: Dapatkan UUID proyek yang ingin Anda bagikan image Anda, sebut saja proyek target. Sayangnya, pengguna non-admin tidak dapat menggunakan perintah :command:`openstack` untuk melakukan ini. Solusi termudah adalah mendapatkan UUID baik dari administrator cloud atau dari pengguna yang berada di proyek target.

source: Obtain the tenant ID, as follows:
de: Ermitteln Sie die Mandanten-ID wie folgt:
id: Dapatkan ID tenant, sebagai berikut:

source: Obtaining consistent snapshots of Windows VMs is conceptually similar to obtaining consistent snapshots of Linux VMs, although it requires additional utilities to coordinate with a Windows-only subsystem designed to facilitate consistent backups.
de: Das Erhalten konsistenter Schattenkopien von Windows-VMs ist konzeptionell ähnlich wie das Erhalten konsistenter Schattenkopien von Linux-VMs, obwohl es zusätzliche Dienstprogramme erfordert, um mit einem reinen Windows-Subsystem zu koordinieren, das für konsistente Backups ausgelegt ist.

source: Oisin Feeley read it, made some edits, and provided emailed feedback right when we asked.
de: Oisin Feeley hat es gelesen, einige Änderungen vorgenommen und uns direkt auf Anfrage per E-Mail Feedback gegeben.
id: Oisin Feeley membacanya, melakukan beberapa pengeditan, dan memberikan umpan balik melalui email saat kami bertanya.

source: On Wednesday night we had a fun happy hour with the Austin OpenStack Meetup group and Racker Katie Schmidt took great care of our group.
de: Am Mittwochabend hatten wir eine lustige Happy Hour mit der Austin OpenStack Meetup Gruppe und Racker Katie Schmidt kümmerte sich sehr um unsere Gruppe.
id: Pada hari Rabu malam, kami bersenang-senang dengan kelompok OpenStack Meetup Austin dan Racker Katie Schmidt merawat kelompok kami.

source: On all distributions, you must perform some final tasks to complete the upgrade process.
de: Bei allen Distributionen müssen Sie einige abschließende Aufgaben ausführen, um den Upgrade-Prozess abzuschließen.
id: Di semua distribusi, Anda harus melakukan beberapa tugas akhir untuk menyelesaikan proses upgrade.

source: On all nodes:
de: Auf allen Knoten:
id: Di semua node:

source: On compute nodes and nodes running ``nova-network``, use the following command to see information about interfaces, including information about IPs, VLANs, and whether your interfaces are up:
de: Verwenden Sie auf Compute-Knoten und Knoten, auf denen ``nova-network`` läuft, den folgenden Befehl, um Informationen über Schnittstellen anzuzeigen, einschließlich Informationen über IPs, VLANs und ob Ihre Schnittstellen aktiv sind:
id: Saat node komputasi dan node menjalankan ``nova-network``, gunakan perintah berikut untuk melihat informasi tentang antarmuka, termasuk informasi tentang IP, VLAN, dan apakah antarmuka Anda sudah aktif:

source: On my last day in Kelowna, I was in a conference call from my hotel. In the background, I was fooling around on the new cloud. I launched an instance and logged in. Everything looked fine. Out of boredom, I ran :command:`ps aux` and all of the sudden the instance locked up.
de: An meinem letzten Tag in Kelowna war ich in einer Telefonkonferenz aus meinem Hotel. Im Hintergrund habe ich auf der neuen Cloud herumgealbert. Ich habe eine Instanz gestartet und mich angemeldet. Alles sah gut aus. Aus Langeweile lief ich den Befehl :command:`ps aux` und plötzlich war die Instanz gesperrt.
id: Pada hari terakhir saya di Kelowna, saya melakukan panggilan konferensi dari hotel saya. Di latar belakang, aku bermain-main di awan baru. Saya meluncurkan sebuah instance dan masuk. Semuanya tampak baik-baik saja. Karena bosan, saya jalankan :command: `ps aux` dan tiba-tiba instancenya terkunci.

source: On the Compute node, create the following NRPE configuration:
de: Erstellen Sie auf dem Knoten Compute die folgende NRPE-Konfiguration:
id: Pada simpul Compute, buat konfigurasi NRPE berikut:

source: On the command line, do this:
de: Führen Sie dies auf der Befehlszeile aus:

source: On the compute node, add the following to your NRPE configuration:
de: Fügen Sie auf dem Compute-Knoten Ihrer NRPE-Konfiguration Folgendes hinzu:
id: Pada node komputasi, tambahkan berikut ini ke konfigurasi NRPE Anda:

source: On the compute node:
de: Auf dem Compute-Knoten:
id: Pada node komputasi:

source: On the external server:
de: Auf dem externen Server:
id: Di server eksternal:

source: On the first day, we filled white boards with colorful sticky notes to start to shape this nebulous book about how to architect and operate clouds:
de: Am ersten Tag füllten wir weiße Tafeln mit bunten Haftnotizen, um dieses nebulöse Buch über den Aufbau und Betrieb von Clouds zu gestalten:

source: On the instance:
de: Auf der Instanz:
id: Pada instance:

source: On the integration bridge, networks are distinguished using internal VLANs regardless of how the networking service defines them. This allows instances on the same host to communicate directly without transiting the rest of the virtual, or physical, network. These internal VLAN IDs are based on the order they are created on the node and may vary between nodes. These IDs are in no way related to the segmentation IDs used in the network definition and on the physical wire.
de: Auf der Integrationsbrücke werden Netzwerke über interne VLANs unterschieden, unabhängig davon, wie der Netzwerkdienst sie definiert. Dadurch können Instanzen auf demselben Host direkt kommunizieren, ohne den Rest des virtuellen oder physischen Netzwerks zu durchlaufen. Diese internen VLAN-IDs basieren auf der Reihenfolge, in der sie auf dem Knoten erstellt werden und können zwischen den Knoten variieren. Diese IDs stehen in keinerlei Zusammenhang mit den Segmentierungs-IDs, die in der Netzwerkdefinition und auf dem physischen Kabel verwendet werden.
id: Pada jembatan integrasi, jaringan dibedakan menggunakan VLAN internal terlepas dari bagaimana layanan jaringan menentukannya. Ini memungkinkan instance pada host yang sama untuk berkomunikasi secara langsung tanpa mentransit sisa jaringan (rest of network) virtual atau fisik. ID VLAN internal ini didasarkan pada urutan pembuatannya pada node dan dapat bervariasi antar node. ID ini sama sekali tidak terkait dengan ID segmentasi yang digunakan dalam definisi jaringan dan pada kabel fisik.
