Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: The OpenStack Foundation supported the creation of this book with plane tickets to Austin, lodging (including one adventurous evening without power after a windstorm), and delicious food. For about USD $10,000, we could collaborate intensively for a week in the same room at the Rackspace Austin office. The authors are all members of the OpenStack Foundation, which you can join. Go to the `Foundation web site <https://www.openstack.org/join>`_.
de: Die OpenStack Foundation unterstützte die Erstellung dieses Buches mit Flugtickets nach Austin, Unterkunft (einschließlich eines abenteuerlichen Abends ohne Strom nach einem Sturm) und köstlichem Essen. Für etwa USD 10.000 konnten wir eine Woche lang intensiv im selben Raum im Büro von Rackspace Austin zusammenarbeiten. Die Autoren sind alle Mitglieder der OpenStack Foundation, der Sie beitreten können. Besuchen Sie die `Website der Stiftung <https://www.openstack.org/join>`_.
id: OpenStack Foundation mendukung pembuatan buku ini dengan tiket pesawat ke Austin, penginapan (termasuk satu malam yang penuh petualangan tanpa kekuatan setelah angin topan), dan makanan lezat. Untuk sekitar USD $ 10.000, kami bisa berkolaborasi secara intensif selama seminggu di ruangan yang sama di kantor Rackspace Austin. Para penulis adalah semua anggota OpenStack Foundation, yang dapat Anda ikuti. Pergi ke `Foundation web site <https://www.openstack.org/join>`_.

source: The OpenStack command-line client can provide some additional details:
de: Der OpenStack-Kommandozeilen-Client kann einige zusätzliche Details liefern:
id: Klien command-line OpenStack dapat memberikan beberapa detail tambahan:

source: The OpenStack community has had a database-as-a-service tool in development for some time, and we saw the first integrated release of it in Icehouse. From its release it was able to deploy database servers out of the box in a highly available way, initially supporting only MySQL. Juno introduced support for Mongo (including clustering), PostgreSQL and Couchbase, in addition to replication functionality for MySQL. In Kilo, more advanced clustering capability was delivered, in addition to better integration with other OpenStack components such as Networking.
de: Die OpenStack-Community hat seit einiger Zeit ein Datenbank-as-a-Service-Tool in Entwicklung, und wir haben die erste integrierte Version davon in Icehouse gesehen. Seit seinem Release war es in der Lage, Datenbankserver direkt nach dem Auspacken hochverfügbar einzusetzen, wobei zunächst nur MySQL unterstützt wurde. Juno führte die Unterstützung für Mongo (einschließlich Clustering), PostgreSQL und Couchbase ein, zusätzlich zu den Replikationsfunktionen für MySQL. In Kilo wurde eine erweiterte Clustering-Funktionalität sowie eine bessere Integration mit anderen OpenStack-Komponenten wie Networking bereitgestellt.
id: Komunitas OpenStack telah memiliki alat basis data sebagai layanan dalam pengembangan selama beberapa waktu, dan kami melihat rilis terintegrasi pertama di Icehouse. Dari rilisnya, ia dapat menggunakan server database dengan cara yang sangat tersedia, awalnya hanya mendukung MySQL. Juno memperkenalkan dukungan untuk Mongo (termasuk pengelompokan), PostgreSQL dan Couchbase, di samping fungsi replikasi untuk MySQL. Di Kilo, kemampuan pengelompokan yang lebih maju disampaikan, selain integrasi yang lebih baik dengan komponen OpenStack lainnya seperti Networking.

source: The OpenStack dashboard (horizon) can be configured to use multiple regions. This can be configured through the ``AVAILABLE_REGIONS`` parameter.
de: Das OpenStack-Dashboard (Horizon) kann so konfiguriert werden, dass es mehrere Regionen verwendet. Dies kann über den Parameter ``AVAILABLE_REGIONS`` konfiguriert werden.
id: Dasbor OpenStack (horizon) dapat dikonfigurasi untuk menggunakan banyak wilayah. Ini dapat dikonfigurasi melalui parameter ``AVAILABLE_REGIONS``.

source: The OpenStack dashboard simulates the ability to modify a flavor by deleting an existing flavor and creating a new one with the same name.
de: Das OpenStack-Dashboard simuliert die Möglichkeit, einen Variante zu ändern, indem es eine bestehende Variante löscht und einen neuen mit dem gleichen Namen erstellt.
id: Dashboard OpenStack mensimulasikan kemampuan untuk memodifikasi flavor dengan menghapus flavor yang ada dan membuat yang baru dengan nama yang sama.

source: The OpenStack processes that should be monitored depend on the specific configuration of the environment, but can include:
de: Die zu überwachenden OpenStack-Prozesse hängen von der spezifischen Konfiguration der Umgebung ab, können aber auch Folgendes beinhalten:
id: Proses OpenStack yang harus dipantau tergantung pada konfigurasi lingkungan tertentu, tetapi dapat mencakup:

source: The OpenStack service's policy engine matches a policy directly. A rule indicates evaluation of the elements of such policies. For instance, in a ``compute:create: "rule:admin_or_owner"`` statement, the policy is ``compute:create``, and the rule is ``admin_or_owner``.
de: Die Policy Engine des OpenStack-Dienstes stimmt direkt mit einer Policy überein. Eine Regel bezeichnet die Bewertung der Elemente solcher Politiken. Zum Beispiel in einem ``compute:create: "rule:admin_or_owner"`` Anweisung, die Richtlinie ist ``compute:create``, und die Regel ist ``admin_or_owner``.

source: The OpenStack snapshot mechanism allows you to create new images from running instances. This is very convenient for upgrading base images or for taking a published image and customizing it for local use. To snapshot a running instance to an image using the CLI, do this:
de: Der OpenStack-Schattenkopie-Mechanismus ermöglicht es Ihnen, neue Abbilder aus laufenden Instanzen zu erstellen. Dies ist sehr praktisch, um Basisbilder zu aktualisieren oder um ein veröffentlichtes Abbild aufzunehmen und für den lokalen Gebrauch anzupassen. Um eine laufende Instanz mit Hilfe der CLI in ein Abbild einzufügen, gehen Sie wie folgt vor:

source: The RabbitMQ service name may vary depending on your operating system or vendor who supplies your RabbitMQ service.
de: Der Name des RabbitMQ-Dienstes kann je nach Betriebssystem oder Anbieter, der den RabbitMQ-Dienst anbietet, variieren.
id: Nama layanan RabbitMQ dapat bervariasi tergantung pada sistem operasi atau vendor Anda yang memasok layanan RabbitMQ Anda.

source: The RabbitMQ web management interface is accessible on your cloud controller at *http://localhost:55672*.
de: Die Web-Management-Schnittstelle von RabbitMQ ist auf Ihrem Cloud-Controller unter *http://localhost:55672* zugänglich.
id: Antarmuka manajemen web RabbitMQ dapat diakses di cloud controller Anda di *http://localhost:55672*.

source: The Real Estate team at Rackspace in Austin, also known as "The Victors," were super responsive.
de: Das Real Estate Team bei Rackspace in Austin, auch bekannt als "The Victors", reagierte sehr schnell.
id: Tim Real Estat di Rackspace di Austin, juga dikenal sebagai "The Victors," sangat responsif.

source: The Shared File Systems service provides a mechanism of snapshots to help users to restore their own data. To create a snapshot, use :command:`manila snapshot-create` command like:
de: Der Dienst Shared File Systems bietet einen Mechanismus von Schattenkopien, die den Benutzern bei der Wiederherstellung ihrer eigenen Daten helfen. Um einen Schattenkopie zu erstellen, verwenden Sie den Befehl :command:`manila snapshot-create` wie folgt:

source: The TAP device is connected to the integration bridge, ``br-int``. This bridge connects all the instance TAP devices and any other bridges on the system. In this example, we have ``int-br-eth1`` and ``patch-tun``. ``int-br-eth1`` is one half of a veth pair connecting to the bridge ``br-eth1``, which handles VLAN networks trunked over the physical Ethernet device ``eth1``. ``patch-tun`` is an Open vSwitch internal port that connects to the ``br-tun`` bridge for GRE networks.
de: Das TAP-Gerät wird an die Integrationsbrücke ``br-int`` angeschlossen. Diese Brücke verbindet alle Instanz-TAP-Geräte und alle anderen Brücken auf dem System. In diesem Beispiel haben wir ``int-br-eth1`` und ``Patch-Tun``. ``int-br-eth1`` ist eine Hälfte eines Veth-Paares, das sich mit der Brücke ``br-eth1`` verbindet, die VLAN-Netzwerke verwaltet, die über die physikalische Ethernet-Vorrichtung ``eth1`` verbunden sind. ``Patch-Tun`` ist ein interner Open vSwitch-Port, der mit der ``br-tun``Brücke für GRE-Netzwerke verbunden ist.
id: Perangkat TAP terhubung ke jembatan integrasi, ``br-int``. Jembatan ini menghubungkan semua perangkat TAP instance dan jembatan lainnya pada sistem. Dalam contoh ini, kita memiliki ``int-br-eth1`` dan ``patch-tun``. ``int-br-eth1`` adalah setengah dari pasangan yang terhubung ke jembatan ``br-eth1``, yang menangani jaringan VLAN yang di-trunking melalui perangkat Ethernet fisik ``eth1``. ``patch-tun`` adalah port internal Open vSwitch yang menghubungkan ke jembatan ``br-tun`` untuk jaringan GRE.

source: The TAP device name is constructed using the first 11 characters of the port ID (10 hex digits plus an included '-'), so another means of finding the device name is to use the :command:`neutron` command. This returns a pipe-delimited list, the first item of which is the port ID. For example, to get the port ID associated with IP address 10.0.0.10, do this:
de: Der TAP-Gerätename wird aus den ersten 11 Zeichen der Port-ID (10 Hex-Ziffern plus einem enthaltenen '-') aufgebaut, so dass eine weitere Möglichkeit, den Gerätenamen zu finden, darin besteht, den Befehl :command:`neutron` zu verwenden. Dies gibt eine Liste mit pipe-delimited zurück, deren erstes Element die Port-ID ist. Um beispielsweise die Port-ID der IP-Adresse 10.0.0.0.0.10 zu erhalten, führen Sie dies aus:
id: Nama perangkat TAP dibuat menggunakan 11 karakter pertama port ID (10 hex digits plus an included '-'), jadi cara lain untuk menemukan nama perangkat adalah dengan menggunakan perintah :command:`neutron`. Ini mengembalikan pipe-delimited list, item pertama di antaranya adalah port ID. Misalnya, untuk mendapatkan ID port yang terkait dengan alamat IP 10.0.0.10, lakukan ini:

source: The TAP devices and veth devices are normal Linux network devices and may be inspected with the usual tools, such as :command:`ip` and :command:`tcpdump`. Open vSwitch internal devices, such as ``patch-tun``, are only visible within the Open vSwitch environment. If you try to run :command:`tcpdump -i patch-tun`, it will raise an error, saying that the device does not exist.
de: Die TAP-Geräte und veth-Geräte sind normale Linux-Netzwerkgeräte und können mit den üblichen Tools wie :command:`ip` und :command:`tcpdump` überprüft werden. Offene interne vSwitch-Geräte, wie z.B. ``patch-tun``, sind nur innerhalb der Open vSwitch-Umgebung sichtbar. Wenn Sie versuchen, :command:`tcpdump -i patch-tun` auszuführen, wird ein Fehler ausgelöst, der besagt, dass das Gerät nicht existiert.
id: Perangkat TAP dan perangkat veth adalah perangkat jaringan Linux normal dan dapat diperiksa dengan alat yang biasa, seperti :command:`ip` dan :command:`tcpdump`. Buka perangkat internal vSwitch, seperti ``patch-tun``, hanya terlihat dalam lingkungan Open vSwitch. Jika Anda mencoba menjalankan :command:`tcpdump -i patch-tun`, itu akan memunculkan kesalahan, mengatakan bahwa perangkat tidak ada.

source: The Telemetry service (:term:`ceilometer`) collects metering and event data relating to OpenStack services. Data collected by the Telemetry service could be used for billing. Depending on deployment configuration, collected data may be accessible to users based on the deployment configuration. You can read more about the module in the `Ceilometer Administrator Guide <https://docs.openstack.org/ceilometer/latest/admin/index.html>`_ or in the `Ceilometer Contributor Guide <https://docs.openstack.org/ceilometer/latest/contributor/index.html>`_.
de: Der Telemetriedienst (:term:`ceilometer`) sammelt Mess- und Ereignisdaten zu OpenStack-Diensten. Die vom Telemetrieservice gesammelten Daten können für die Abrechnung verwendet werden. Abhängig von der Bereitstellungskonfiguration können die gesammelten Daten den Benutzern basierend auf der Bereitstellungskonfiguration zugänglich sein. Sie können mehr über das Modul im `Ceilometer Administrator Guide <https://docs.openstack.org/ceilometer/latest/admin/index.html>`_ oder im `Ceilometer Contributor Guide <https://docs.openstack.org/ceilometer/latest/contributor/index.html>`_ lesen.
id: Layanan Telemetry (:term: `ceilometer`) mengumpulkan data pengukuran dan peristiwa yang berkaitan dengan layanan OpenStack. Data yang dikumpulkan oleh layanan Telemetry dapat digunakan untuk penagihan. Bergantung pada konfigurasi penempatan, data yang dikumpulkan dapat diakses oleh pengguna berdasarkan konfigurasi penempatan. Anda dapat membaca lebih lanjut tentang modul di `Ceilometer Administrator Guide <https://docs.openstack.org/ceilometer/latest/admin/index.html>` _ atau di `Ceilometer Contributor Guide <https: // docs. openstack.org/ceilometer/latest/contributor/index.html>`_.

source: The `OpenStack High Availability Guide <https://docs.openstack.org/ha-guide/index.html>`_ offers suggestions for elimination of a single point of failure that could cause system downtime. While it is not a completely prescriptive document, it offers methods and techniques for avoiding downtime and data loss.
de: Der `OpenStack High Availability Guide <https://docs.openstack.org/ha-guide/index.html>`_ bietet Vorschläge zur Beseitigung eines einzelnen Fehlers, der zu Systemausfällen führen kann. Es ist zwar kein vollständig normatives Dokument, bietet aber Methoden und Techniken zur Vermeidung von Ausfallzeiten und Datenverlust.
id: The `OpenStack High Availability Guide <https://docs.openstack.org/ha-guide/index.html>`_ menawarkan saran untuk menghilangkan satu titik kegagalan yang dapat menyebabkan gangguan sistem. Meskipun ini bukan dokumen yang sepenuhnya preskriptif, ia menawarkan metode dan teknik untuk menghindari downtime dan kehilangan data.

source: The `OpenStack Security Guide <https://docs.openstack.org/security-guide/>`_ provides a deep dive into securing an OpenStack cloud, including SSL/TLS, key management, PKI and certificate management, data transport and privacy concerns, and compliance.
de: Der `OpenStack Security Guide <https://docs.openstack.org/security-guide/>`_ bietet einen tiefen Einblick in die Sicherung einer OpenStack-Cloud, einschließlich SSL/TLS, Schlüsselmanagement, PKI- und Zertifikatsmanagement, Datentransport- und Datenschutzbelange sowie Compliance.
id: The `OpenStack Security Guide <https://docs.openstack.org/security-guide/>`_ menyediakan penyelaman mendalam untuk mengamankan cloud OpenStack, termasuk SSL/TLS, manajemen utama, PKI dan manajemen sertifikat, transportasi data dan masalah privasi, dan kepatuhan.

source: The ``-H`` flag is required when running the daemons with sudo because some daemons will write files relative to the user's home directory, and this write may fail if ``-H`` is left off.
de: Das ``-H`` Flag wird benötigt, wenn die Daemons mit sudo ausgeführt werden, da einige Daemons Dateien relativ zum Heimatverzeichnis des Benutzers schreiben, und dieses Schreiben kann fehlschlagen, wenn ``-H`` weggelassen wird.
id: Flag ``-H`` diperlukan ketika menjalankan daemon dengan sudo karena beberapa daemon akan menulis file relatif ke direktori home pengguna, dan penulisan ini mungkin gagal jika ``-H`` ditinggalkan.

source: The ``-s flag`` used in the cURL commands above are used to prevent the progress meter from being shown. If you are having trouble running cURL commands, you'll want to remove it. Likewise, to help you troubleshoot cURL commands, you can include the ``-v`` flag to show you the verbose output. There are many more extremely useful features in cURL; refer to the man page for all the options.
de: Das ``-s flag`` in den obigen cURL-Befehlen wird verwendet, um zu verhindern, dass der Fortschrittsmesser angezeigt wird. Wenn Sie Probleme beim Ausführen von cURL-Befehlen haben, sollten Sie diese entfernen. Um Ihnen bei der Fehlerbehebung von cURL-Befehlen zu helfen, können Sie auch das Flag ```-v``` einfügen, um Ihnen die ausführliche Ausgabe anzuzeigen. Es gibt noch viele weitere äußerst nützliche Funktionen in cURL; alle Optionen finden Sie in der Man Page.
id: ``-s flag`` yang digunakan dalam perintah cURL di atas digunakan untuk mencegah meteran progres tidak ditampilkan. Jika Anda mengalami kesulitan menjalankan perintah cURL, Anda ingin menghapusnya. Demikian juga, untuk membantu Anda memecahkan masalah perintah cURL, Anda dapat menyertakan flag ``-v`` untuk menunjukkan kepada Anda output verbose. Ada banyak fitur yang sangat berguna di cURL; lihat halaman manual untuk semua opsi.

source: The ``/etc/nova`` directory on both the cloud controller and compute nodes should be regularly backed up.
de: Das Verzeichnis ``/etc/nova`` sowohl auf dem Cloud Controller als auch auf den Compute-Knoten sollte regelmäßig gesichert werden.
id: Direktori ``/etc/nova`` pada cloud controller dan compute node harus secara teratur dicadangkan.

source: The ``deleted`` field is set to ``1`` if the instance has been deleted and ``NULL`` if it has not been deleted. This field is important for excluding deleted instances from your queries.
de: Das Feld ``gelöscht`` wird auf ``1`` gesetzt, wenn die Instanz gelöscht wurde und ``NULL``, wenn sie nicht gelöscht wurde. Dieses Feld ist wichtig, um gelöschte Instanzen von Ihren Abfragen auszuschließen.

source: The ``host`` field tells which compute node is hosting the instance.
de: Das Feld ``host``` sagt aus, welcher Compute-Knoten die Instanz hostet.

source: The ``hostname`` field holds the name of the instance when it is launched. The display-name is initially the same as hostname but can be reset using the nova rename command.
de: Das Feld ``hostname`` enthält den Namen der Instanz, wenn sie gestartet wird. Der Anzeigename ist zunächst identisch mit dem Hostnamen, kann aber mit dem Befehl nova rename zurückgesetzt werden.

source: The ``nova.quota_usages`` table keeps track of how many resources the tenant currently has in use:
de: Die Tabelle ``nova.quota_usages`` verfolgt, wie viele Ressourcen der Mandant derzeit nutzt:
id: Tabel ``nova.quota_usages`` melacak berapa banyak sumber daya yang digunakan penyewa saat ini:

source: The ``nova.quotas`` and ``nova.quota_usages`` tables store quota information. If a tenant's quota is different from the default quota settings, its quota is stored in the ``nova.quotas`` table. For example:
de: In den Tabellen ``nova.quotas`` und ``nova.quota_usages`` werden Quoteninformationen gespeichert. Wenn die Quote eines Mandanten von den Standardeinstellungen abweicht, wird seine Quote in der Tabelle ``nova.quotas`` gespeichert. Zum Beispiel:
id: ``nova.quotas`` dan ``nova.quota_usages`` tabel menyimpan informasi kuota. Jika kuota penyewa berbeda dari pengaturan kuota default, kuota disimpan dalam tabel ``nova.quotas``. Sebagai contoh:

source: The ``qg-<n>`` interface in the l3-agent router namespace sends the packet on to its next hop through device ``eth2`` on the external bridge ``br-ex``. This bridge is constructed similarly to ``br-eth1`` and may be inspected in the same way.
de: Das ``qg-<n>``` Interface im l3-agent Router Namensraum sendet das Paket an seinen nächsten Hop durch die Vorrichtung ``eth2`` auf der externen Brücke ``br-ex``. Diese Brücke ist ähnlich aufgebaut wie ``br-eth1`` und kann auf die gleiche Weise geprüft werden.
id: Antarmuka ``qg- <n> `` di namespace router l3-agent mengirim paket ke hop berikutnya melalui perangkat ``eth2`` di jembatan eksternal ``br-ex``. Jembatan ini dibangun mirip dengan ``br-eth1`` dan dapat diperiksa dengan cara yang sama.

source: The ``segmentation_id``, ``cidr``, ``ip_version``, and ``network_type`` share network attributes are automatically set to the values determined by the network provider.
de: Die Netzwerkattribute ``Segmentierung_id``, ``cidr``, `ip_version`` und ``network_type`` werden automatisch auf die vom Netzwerkanbieter festgelegten Werte gesetzt.

source: The ``tcpdump`` looked very, very weird. In short, it looked as though network communication stopped before the instance tried to renew its IP. Since there is so much DHCP chatter from a one minute lease, it's very hard to confirm it, but even with only milliseconds difference between packets, if one packet arrives first, it arrived first, and if that packet reported network issues, then it had to have happened before DHCP.
de: Das ``tcpdump`` sah sehr, sehr seltsam aus. Kurz gesagt, es sah so aus, als ob die Netzwerkkommunikation gestoppt wurde, bevor die Instanz versuchte, ihre IP zu erneuern. Da es so viel DHCP-Chatter aus einer Minute Leasing gibt, ist es sehr schwierig, es zu bestätigen, aber selbst mit nur einer Millisekunden Differenz zwischen den Paketen, wenn ein Paket zuerst ankommt, kommt es zuerst an, und wenn dieses Paket Netzwerkprobleme meldet, dann muss es vor DHCP passiert sein.
id: ``tcpdump`` terlihat sangat, sangat aneh. Singkatnya, sepertinya komunikasi jaringan terhenti sebelum instance mencoba memperbarui IP-nya. Karena ada begitu banyak obrolan DHCP dari sewa satu menit, sangat sulit untuk mengkonfirmasinya, tetapi bahkan dengan hanya perbedaan milidetik antara paket, jika satu paket tiba terlebih dahulu, itu tiba terlebih dahulu, dan jika paket itu melaporkan masalah jaringan, maka ia memiliki telah terjadi sebelum DHCP.

source: The ``user-data`` key is a special key in the metadata service that holds a file that cloud-aware applications within the guest instance can access. For example, `cloudinit <https://help.ubuntu.com/community/CloudInit>`__ is an open source package from Ubuntu, but available in most distributions, that handles early initialization of a cloud instance that makes use of this user data.
de: Der Schlüssel ``user-data`` ist ein spezieller Schlüssel im Metadatendienst, der eine Datei enthält, auf die cloud-fähige Anwendungen innerhalb der Gastinstanz zugreifen können. Zum Beispiel ist `cloudinit <https://help.ubuntu.com/community/CloudInit>`__ ein Open-Source-Paket von Ubuntu, das aber in den meisten Distributionen verfügbar ist, das die frühzeitige Initialisierung einer Cloud-Instanz übernimmt, die diese Benutzerdaten nutzt.

source: The ``uuid`` field is the UUID of the instance and is used throughout other tables in the database as a foreign key. This ID is also reported in logs, the dashboard, and command-line tools to uniquely identify an instance.
de: Das Feld ``uuuid`` ist die UUID der Instanz und wird in allen anderen Tabellen der Datenbank als Fremdschlüssel verwendet. Diese ID wird auch in Protokollen, dem Dashboard und Befehlszeilenwerkzeugen zur eindeutigen Identifizierung einer Instanz angegeben.

source: The admin is global, not per project, so granting a user the ``admin`` role in any project gives the user administrative rights across the whole cloud.
de: Der Administrator ist global, nicht pro Projekt, so dass die Zuweisung der Rolle "Administrator" in jedem Projekt dem Benutzer Administratorrechte in der gesamten Cloud gibt.

source: The api_class [keymgr] is deprecated as of Newton, so it should not be included in this release or beyond.
de: Die api_class[keymgr] ist ab Newton veraltet, daher sollte sie nicht in dieser Version oder darüber hinaus enthalten sein.
id: api_class [keymgr] sudah tidak digunakan lagi oleh Newton, jadi tidak boleh disertakan dalam rilis ini atau lebih.
