Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: Services related to OpenStack Compute are normally fairly fast and rely on a couple of backend services: Identity for authentication and authorization), and AMQP for interoperability. Any slowness related to services is normally related to one of these. Also, as with all other services, SQL is used extensively.
de: Dienste im Zusammenhang mit OpenStack Compute sind in der Regel recht schnell und basieren auf einigen Backend-Diensten: Identität für Authentifizierung und Autorisierung) und AMQP für Interoperabilität. Jede Verlangsamung im Zusammenhang mit Dienstleistungen ist normalerweise mit einem dieser Faktoren verbunden. Wie bei allen anderen Diensten wird auch hier SQL intensiv genutzt.
id: Layanan yang terkait dengan OpenStack Compute biasanya cukup cepat dan bergantung pada beberapa layanan backend: Identity untuk otentikasi dan otorisasi), dan AMQP untuk interoperabilitas. Setiap kelambatan yang terkait dengan layanan biasanya terkait dengan salah satunya. Juga, seperti semua layanan lainnya, SQL digunakan secara luas.

source: Set Block Storage Quotas
de: Blockspeicherquoten festlegen
id: Tetapkan Kuota Block Storage

source: Set Compute Service Quotas
de: Legen Sie Compute-Dienstquoten fest
id: Tetapkan Kuota Layanan Compute

source: Set Image Quotas
de: Abbildquoten festlegen
id: Tetapkan Kuota Image

source: Set Object Storage Quotas
de: Objekt-Speicherquoten festlegen
id: Tetapkan Kuota Object Storage

source: Set up the Key Manager service by editing /etc/nova/nova.conf and adding the entries in the codeblock below
de: Richten Sie den Key Manager-Dienst ein, indem Sie /etc/nova/nova/nova.conf bearbeiten und die Einträge im folgenden Codeblock hinzufügen
id: Atur layanan Key Manager dengan mengedit /etc/nova/nova.conf dan menambahkan entri di codeblock di bawah ini

source: Several configuration-management tools are available, and this guide does not recommend a specific one. The most popular ones in the OpenStack community are:
de: Es stehen mehrere Konfigurationsmanagement-Tools zur Verfügung, und dieser Leitfaden empfiehlt kein spezifisches Tool. Die beliebtesten in der OpenStack-Community sind:
id: Beberapa alat manajemen konfigurasi tersedia, dan panduan ini tidak merekomendasikan yang spesifik. Yang paling populer di komunitas OpenStack adalah:

source: Several minutes after ``nova-network`` is restarted, you should see new dnsmasq processes running:
de: Einige Minuten nach dem Neustart von ``nova-network`` sollten Sie neue dnsmasq-Prozesse laufen sehen:
id: Beberapa menit setelah ``nova-network`` dimulai ulang, Anda akan melihat proses dnsmasq baru berjalan:

source: Several options are available for MySQL load balancing, and the supported AMQP brokers have built-in clustering support. Information on how to configure these and many of the other services can be found in the `Operations Guide <https://docs.openstack.org/operations-guide/>`_.
de: Für den MySQL-Lastausgleich stehen mehrere Optionen zur Verfügung, und die unterstützten AMQP-Broker verfügen über eine integrierte Clustering-Unterstützung. Informationen zur Konfiguration dieser und vieler anderer Dienste finden Sie im `Operations Guide <https://docs.openstack.org/operations-guide/>`_.
id: Beberapa opsi tersedia untuk penyeimbangan beban MySQL, dan AMQP broker yang didukung memiliki dukungan pengelompokan bawaan. Informasi tentang cara mengkonfigurasi ini dan banyak layanan lainnya dapat ditemukan di Internet `Operations Guide <https://docs.openstack.org/operations-guide/>`_.

source: Several pre-made images exist and can easily be imported into the Image service. A common image to add is the CirrOS image, which is very small and used for testing purposes. To add this image, simply do:
de: Es gibt mehrere vorgefertigte Abbilder, die einfach in den Abbild-Dienst importiert werden können. Ein gängiges Abbild zum Hinzufügen ist das CirrOS-Bild, das sehr klein ist und zu Testzwecken verwendet wird. Um dieses Abbild hinzuzufügen, geben Sie einfach ein:
id: Beberapa image pra-made ada dan dapat dengan mudah diimpor ke layanan Image. Image yang umum untuk ditambahkan adalah image CirrOS, yang sangat kecil dan digunakan untuk tujuan pengujian. Untuk menambahkan image ini, cukup lakukan:

source: Shared File System storage allows administrators to set limits and quotas for specific tenants and users. Limits are the resource limitations that are allowed for each tenant or user. Limits consist of:
de: Der Shared File System Storage ermöglicht es Administratoren, Limits und Quoten für bestimmte Mandanten und Benutzer festzulegen. Limits sind die Ressourcenbeschränkungen, die für jeden Mandanten oder Benutzer erlaubt sind. Limits bestehen aus:

source: Shared File Systems Service
de: Shared File Systems service (manila)
id: Layanan Shared File System

source: Shared File Systems service cannot warn you beforehand if it is safe to write a specific large amount of data onto a certain share or to remove a consistency group if it has a number of shares assigned to it. In such a potentially erroneous situations, if a mistake happens, you can expect some error message or even failing of shares or consistency groups into an incorrect status. You can also expect some level of system corruption if a user tries to unmount an unmanaged share while a process is using it for data transfer.
de: Der Dienst Shared File Systems kann Sie nicht vorher warnen, wenn es sicher ist, eine bestimmte große Datenmenge auf eine bestimmte Freigabe zu schreiben oder eine Konsistenzgruppe zu entfernen, wenn ihr eine bestimmte Anzahl von Freigaben zugewiesen ist. In einer solchen potenziell fehlerhaften Situation können Sie im Falle eines Fehlers mit einer Fehlermeldung oder gar dem Versagen von Freigaben oder Konsistenzgruppen in einen falschen Status rechnen. Sie können auch mit einer gewissen Systembeschädigung rechnen, wenn ein Benutzer versucht, eine nicht verwaltete Freigabe zu entfernen, während ein Prozess sie für die Datenübertragung verwendet.

source: Shared File Systems service differs from the principles implemented in Block Storage. Shared File Systems service can work in two modes:
de: Der Dienst Shared File Systems unterscheidet sich von den im Blockspeicher implementierten Prinzipien. Der Dienst Shared File Systems kann in zwei Modi arbeiten:

source: Shares are a remote mountable file system, so users can mount a share to multiple hosts, and have it accessed from multiple hosts by multiple users at a time. With the Shared File Systems service, you can perform a large number of operations with shares:
de: Freigaben sind ein fernbetreibbares Dateisystem, so dass Benutzer eine Freigabe auf mehreren Hosts einbinden und von mehreren Hosts aus von mehreren Benutzern gleichzeitig darauf zugreifen können. Mit dem Dienst Shared File Systems können Sie eine große Anzahl von Operationen mit Freigaben durchführen:
id: Shares adalah sistem file yang dapat dipasang jarak jauh, sehingga pengguna dapat memasang berbagi ke beberapa host, dan membuatnya diakses dari banyak host oleh banyak pengguna sekaligus. Dengan layanan Shared File Systems, Anda dapat melakukan sejumlah besar operasi dengan berbagi:

source: Sharing Images Between Projects
de: Freigeben von Abbildern zwischen Projekten
id: Berbagi Image Antar Proyek

source: Should backups be kept off-site?
de: Sollten Backups extern aufbewahrt werden?
id: Haruskah cadangan disimpan off-site?

source: Shows OpenStack end users how to create and manage resources in an OpenStack cloud with the OpenStack dashboard and OpenStack client commands
de: Zeigt OpenStack-Endbenutzern, wie sie Ressourcen in einer OpenStack-Cloud mit dem OpenStack Dashboard und den OpenStack-Clientbefehlen erstellen und verwalten können

source: Shows you how to obtain, create, and modify virtual machine images that are compatible with OpenStack
de: Zeigt Ihnen, wie Sie Abbilder virtueller Maschinen erhalten, erstellen und ändern, die mit OpenStack kompatibel sind

source: Shut down your compute node, perform the maintenance, and turn the node back on.
de: Fahren Sie Ihren Compute-Knoten herunter, führen Sie die Wartung durch und schalten Sie den Knoten wieder ein.
id: Matikan simpul komputasi Anda, lakukan pemeliharaan, dan nyalakan kembali simpul tersebut.

source: Shutting Down a Storage Node
de: Herunterfahren eines Storage Node
id: Mematikan Storage Node

source: Signature hash method = SHA-256
de: Signatur-Hash-Verfahren = SHA-256
id: Metode hash signature = SHA-256

source: Signature hash methods: SHA-224, SHA-256, SHA-384, and SHA-512
de: Signatur-Hash-Methoden: SHA-224, SHA-256, SHA-384 und SHA-512
id: Metode hash signature: SHA-224, SHA-256, SHA-384, and SHA-512

source: Signature key type = RSA-PSS
de: Signaturschlüsseltyp = RSA-PSS
id: Jenis signature key = RSA-PSS

source: Signature key types: DSA, ECC_SECT571K1, ECC_SECT409K1, ECC_SECT571R1, ECC_SECT409R1, ECC_SECP521R1, ECC_SECP384R1, and RSA-PSS
de: Signaturschlüsseltypen: DSA, ECC_SECT571K1, ECC_SECT409K1, ECC_SECT571R1, ECC_SECT409R1, ECC_SECP521R1, ECC_SECP384R1 und RSA-PSS
id: Jenis signature key: DSA, ECC_SECT571K1, ECC_SECT409K1, ECC_SECT571R1, ECC_SECT409R1, ECC_SECP521R1, ECC_SECP384R1, dan RSA-PSS

source: Signature verification will occur when Compute boots the signed image
de: Die Signaturprüfung tritt auf, wenn Compute das signierte Abbild startet
id: Verifikasi signature akan terjadi ketika Compute mem-boot signed image

source: Similar to Block Storage, the Shared File System is a persistent storage, called share, that can be used in multi-tenant environments. Users create and mount a share as a remote file system on any machine that allows mounting shares, and has network access to share exporter. This share can then be used for storing, sharing, and exchanging files. The default configuration of the Shared File Systems service depends on the back-end driver the admin chooses when starting the Shared File Systems service. For more information about existing back-end drivers, see `Share Backends <https://docs.openstack.org/manila/latest/admin/index.html#supported-share-back-ends>`__ of Shared File Systems service Developer Guide. For example, in case of OpenStack Block Storage based back-end is used, the Shared File Systems service cares about everything, including VMs, networking, keypairs, and security groups. Other configurations require more detailed knowledge of shares functionality to set up and tune specific parameters and modes of shares functioning.
de: Ähnlich wie die Blockspeicherung ist das Shared File System ein persistenter Speicher, genannt Share, der in mandantenfähigen Umgebungen verwendet werden kann. Benutzer erstellen und mounten eine Freigabe als entferntes Dateisystem auf jedem Computer, der das Mounten von Freigaben erlaubt und Netzwerkzugriff auf den Share-Exporter hat. Diese Freigabe kann dann zum Speichern, Teilen und Austauschen von Dateien verwendet werden. Die Standardkonfiguration des Dienstes Shared File Systems hängt vom Backend-Treiber ab, den der Administrator beim Start des Dienstes Shared File Systems wählt. Weitere Informationen über bestehende Backend-Treiber finden Sie unter `Share Backends <https://docs.openstack.org/manila/latest/admin/index.html#supported-share-back-ends>`__ im Entwicklerhandbuch für den Dienst Shared File Systems. Wenn beispielsweise OpenStack Block Storage-basiertes Backend verwendet wird, kümmert sich der Dienst Shared File Systems um alles, einschließlich VMs, Netzwerke, Schlüsselpaare und Sicherheitsgruppen. Andere Konfigurationen erfordern detailliertere Kenntnisse der Freigabefunktionalität, um spezifische Parameter und Funktionsweisen der Freigaben einzurichten und anzupassen.
id: Mirip dengan Block Storage, Shared File System adalah penyimpanan persisten, yang disebut share, yang dapat digunakan di lingkungan multi-tenant. Pengguna membuat dan memasang (mount) share sebagai sistem file jarak jauh di mesin apa pun yang memungkinkan pemasangan share, dan memiliki akses jaringan untuk berbagi eksportir. Bagian ini kemudian dapat digunakan untuk menyimpan, berbagi, dan bertukar file. Konfigurasi default layanan Shared File Systems tergantung pada driver back-end yang dipilih admin ketika memulai layanan Shared File Systems. Untuk informasi lebih lanjut tentang driver back-end yang ada, lihat `Share Backends <https://docs.openstack.org/manila/latest/admin/index.html#supported-share-back-ends>` __ dari layanan Shared File Systems di Developer Guide. Sebagai contoh, dalam kasus OpenStack Block Storage berbasis back-end digunakan, layanan Shared File Systems peduli tentang semuanya, termasuk VM, jaringan, keypairs, dan grup keamanan. Konfigurasi lain membutuhkan pengetahuan yang lebih rinci tentang fungsionalitas share untuk mengatur dan menyetel parameter dan mode spesifik dari fungsi share.

source: Similarly, if you have an existing cloud and are looking to upgrade from ``nova-network`` to OpenStack Networking, you should have the option to delay the upgrade for this period of time. However, each release of OpenStack brings significant new innovation, and regardless of your use of networking methodology, it is likely best to begin planning for an upgrade within a reasonable timeframe of each release.
de: Wenn Sie eine bestehende Cloud haben und ein Upgrade von ``nova-network`` auf OpenStack Networking durchführen möchten, sollten Sie die Option haben, das Upgrade um diesen Zeitraum zu verschieben. Jede Version von OpenStack bringt jedoch bedeutende neue Innovationen mit sich, und unabhängig von der Verwendung der Netzwerkmethodik ist es wahrscheinlich am besten, die Planung für ein Upgrade innerhalb eines angemessenen Zeitraums nach jeder Version zu beginnen.
id: Demikian pula, jika Anda memiliki cloud yang ada dan ingin memutakhirkan dari ``nova-network`` ke OpenStack Networking, Anda harus memiliki opsi untuk menunda upgrade untuk periode waktu ini. Namun, setiap rilis OpenStack membawa inovasi baru yang signifikan, dan terlepas dari penggunaan metodologi jaringan Anda, mungkin yang terbaik untuk mulai merencanakan peningkatan dalam jangka waktu yang wajar dari setiap rilis.

source: Since my database contained many records—over 1 million metadata records and over 300,000 instance records in "deleted" or "errored" states—each search took a long time. I decided to clean up the database by first archiving a copy for backup and then performing some deletions using the MySQL client. For example, I ran the following SQL command to remove rows of instances deleted for over a year:
de: Da meine Datenbank viele Datensätze enthielt - über 1 Million Metadatensätze und über 300.000 Instanzensätze in "gelöschten" oder "fehlerhaften" Zuständen - dauerte jede Suche sehr lange. Ich entschied mich, die Datenbank zu bereinigen, indem ich zuerst eine Kopie zur Sicherung archivierte und dann einige Löschungen mit dem MySQL-Client durchführte. Beispielsweise habe ich den folgenden SQL-Befehl ausgeführt, um Zeilen von Instanzen zu entfernen, die über ein Jahr lang gelöscht wurden:
id: Karena basis data saya berisi banyak catatan — lebih dari 1 juta catatan metadata dan lebih dari 300.000 catatan instance dalam status "deleted" atau "errored" - setiap pencarian membutuhkan waktu lama. Saya memutuskan untuk membersihkan database dengan terlebih dahulu mengarsipkan salinan untuk cadangan dan kemudian melakukan beberapa penghapusan menggunakan klien MySQL. Sebagai contoh, saya menjalankan perintah SQL berikut untuk menghapus deretan instance yang dihapus selama lebih dari setahun:

source: Since the Liberty release, OpenStack services will automatically recover from a RabbitMQ outage. You should only consider restarting OpenStack services after checking if RabbitMQ heartbeat functionality is enabled, and if OpenStack services are not picking up messages from RabbitMQ queues.
de: Seit der Liberty-Version stellen die OpenStack-Dienste automatisch nach einem RabbitMQ-Ausfall wieder her. Sie sollten den Neustart von OpenStack-Diensten erst in Betracht ziehen, nachdem Sie geprüft haben, ob die RabbitMQ Heartbeat-Funktionalität aktiviert ist und ob die OpenStack-Dienste keine Nachrichten von RabbitMQ-Warteschlangen empfangen.
id: Sejak rilis Liberty, layanan OpenStack akan secara otomatis pulih dari pemadaman (outage) RabbitMQ. Anda hanya harus mempertimbangkan memulai kembali layanan OpenStack setelah memeriksa apakah fungsi heartbeat RabbitMQ diaktifkan, dan jika layanan OpenStack tidak menerima pesan dari antrian RabbitMQ.

source: Since the Liberty release, OpenStack with RabbitMQ 3.4.x or 3.6.x has an issue with the management database consuming the memory allocated to RabbitMQ. This is caused by statistics collection and processing. When a single node with RabbitMQ reaches its memory threshold, all exchange and queue processing is halted until the memory alarm recovers.
de: Seit dem Liberty-Release hat OpenStack mit RabbitMQ 3.4.x oder 3.6.x ein Problem mit der Verwaltungsdatenbank, die den RabbitMQ zugewiesenen Speicher verbraucht. Dies wird durch die Erhebung und Verarbeitung von Statistiken verursacht. Wenn ein einzelner Knoten mit RabbitMQ seine Speicherschwelle erreicht, wird die gesamte Austausch- und Warteschlangenverarbeitung gestoppt, bis sich der Speicheralarm erholt hat.
id: Sejak rilis Liberty, OpenStack with RabbitMQ 3.4.x atau 3.6.x memiliki masalah dengan database manajemen yang menggunakan memori yang dialokasikan untuk RabbitMQ. Ini disebabkan oleh pengumpulan dan pemrosesan statistik. Ketika satu node dengan RabbitMQ mencapai ambang memori, semua pertukaran dan pemrosesan antrian dihentikan hingga alarm memori pulih.

source: Slowness in the OpenStack :term:`Networking service <Networking service (neutron)>` can be caused by services that it relies upon, but it can also be related to either physical or virtual networking. For example: network namespaces that do not exist or are not tied to interfaces correctly; DHCP daemons that have hung or are not running; a cable being physically disconnected; a switch not being configured correctly. When debugging Networking service problems, begin by verifying all physical networking functionality (switch configuration, physical cabling, etc.). After the physical networking is verified, check to be sure all of the Networking services are running (neutron-server, neutron-dhcp-agent, etc.), then check on AMQP and SQL back ends.
de: Langsamkeit im OpenStack :term:`Netzwerkdienst <Netzwerkdienst (Neutron)>` kann durch Dienste verursacht werden, auf die er sich stützt, aber es kann auch entweder mit physischen oder virtuellen Netzwerken zusammenhängen. Zum Beispiel: Netzwerk-Namensräume, die nicht existieren oder nicht korrekt an Schnittstellen gebunden sind; DHCP-Daemons, die hängen geblieben sind oder nicht laufen; ein Kabel, das physisch getrennt ist; ein Switch, der nicht korrekt konfiguriert ist. Wenn Sie Probleme mit dem Netzwerkdienst beheben, überprüfen Sie zunächst alle physischen Netzwerkfunktionen (Switch-Konfiguration, physische Verkabelung usw.). Nachdem das physische Netzwerk verifiziert wurde, überprüfen Sie, ob alle Netzwerkdienste ausgeführt werden (Neutron-Server, Neutron-Dhcp-Agent, etc.) und überprüfen Sie dann AMQP- und SQL-Backends.
id: Kelambatan pada OpenStack :term:`Networking service <Networking service (neutron)>` dapat disebabkan oleh layanan yang diandalkannya, tetapi juga dapat dikaitkan dengan jaringan fisik atau virtual. Misalnya: namespace jaringan yang tidak ada atau tidak terikat ke interface dengan benar; Daemon DHCP yang telah hang atau tidak berjalan; kabel terputus secara fisik; sebuah switch tidak dikonfigurasikan dengan benar. Ketika debugging masalah layanan Networking, mulailah dengan memverifikasi semua fungsi jaringan fisik (konfigurasi switch, kabel fisik, dll.). Setelah jaringan fisik diverifikasi, periksa untuk memastikan semua layanan Networking berjalan (neutron-server, neutron-dhcp-agent, dll.), Lalu periksa AMQP dan SQL back end.

source: So it was a qemu/kvm bug.
de: Es war also ein qemu/kvm Bug.
id: Jadi itu adalah bug qemu/kvm.

source: So many OpenStack resources are available online because of the fast-moving nature of the project, but there are also resources listed here that the authors found helpful while learning themselves.
de: Aufgrund der Schnelllebigkeit des Projekts sind so viele OpenStack-Ressourcen online verfügbar, aber es gibt auch Ressourcen, die hier aufgelistet sind, die den Autoren beim Lernen selbst hilfreich erschienen.

source: So, I found myself wondering what changed in the EC2 API on Havana that might cause this to happen. Was it a bug or a normal behavior that I now need to work around?
de: So fragte ich mich, was sich an der EC2-API auf Havanna geändert hat, was dies bewirken könnte. War es ein Fehler oder ein normales Verhalten, das ich jetzt umgehen muss?
id: Jadi, saya mendapati diri saya bertanya-tanya apa yang berubah dalam EC2 API di Havana yang mungkin menyebabkan ini terjadi. Apakah itu bug atau perilaku normal yang sekarang harus saya atasi?

source: Software licensing
de: Software-Lizenzierung
id: Lisensi perangkat lunak

source: Some of the resources that you want to monitor include:
de: Einige der Ressourcen, die Sie überwachen möchten, sind unter anderem:
id: Beberapa sumber daya yang ingin Anda pantau meliputi:

source: Some other examples for Intelligent Alerting include:
de: Einige weitere Beispiele für Intelligent Alerting sind:
id: Beberapa contoh lain untuk Peringatan Intelligent meliputi:

source: Sometimes a compute node either crashes unexpectedly or requires a reboot for maintenance reasons.
de: Manchmal stürzt ein Compute-Knoten entweder unerwartet ab oder erfordert aus Wartungsgründen einen Neustart.
id: Kadang-kadang node komputasi macet secara tak terduga atau membutuhkan reboot untuk alasan pemeliharaan.

source: Sometimes a share may appear and then hang in an erroneous or a transitional state. Unprivileged users do not have the appropriate access rights to correct this situation. However, having cloud administrator's permissions, you can reset the share's state by using
de: Manchmal kann eine Freigabe erscheinen und dann in einem fehlerhaften oder Übergangszustand hängen. Unprivilegierte Benutzer verfügen nicht über die entsprechenden Zugriffsrechte, um diese Situation zu beheben. Wenn Sie jedoch über die Berechtigungen des Cloud-Administrators verfügen, können Sie den Status der Freigabe zurücksetzen, indem Sie Folgendes verwenden

source: Sometimes a user and a group have a one-to-one mapping. This happens for standard system accounts, such as cinder, glance, nova, and swift, or when only one user is part of a group.
de: Manchmal haben ein Benutzer und eine Gruppe eine Eins-zu-Eins Zuordnung. Dies geschieht für Standard-Systemkonten wie Cinder, Glance, Nova und Swift oder wenn nur ein Benutzer Teil einer Gruppe ist.
id: Terkadang pengguna dan grup memiliki pemetaan satu-ke-satu. Ini terjadi untuk akun sistem standar, seperti cinder, glance, nova, dan swift, atau ketika hanya satu pengguna yang merupakan bagian dari grup.
