Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: For further research about OpenStack deployment, investigate the supported and documented preconfigured, prepackaged installers for OpenStack from companies such as `Canonical <https://www.ubuntu.com/openstack>`_, `Cisco <https://www.cisco.com/c/en/us/solutions/data-center-virtualization/openstack-at-cisco/index.html>`_, `Cloudscaling <http://cloudscaling.com/blog/>`_, `IBM <http://www-03.ibm.com/software/products/en/ibm-cloud-orchestrator>`_, `Metacloud <http://www.cisco.com/c/en/us/products/cloud-systems-management/metacloud/index.html>`_, `Mirantis <https://www.mirantis.com>`_, `Rackspace <https://www.rackspace.com/cloud/private>`_, `Red Hat <https://www.redhat.com/openstack>`_, `SUSE <https://www.suse.com/products/suse-openstack-cloud>`_, and `SwiftStack <https://www.swiftstack.com>`_.
de: Für weitere Informationen über die OpenStack-Bereitstellung untersuchen Sie die unterstützten und dokumentierten vorkonfigurierten, vorkonfigurierten Installationsprogramme für OpenStack von Unternehmen wie `Canonical <https://www.ubuntu.com/openstack>`_, `Cisco <https://www.cisco.com/c/en/us/solutions/data-center-virtualization/openstack-at-cisco/index.html>`_, `Cloudscaling <http://cloudscaling.com/blog/>`_, `IBM <http://www-03.ibm.com/software/products/en/ibm-cloud-orchestrator>`_, `Metacloud <http://www.cisco.com/c/en/us/products/cloud-systems-management/metacloud/index.html>`_, `Mirantis <https://www.mirantis.com>`_, `Rackspace <https://www.rackspace.com/cloud/private>`_, `Red Hat <https://www.redhat.com/openstack>`_, `SUSE <https://www.suse.com/products/suse-openstack-cloud>`_, und `SwiftStack <https://www.swiftstack.com>`_.
id: Untuk penelitian lebih lanjut tentang penyebaran OpenStack, selidiki installer prakonfigurasi yang didukung dan didokumentasikan, yang telah dikemas untuk OpenStack dari perusahaan seperti `Canonical <https://www.ubuntu.com/openstack>`_, `Cisco <https://www.cisco.com/c/en/us/solutions/data-center-virtualization/openstack-at-cisco/index.html>`_, `Cloudscaling <http://cloudscaling.com/blog/>`_, `IBM <http://www-03.ibm.com/software/products/en/ibm-cloud-orchestrator>`_, `Metacloud <http://www.cisco.com/c/en/us/products/cloud-systems-management/metacloud/index.html>`_, `Mirantis <https://www.mirantis.com>`_, `Rackspace <https://www.rackspace.com/cloud/private>`_, `Red Hat <https://www.redhat.com/openstack>`_, `SUSE <https://www.suse.com/products/suse-openstack-cloud>`_, dan `SwiftStack <https://www.swiftstack.com>`_.

source: For instructions on installing, upgrading, or removing command-line clients, see the `Install the OpenStack command-line client <https://docs.openstack.org/python-openstackclient/latest/>`_.
de: Anweisungen zum Installieren, Aktualisieren oder Entfernen von Befehlszeilen-Clients finden Sie unter `Installieren des OpenStack-Kommandozeilen-Clients <https://docs.openstack.org/python-openstackclient/latest/>`_.
id: Untuk instruksi tentang menginstal, memutakhirkan, atau menghapus klien command-line client, lihat `Install the OpenStack command-line client <https://docs.openstack.org/python-openstackclient/latest/>`_.

source: For more details and additional information about other cases, features, API commands etc, see `Share Management <https://docs.openstack.org/admin-guide/shared-file-systems-share-management.html>`__ of “Shared File Systems” section of OpenStack Administrator Guide document.
de: Weitere Details und zusätzliche Informationen zu anderen Fällen, Funktionen, API-Befehlen usw. finden Sie unter `Share Management <https://docs.openstack.org/admin-guide/shared-file-systems-share-management.html>`__ im Abschnitt "Shared File Systems" im OpenStack Administrator Guide Dokument.

source: For more details and additional information on snapshots, see `Share Snapshots <https://docs.openstack.org/admin-guide/shared-file-systems-snapshots.html>`__ of “Shared File Systems” section of “OpenStack Administrator Guide” document.
de: Weitere Details und zusätzliche Informationen zu Schattenkopien finden Sie unter `Share Snapshots <https://docs.openstack.org/admin-guide/shared-file-systems-snapshots.html>`__ im Abschnitt "Shared File Systems" im Dokument "OpenStack Administrator Guide".

source: For more information OpenStack Security, see the `OpenStack Security Guide <https://docs.openstack.org/security-guide/>`_.
de: Weitere Informationen zu OpenStack Security finden Sie im `OpenStack Security Guide <https://docs.openstack.org/security-guide/>`_.
id: Untuk informasi lebih lanjut, OpenStack Security, lihat `OpenStack Security Guide <https://docs.openstack.org/security-guide/>`_.

source: For more information about updating Block Storage volumes (for example, resizing or transferring), see the `OpenStack End User Guide <https://docs.openstack.org/user-guide/common/cli-manage-volumes.html>`__.
de: Weitere Informationen zum Aktualisieren von Blockspeicher-Datenträgern (z.B. Größenänderung oder Übertragung) finden Sie im `OpenStack End User Guide <https://docs.openstack.org/user-guide/common/cli-manage-volumes.html>`__.
id: Untuk informasi lebih lanjut tentang memperbarui volume Block Storage (misalnya, mengubah ukuran atau mentransfer), lihat `OpenStack End User Guide <https://docs.openstack.org/user-guide/common/cli-manage-volumes.html>`__.

source: For more information on installing DevStack, see the `DevStack <https://docs.openstack.org/devstack/latest/>`_ website.
de: Weitere Informationen zur Installation von DevStack finden Sie auf der Website von `DevStack <https://docs.openstack.org/devstack/latest/>`_.
id: Untuk informasi lebih lanjut tentang menginstal DevStack, lihat `DevStack <https://docs.openstack.org/devstack/latest/>`_ situs web.

source: For more information on share management see `Share management <https://docs.openstack.org/manila/latest/admin/shared-file-systems-share-management.html>`__ in OpenStack Manila Administrator Guide. As to Security services, you should remember that different drivers support different authentication methods, while generic driver does not support Security Services at all (see section `Security services <https://docs.openstack.org/manila/latest/admin/shared-file-systems-security-services.html>`__ in OpenStack Manila Administrator Guide).
de: Weitere Informationen zur Share-Verwaltung finden Sie unter `Share-Verwaltung <https://docs.openstack.org/manila/latest/admin/shared-file-systems-share-management.html>`__ im OpenStack Manila Administrator Guide. Was die Sicherheitsdienste betrifft, sollten Sie daran denken, dass verschiedene Treiber unterschiedliche Authentifizierungsmethoden unterstützen, während der generische Treiber die Sicherheitsdienste überhaupt nicht unterstützt (siehe Abschnitt `Sicherheitsdienste <https://docs.openstack.org/manila/latest/admin/shared-file-systems-security-services.html>`__ im OpenStack Manila Administrator Guide).
id: Untuk informasi lebih lanjut tentang manajemen berbagi, lihat `Share management <https://docs.openstack.org/manila/latest/admin/shared-file-systems-share-management.html>` __ dalam OpenStack Manila Administrator Guide. Mengenai layanan Security, Anda harus ingat bahwa driver yang berbeda mendukung metode otentikasi yang berbeda, sedangkan driver generik sama sekali tidak mendukung layanan Security (lihat bagian `Security services <https://docs.openstack.org/manila/latest/admin/ Shared -file-systems-security-services.html> `__ di OpenStack Manila Administrator Guide).

source: For more information, see See also `NIST Special Publication 800-53 <https://web.nvd.nist.gov/view/800-53/>`_.
de: Weitere Informationen finden Sie unter `NIST-Sonderveröffentlichung 800-53 <https://web.nvd.nist.gov/view/800-53/>`_.
id: Untuk informasi lebih lanjut, lihat Lihat juga `NIST Special Publication 800-53 <https://web.nvd.nist.gov/view/800-53/>`_.

source: For more information, see `RabbitMQ documentation <https://www.rabbitmq.com/partitions.html>`_.
de: Weitere Informationen finden Sie unter `RabbitMQ-Dokumentation <https://www.rabbitmq.com/partitions.html>`_.
id: Untuk informasi lebih lanjut, lihat `RabbitMQ documentation <https://www.rabbitmq.com/partitions.html>`_.

source: For readers who need to get a specialized feature into OpenStack, this chapter describes how to use DevStack to write custom middleware or a custom scheduler to rebalance your resources.
de: Für Leser, die eine spezielle Funktion in OpenStack benötigen, beschreibt dieses Kapitel, wie Sie DevStack verwenden können, um benutzerdefinierte Middleware oder einen benutzerdefinierten Scheduler zu schreiben, um Ihre Ressourcen auszugleichen.

source: For resource alerting, for example, monitor disk capacity on a compute node with Nagios, add the following to your Nagios configuration:
de: Für Ressourcenalarmierung, z.B. die Überwachung der Festplattenkapazität auf einem Compute-Knoten mit Nagios, fügen Sie Folgendes zu Ihrer Nagios-Konfiguration hinzu:
id: Untuk peringatan sumber daya, misalnya, monitor kapasitas disk pada node komputasi dengan Nagios, tambahkan yang berikut ini ke konfigurasi Nagios Anda:

source: For stable operations, you want to detect failure promptly and determine causes efficiently. With a distributed system, it's even more important to track the right items to meet a service-level target. Learning where these logs are located in the file system or API gives you an advantage. This chapter also showed how to read, interpret, and manipulate information from OpenStack services so that you can monitor effectively.
de: Für einen stabilen Betrieb wollen Sie Fehler frühzeitig erkennen und Ursachen effizient ermitteln. Bei einem verteilten System ist es umso wichtiger, die richtigen Elemente zu verfolgen, um ein Service Level Ziel zu erreichen. Zu erfahren, wo sich diese Protokolle im Dateisystem oder in der API befinden, ist von Vorteil. In diesem Kapitel wurde auch gezeigt, wie man Informationen aus OpenStack-Diensten liest, interpretiert und manipuliert, damit Sie effektiv überwachen können.
id: Untuk operasi yang stabil, Anda ingin mendeteksi kegagalan dengan segera dan menentukan penyebab secara efisien. Dengan sistem terdistribusi, bahkan lebih penting untuk melacak item yang tepat untuk memenuhi target tingkat layanan. Belajar di mana log ini berada di sistem file atau API memberi Anda keuntungan. Bab ini juga menunjukkan cara membaca, menafsirkan, dan memanipulasi informasi dari layanan OpenStack sehingga Anda dapat memonitor secara efektif.

source: For the cloud controller, the good news is if your cloud is using the FlatDHCP multi-host HA network mode, existing instances and volumes continue to operate while the cloud controller is offline. For the storage proxy, however, no storage traffic is possible until it is back up and running.
de: Für den Cloud-Controller ist die gute Nachricht, wenn Ihre Cloud den FlatDHCP Multi-Host-HA-Netzwerkmodus verwendet, bestehende Instanzen und Volumes weiterarbeiten, während der Cloud-Controller offline ist. Für den Speicherproxy ist jedoch kein Speicherdatenverkehr möglich, bis er wieder in Betrieb ist.
id: Untuk pengendali cloud, kabar baiknya adalah jika cloud Anda menggunakan mode jaringan HA multi-host FlatDHCP, instance dan volume yang ada terus beroperasi saat pengendali cloud sedang offline. Untuk proksi penyimpanan, bagaimanapun, tidak ada lalu lintas penyimpanan yang mungkin sampai itu kembali dan berjalan.

source: For the details of features supported by different drivers see `Manila share features support mapping <https://docs.openstack.org/manila/latest/admin/index.html#supported-share-back-ends>`__ of Manila Developer Guide document.
de: Für die Details der Funktionen, die von verschiedenen Treibern unterstützt werden, siehe `Manila share features support mapping <https://docs.openstack.org/manila/latest/admin/index.html#supported-share-back-ends>`__ im Manila Developer Guide Dokument.

source: For the second path, you can write new features and plug them in using changes to a configuration file. If the project where your feature would need to reside uses the Python Paste framework, you can create middleware for it and plug it in through configuration. There may also be specific ways of customizing a project, such as creating a new scheduler driver for Compute or a custom tab for the dashboard.
de: Für den zweiten Pfad können Sie neue Features schreiben und diese über Änderungen an einer Konfigurationsdatei einbinden. Wenn das Projekt, in dem sich Ihre Funktion befinden müsste, das Python Paste Framework verwendet, können Sie Middleware dafür erstellen und über die Konfiguration einbinden. Es kann auch spezifische Möglichkeiten zur Anpassung eines Projekts geben, wie z.B. das Erstellen eines neuen Scheduler-Treibers für Compute oder einer benutzerdefinierten Registerkarte für das Dashboard.
id: Untuk jalur kedua, Anda dapat menulis fitur baru dan menghubungkannya dengan menggunakan perubahan pada file konfigurasi. Jika proyek tempat fitur Anda harus berada menggunakan framework Python Paste, Anda dapat membuat middleware untuk itu dan menghubungkannya melalui konfigurasi. Mungkin juga ada cara-cara khusus untuk menyesuaikan proyek, seperti membuat driver penjadwal baru untuk Compute atau tab khusus untuk dasbor.

source: For the storage proxy, ensure that the :term:`Object Storage service <Object Storage service (swift)>` has resumed:
de: Stellen Sie für den Speicherproxy sicher, dass der :term:`Object Storage service <Object Storage service (swift)>` wieder aufgenommen wurde:
id: Untuk proxy penyimpanan, pastikan bahwa :term:`Object Storage service <Object Storage service (swift)>` telah dilanjutkan:

source: For this example, we will use the Open vSwitch (OVS) back end. Other back-end plug-ins will have very different flow paths. OVS is the most popularly deployed network driver, according to the April 2016 OpenStack User Survey. We'll describe each step in turn, with :ref:`network_paths` for reference.
de: Für dieses Beispiel verwenden wir das Open vSwitch (OVS) Backend. Andere Backend-Plug-Ins haben sehr unterschiedliche Fließwege. Laut der OpenStack User Survey vom April 2016 ist OVS der am häufigsten eingesetzte Netzwerktreiber. Wir werden jeden Schritt nacheinander beschreiben, mit :ref:`network_paths` als Referenz.
id: Untuk contoh ini, kita akan menggunakan back end Open vSwitch (OVS). Plug-in back-end lainnya akan memiliki jalur aliran yang sangat berbeda. OVS adalah driver jaringan yang paling populer digunakan, menurut Survei Pengguna OpenStack April 2016. Kami akan menjelaskan setiap langkah pada gilirannya, dengan :ref:`network_paths` sebagai referensi.

source: Freeze the system
de: Einfrieren des Systems

source: From here, click the :guilabel:`+` icon to add users to the project. Click the :guilabel:`-` to remove them.
de: Klicken Sie von hier aus auf das Symbol :guilabel:`+`, um Benutzer zum Projekt hinzuzufügen. Klicken Sie auf das :Guilabel:`-`, um sie zu entfernen.

source: From the command line, do this:
de: Führen Sie dies über die Befehlszeile aus:

source: From the vnet NIC, the packet transfers to a bridge on the compute node, such as ``br100``.
de: Vom vnet-NIC aus überträgt das Paket zu einer Brücke auf dem Compute-Knoten, wie z.B. ``br100``.
id: Dari vnet NIC, paket mentransfer ke sebuah jembatan (bridge) di node komputasi, seperti ``br100``.

source: From these tables, you can see that a floating IP is technically never directly related to an instance; it must always go through a fixed IP.
de: Aus diesen Tabellen können Sie ersehen, dass eine Floating IP technisch gesehen nie direkt mit einer Instanz in Verbindung steht, sondern immer über eine feste IP laufen muss.
id: Dari tabel ini, Anda dapat melihat bahwa IP mengambang secara teknis tidak pernah terkait langsung dengan instance; itu harus selalu melalui IP tetap.

source: From this view, you can do a number of useful things, as well as a few dangerous ones.
de: Aus dieser Sicht kannst du eine Reihe nützlicher Dinge tun, ebenso wie einige gefährliche.

source: From this you see that the DHCP server on that network is using the ``tape6256f7d-31`` device and has an IP address of ``10.0.1.100``. Seeing the address ``169.254.169.254``, you can also see that the dhcp-agent is running a metadata-proxy service. Any of the commands mentioned previously in this chapter can be run in the same way. It is also possible to run a shell, such as ``bash``, and have an interactive session within the namespace. In the latter case, exiting the shell returns you to the top-level default namespace.
de: Daraus ersehen Sie, dass der DHCP-Server in diesem Netzwerk das Gerät ``tape6256f7d-31`` verwendet und eine IP-Adresse von ``10.0.1.100`` hat. Wenn Sie die Adresse ``169.254.169.169.254`` sehen, können Sie auch sehen, dass der dhcp-Agent einen Metadaten-Proxy-Dienst betreibt. Jeder der zuvor in diesem Kapitel erwähnten Befehle kann auf die gleiche Weise ausgeführt werden. Es ist auch möglich, eine Shell, wie z.B. ``bash``, auszuführen und eine interaktive Sitzung innerhalb des Namensraums durchzuführen. Im letzteren Fall kehren Sie durch das Verlassen der Shell in den obersten Standard-Namensraum zurück.
id: Dari sini Anda melihat bahwa server DHCP pada jaringan itu menggunakan perangkat ``tape6256f7d-31`` dan memiliki alamat IP ``10.0.1.100``. Melihat alamat ``169.254.169.254``, Anda juga dapat melihat bahwa agen dhcp menjalankan layanan proxy-metadata. Perintah apa pun yang disebutkan sebelumnya dalam bab ini dapat dijalankan dengan cara yang sama. Dimungkinkan juga untuk menjalankan shell, seperti ``bash``, dan memiliki sesi interaktif di dalam namespace. Dalam kasus terakhir, keluar dari shell mengembalikan Anda ke namespace default tingkat atas.

source: Functional testing like this is not a replacement for proper unit and integration testing, but it serves to get you started.
de: Funktionstests wie dieser sind kein Ersatz für richtige Geräte- und Integrationstests, aber sie dienen dazu, Ihnen den Einstieg zu erleichtern.
id: Pengujian fungsional seperti ini bukan pengganti untuk pengujian unit dan integrasi yang tepat, tetapi berfungsi untuk membantu Anda memulai.

source: Further Reading
de: Weiterführende Literatur

source: Further days go by and we catch The Issue in action more and more. We find that dhclient is not running after The Issue happens. Now we're back to thinking it's a DHCP issue. Running ``/etc/init.d/networking`` restart brings everything back up and running.
de: Weitere Tage vergehen und wir sehen Das Problem immer öfter in Aktion. Wir stellen fest, dass dhclient nicht ausgeführt wird, nachdem das Problem aufgetreten ist. Jetzt denken wir wieder, dass es sich um ein DHCP-Problem handelt. Der Neustart von ``/etc/init.d/networking`` bringt alles wieder in Gang.
id: Hari-hari selanjutnya berlalu dan kami terus menangkap isu ini. Kami menemukan bahwa dhclient tidak berjalan setelah The Issue terjadi. Sekarang kita kembali berpikir itu masalah DHCP. Menjalankan restart ``/etc/init.d/networking`` membawa semuanya kembali dan berjalan.

source: Further troubleshooting showed that libvirt was not running at all. This made more sense. If libvirt wasn't running, then no instance could be virtualized through KVM. Upon trying to start libvirt, it would silently die immediately. The libvirt logs did not explain why.
de: Weitere Fehlerbehebungen zeigten, dass libvirt überhaupt nicht lief. Das machte mehr Sinn. Wenn libvirt nicht ausgeführt wurde, konnte keine Instanz über KVM virtualisiert werden. Beim Versuch, libvirt zu starten, würde es lautlos sofort sterben. Die libvirt Protokolle erklärten nicht, warum.
id: Pemecahan masalah lebih lanjut menunjukkan bahwa libvirt tidak berjalan sama sekali. Ini lebih masuk akal. Jika libvirt tidak berjalan, maka tidak ada instance yang dapat divirtualisasikan melalui KVM. Setelah mencoba memulai libvirt, ia akan segera mati secara diam-diam. Log libvirt tidak menjelaskan alasannya.

source: GRE-based networks are passed with ``patch-tun`` to the tunnel bridge ``br-tun`` on interface ``patch-int``. This bridge also contains one port for each GRE tunnel peer, so one for each compute node and network node in your network. The ports are named sequentially from ``gre-1`` onward.
de: GRE-basierte Netzwerke werden mit ``patch-tun`` zur Tunnelbrücke ``br-tun`` an der Schnittstelle ``patch-int`` übergeben. Diese Brücke enthält auch einen Port für jeden GRE-Tunnel-Peer, also einen für jeden Compute-Knoten und Netzwerkknoten in Ihrem Netzwerk. Die Ports werden ab ``gre-1`` sequentiell benannt.
id: Jaringan berbasis GRE diteruskan dengan ``patch-tun`` ke bridge tunnel ``br-tun`` pada antarmuka ``patch-int``. Jembatan ini juga berisi satu port untuk setiap peer tunnel GRE, jadi satu untuk setiap node komputasi dan node jaringan di jaringan Anda. Port diberi nama secara berurutan dari ``gre-1`` dan seterusnya.

source: GRE-based networks will be passed to the tunnel bridge ``br-tun``, which behaves just like the GRE interfaces on the compute node.
de: GRE-basierte Netzwerke werden an die Tunnelbrücke ``br-tun`` übergeben, die sich genauso verhält wie die GRE-Schnittstellen auf dem Compute-Knoten.
id: Jaringan berbasis GRE akan diteruskan ke bridge tunnel ``br-tun``, yang berperilaku seperti antarmuka GRE pada node komputasi.

source: Generally, deleting an image does not affect instances or snapshots that were based on the image. However, some drivers may require the original image to be present to perform a migration. For example, XenAPI live-migrate will work fine if the image is deleted, but libvirt will fail.
de: Im Allgemeinen hat das Löschen eines Abbildes keinen Einfluss auf Instanzen oder Schattenkopien, die auf dem Abbild basieren. Einige Treiber können jedoch verlangen, dass das Originalabbild vorhanden ist, um eine Migration durchzuführen. Beispielsweise funktioniert die XenAPI-Live-Migration gut, wenn das Abbild gelöscht wird, aber libvirt schlägt fehl.
id: Secara umum, menghapus image tidak memengaruhi instance atau snapshot yang didasarkan pada image. Namun, beberapa driver mungkin memerlukan image asli untuk hadir untuk melakukan migrasi. Misalnya, migrasi langsung XenAPI akan berfungsi dengan baik jika image dihapus, tetapi libvirt akan gagal.

source: Generate signature of image and convert it to a base64 representation:
de: Erzeugen Sie eine Signatur des Abbildes und konvertieren Sie es in eine base64-Darstellung:
id: Hasilkan signature of imager dan mengubahnya menjadi representasi base64:

source: Generic rules
de: Allgemeine Regeln

source: Geographical Considerations for Object Storage
de: Geographische Überlegungen zur Objektspeicherung
id: Pertimbangan Geografis untuk Object Storage

source: Get a list of instances that need to be moved:
de: Ermittelt eine Liste der Instanzen, die verschoben werden müssen:
id: Dapatkan daftar instance yang perlu dipindahkan:

source: Getting Credentials
de: Erhalten von Anmeldeinformationen
id: Mendapatkan Kredensial

source: Getting Started with OpenStack
de: Erste Schritte mit OpenStack

source: Go back to the first step and try restarting the RabbitMQ service again. If you still have errors, remove the contents in the ``/var/lib/rabbitmq/mnesia/`` directory between stopping and starting the RabbitMQ service.
de: Gehen Sie zurück zum ersten Schritt und versuchen Sie, den RabbitMQ-Dienst erneut zu starten. Wenn Sie immer noch Fehler haben, entfernen Sie den Inhalt im Verzeichnis ``/var/lib/rabbitmq/mnesia/`` zwischen dem Beenden und Starten des RabbitMQ-Dienstes.
id: Kembali ke langkah pertama dan coba restart layanan RabbitMQ lagi. Jika Anda masih memiliki kesalahan, hapus konten di direktori ``/var/lib/rabbitmq/mnesia/`` antara berhenti dan memulai layanan RabbitMQ.

source: Good Luck!
de: Viel Glück!
