Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: Using a share network is optional. However if you need one, check if there is an appropriate network defined in Shared File Systems service by using :command:`manila share-network-list` command. For the information on creating a share network, see :ref:`create_a_share_network` below in this chapter.
de: Die Verwendung eines Freigabe-Netzwerks ist optional. Wenn Sie jedoch ein solches benötigen, überprüfen Sie, ob im Dienst Shared File Systems ein geeignetes Netzwerk definiert ist, indem Sie den Befehl :command:`manila share-network-list` verwenden. Informationen zum Erstellen eines Freigabenetzwerks finden Sie weiter unten in diesem Kapitel unter :ref:`create_a_share_network`.

source: Using administrator credentials, confirm the lost IP address is still available:
de: Vergewissern Sie sich anhand von Administrator-Anmeldeinformationen, dass die verlorene IP-Adresse noch verfügbar ist:
id: Menggunakan kredensial administrator, konfirmasi alamat IP yang hilang masih tersedia:

source: Using cURL for further inspection
de: cURL für die weitere Inspektion verwenden
id: Menggunakan cURL untuk pemeriksaan lebih lanjut

source: Using ip a to Check Interface States
de: Verwenden von ip a zum Überprüfen von Schnittstellenzuständen
id: Menggunakan IP untuk Memeriksa Status Antarmuka

source: Using remote resources for collection, processing, storage, and retrieval provides potential benefits to businesses. With the rapid growth of data within organizations, businesses need to be proactive about their data storage strategies from a compliance point of view.
de: Die Nutzung von Remote-Ressourcen für die Erfassung, Verarbeitung, Speicherung und Abfrage bietet Unternehmen potenzielle Vorteile. Mit dem rasanten Wachstum von Daten in Unternehmen müssen Unternehmen ihre Datenspeicherstrategien aus Compliance-Sicht proaktiv angehen.
id: Menggunakan sumber daya jarak jauh untuk pengumpulan, pemrosesan, penyimpanan, dan pengambilan memberikan potensi keuntungan bagi bisnis. Dengan pertumbuhan data yang cepat di dalam organisasi, bisnis harus proaktif tentang strategi penyimpanan data mereka dari sudut pandang kepatuhan.

source: Using the OpenStack Dashboard for Administration
de: Verwendung des OpenStack Dashboards für die Administration
id: Menggunakan OpenStack Dashboard untuk Administrasi

source: Using the command-line interface, you can manage quotas for the OpenStack Compute service and the Block Storage service.
de: Mit der Befehlszeilenschnittstelle können Sie Quoten für den OpenStack Compute-Dienst und den Blockspeicherdienst verwalten.
id: Menggunakan antarmuka ommand-line, Anda dapat mengelola kuota untuk layanan OpenStack Compute dan layanan Block Storage.

source: Using this functionality, ideally one would lock the RPC version to the OpenStack version being upgraded from on nova-compute nodes, to ensure that, for example X+1 version nova-compute processes will continue to work with X version nova-conductor processes while the upgrade completes. Once the upgrade of nova-compute processes is complete, the operator can move onto upgrading nova-conductor and remove the version locking for nova-compute in ``nova.conf``.
de: Mit dieser Funktionalität würde man idealerweise die RPC-Version an die OpenStack-Version binden, die von nova-compute nodes aktualisiert wird, um sicherzustellen, dass z.B. X+1-Version nova-compute-Prozesse weiterhin mit X-Version nova-conductor-Prozessen arbeiten, während das Upgrade abgeschlossen ist. Nach Abschluss des Upgrades der nova-compute-Prozesse kann der Betreiber mit dem Upgrade von nova-conductor fortfahren und die Versionssperre für nova-compute in ``nova.conf`` entfernen.
id: Dengan menggunakan fungsi ini, idealnya seseorang akan mengunci versi RPC ke versi OpenStack yang upgraded dari pada nova-compute nodes, untuk memastikan bahwa, misalnya X+1 versi proses nova-compute akan terus bekerja dengan versi X proses nova-conductor sementara upgrade selesai. Setelah upgrade proses nova-compute selesai, operator dapat beralih ke upgrading nova-conductor dan menghapus penguncian versi untuk nova-compute di ``nova.conf``.

source: VLAN tags are translated between the external tag defined in the network settings, and internal tags in several places. On the ``br-int``, incoming packets from the ``int-br-eth1`` are translated from external tags to internal tags. Other translations also happen on the other bridges and will be discussed in those sections.
de: VLAN-Tags werden zwischen dem in den Netzwerkeinstellungen definierten externen Tag und internen Tags an mehreren Stellen übersetzt. Auf dem ``br-int`` werden eingehende Pakete vom ``int-br-eth1`` von externen Tags in interne Tags umgewandelt. Andere Übersetzungen finden auch auf den anderen Brücken statt und werden in diesen Abschnitten behandelt.
id: Tag VLAN diterjemahkan antara tag eksternal yang ditentukan dalam pengaturan jaringan, dan tag internal di beberapa tempat. Pada ``br-int``, paket yang masuk dari ``int-br-eth1`` diterjemahkan dari tag eksternal ke tag internal. Terjemahan lain juga terjadi di jembatan lain dan akan dibahas di bagian-bagian tersebut.

source: VLAN-based networks are received as tagged packets on a physical network interface, ``eth1`` in this example. Just as on the compute node, this interface is a member of the ``br-eth1`` bridge.
de: VLAN-basierte Netzwerke werden als markierte Pakete auf einer physikalischen Netzwerkschnittstelle empfangen, in diesem Beispiel ``eth1``. Genau wie auf dem Compute-Knoten ist diese Schnittstelle ein Element der ``br-eth1`` Brücke.
id: Jaringan berbasis VLAN diterima sebagai paket yang ditandai pada antarmuka jaringan fisik, ``eth1`` dalam contoh ini. Sama seperti pada node komputasi, antarmuka ini adalah anggota dari jembatan ``br-eth1``.

source: VLAN-based networks exit the integration bridge via veth interface ``int-br-eth1`` and arrive on the bridge ``br-eth1`` on the other member of the veth pair ``phy-br-eth1``. Packets on this interface arrive with internal VLAN tags and are translated to external tags in the reverse of the process described above:
de: VLAN-basierte Netzwerke verlassen die Integrationsbrücke über die veth-Schnittstelle ``int-br-eth1`` und gelangen auf die Brücke ``br-eth1`` auf das andere Mitglied des Veth-Paares ``phy-br-eth1``. Pakete auf dieser Schnittstelle kommen mit internen VLAN-Tags an und werden in umgekehrter Reihenfolge des oben beschriebenen Prozesses in externe Tags übersetzt:
id: Jaringan berbasis VLAN keluar dari jembatan integrasi melalui antarmuka veth ``int-br-eth1`` dan tiba di jembatan ``br-eth1`` pada anggota lain dari pasangan veth ``phy-br-eth1``. Paket pada antarmuka ini tiba dengan tag VLAN internal dan diterjemahkan ke tag eksternal sebagai kebalikan dari proses yang dijelaskan di atas:

source: Value
de: Wert

source: Verify RabbitMQ processes are running:
de: Überprüfen Sie, ob RabbitMQ-Prozesse ausgeführt werden:
id: Verifikasi proses RabbitMQ berjalan:

source: Verify proper operation of your environment. Then, notify your users that their cloud is operating normally again.
de: Überprüfen Sie den ordnungsgemäßen Betrieb Ihrer Umgebung. Benachrichtigen Sie dann Ihre Benutzer, dass ihre Cloud wieder normal funktioniert.
id: Verifikasi pengoperasian lingkungan Anda dengan benar. Lalu, beri tahu pengguna Anda bahwa cloud mereka beroperasi secara normal lagi.

source: Verify that all hosted instances have been moved off the node:
de: Stellen Sie sicher, dass alle bereitgestellten Instanzen vom Knoten entfernt wurden:
id: Verifikasi bahwa semua instance yang dihosting telah dipindahkan dari simpul:

source: Verify the Keystone URL
de: Überprüfen Sie die Keystone-URL
id: Verifikasi URL Keystone

source: Verify the instance has the correct IP address:
de: Vergewissern Sie sich, dass die Instanz die richtige IP-Adresse hat:
id: Pastikan instance memiliki alamat IP yang benar:

source: Verify your alert mechanisms are still working.
de: Vergewissern Sie sich, dass Ihre Warnmechanismen noch funktionieren.
id: Verifikasi mekanisme peringatan Anda masih berfungsi.

source: View and update Block Storage quotas for a tenant (project)
de: Anzeigen und Aktualisieren von Blockspeicher-Quoten für einen Mandant (Projekt)
id: Lihat dan perbarui kuota Block Storage untuk tenant (project)

source: View and update compute quotas for a tenant (project)
de: Anzeigen und Aktualisieren von Berechnungsquoten für einen Mandanten (Projekt)
id: Lihat dan perbarui kuota komputasi untuk tenant (proyek)

source: View quotas for the tenant, as follows:
de: Betrachten Sie die Kontingente für den Mandant wie folgt:
id: Lihat kuota untuk tenant, sebagai berikut:

source: Virtual cores
de: Virtuelle Kerne

source: Virtual hardware templates are called "flavors" in OpenStack, defining sizes for RAM, disk, number of cores, and so on. The default install provides five flavors.
de: Virtuelle Hardware-Vorlagen werden in OpenStack als "Varianten" bezeichnet und definieren Größen für RAM, Festplatte, Anzahl der Kerne usw. Die Standardinstallation bietet fünf Varianten.
id: Template perangkat keras virtual disebut "flavors" di OpenStack, yang menentukan ukuran untuk RAM, disk, jumlah core, dan sebagainya. Instalasi default menyediakan lima flavor.

source: Virtual machine memory in megabytes.
de: Speicher der virtuellen Maschine in Megabyte.
id: Memori mesin virtual dalam megabytes.

source: Virtual root disk size in gigabytes. This is an ephemeral disk the base image is copied into. You don't use it when you boot from a persistent volume. The "0" size is a special case that uses the native base image size as the size of the ephemeral root volume.
de: Größe der virtuellen Root-Festplatte in Gigabyte. Dies ist eine ephemere Festplatte, in die das Basis-Abbild kopiert wird. Sie verwenden es nicht, wenn Sie von einem persistenten Datenträger booten. Die Größe "0" ist ein Sonderfall, der die native Größe des Basisabbbildes als Größe des ephemeren root-Datenträgers verwendet.
id: Ukuran disk root virtual dalam gigabytes. Ini adalah cakram ephemeral tempat image dasar disalin. Anda tidak menggunakannya saat Anda boot dari volume persisten. Ukuran "0" adalah kasus khusus yang menggunakan ukuran image dasar asli (native base image size) sebagai ukuran volume root ephemeral.

source: Virtualization
de: Virtualisierung
id: Virtualization (virtualisasi)

source: Visualizing OpenStack Networking Service Traffic in the Cloud
de: Visualisierung des Verkehrs des OpenStack Netzwerkdienstes in der Cloud
id: Memvisualisasikan OpenStack Networking Service Traffic di Cloud

source: Visualizing nova-network Traffic in the Cloud
de: Visualisierung des nova-Netzwerkverkehrs in der Cloud
id: Memvisualisasikan nova-network Traffic di Cloud

source: VlanManager is used extensively for network management. All servers have two bonded 10GbE NICs that are connected to two redundant switches. DAIR is set up to use single-node networking where the cloud controller is the gateway for all instances on all compute nodes. Internal OpenStack traffic (for example, storage traffic) does not go through the cloud controller.
de: VlanManager wird häufig für das Netzwerkmanagement eingesetzt. Alle Server verfügen über zwei verbundene 10GbE-Netzwerke, die mit zwei redundanten Switches verbunden sind. DAIR ist für die Verwendung von Single-Node-Netzwerken eingerichtet, wobei der Cloud-Controller das Gateway für alle Instanzen auf allen Compute-Knoten ist. Der interne OpenStack-Verkehr (z.B. Speicher-Verkehr) läuft nicht über den Cloud-Controller.
id: VlanManager digunakan secara luas untuk manajemen jaringan. Semua server memiliki dua NIC 10GbE terikat yang terhubung ke dua sakelar switch. DAIR diatur untuk menggunakan jaringan node tunggal di mana pengontrol cloud adalah gateway untuk semua instance pada semua node komputasi. Lalu lintas OpenStack internal (misalnya, lalu lintas penyimpanan) tidak melalui pengontrol cloud.

source: Volumes
de: Datenträger

source: Wash, rinse, and repeat until you find the core cause of the problem.
de: Waschen, spülen und wiederholen, bis Sie die Kernursache des Problems gefunden haben.
id: Cuci, bilas, dan ulangi sampai Anda menemukan inti penyebab masalahnya.

source: Watch the network
de: Beobachten Sie das Netzwerk
id: Amati jaringannya

source: We also had some excellent input from outside of the room:
de: Wir hatten auch einen ausgezeichneten Input von außerhalb des Raumes:
id: Kami juga memiliki beberapa masukan yang sangat baik dari luar ruangan:

source: We approximate the older ``nova-network`` multi-host HA setup by using "provider VLAN networks" that connect instances directly to existing publicly addressable networks and use existing physical routers as their default gateway. This means that if our network controller goes down, running instances still have their network available, and no single Linux host becomes a traffic bottleneck. We are able to do this because we have a sufficient supply of IPv4 addresses to cover all of our instances and thus don't need NAT and don't use floating IP addresses. We provide a single generic public network to all projects and additional existing VLANs on a project-by-project basis as needed. Individual projects are also allowed to create their own private GRE based networks.
de: Wir nähern uns dem älteren ``nova-network`` Multi-Host-HA-Setup, indem wir "Provider-VLAN-Netzwerke" verwenden, die Instanzen direkt mit bestehenden öffentlich adressierbaren Netzwerken verbinden und bestehende physische Router als Standard-Gateway verwenden. Das bedeutet, dass, wenn unser Netzwerkkontroller ausfällt, laufende Instanzen noch ihr Netzwerk zur Verfügung haben und kein einziger Linux-Host zu einem Traffic-Engpass wird. Wir sind in der Lage, dies zu tun, weil wir über ein ausreichendes Angebot an IPv4-Adressen verfügen, um alle unsere Instanzen abzudecken, und somit kein NAT benötigen und keine Floating IP-Adressen verwenden. Wir stellen allen Projekten und zusätzlichen bestehenden VLANs bei Bedarf projektbezogen ein einziges generisches öffentliches Netzwerk zur Verfügung. Einzelne Projekte können auch ihre eigenen privaten GRE-basierten Netzwerke aufbauen.
id: Kami memperkirakan pengaturan HA multi-host ``nova-network `` yang lebih lama dengan menggunakan "provider VLAN networks" yang menghubungkan instance secara langsung ke jaringan yang dapat dialamatkan secara publik yang ada dan menggunakan router fisik yang ada sebagai gateway default mereka. Ini berarti bahwa jika pengontrol jaringan kami turun, instance yang berjalan masih memiliki jaringan mereka, dan tidak ada satu pun host Linux yang menjadi penghambat lalu lintas. Kami dapat melakukan ini karena kami memiliki pasokan alamat IPv4 yang cukup untuk menutupi semua instance kami dan karenanya tidak perlu NAT dan tidak menggunakan alamat IP mengambang. Kami menyediakan jaringan publik generik tunggal ke semua proyek dan tambahan VLAN yang ada berdasarkan proyek per proyek sesuai kebutuhan. Proyek individu juga diperbolehkan untuk membuat jaringan pribadi berbasis GRE mereka sendiri.

source: We called them and asked them to stop for a while, and they were happy to abandon the horribly broken VM. After that, we started monitoring the size of console logs.
de: Wir riefen sie an und baten sie, für eine Weile anzuhalten, und sie waren froh, die schrecklich kaputte VM aufzugeben. Danach begannen wir mit der Überwachung der Größe der Konsolenprotokolle.
id: Kami memanggil mereka dan meminta mereka untuk berhenti sebentar, dan mereka senang meninggalkan VM yang rusak parah. Setelah itu, kami mulai memonitor ukuran log konsol.

source: We couldn't have pulled it off without so much supportive help and encouragement.
de: Wir hätten es ohne so viel unterstützende Hilfe und Ermutigung nicht schaffen können.
id: Kami tidak akan berhasil tanpa bantuan dan dorongan yang begitu mendukung.

source: We decided to have ``tcpdump`` run on this instance and see if we could catch it in action again. Sure enough, we did.
de: Wir beschlossen, ``tcpdump`` auf dieser Instanz laufen zu lassen und zu sehen, ob wir sie wieder in Aktion fangen können. Tatsächlich haben wir das getan.
id: Kami memutuskan untuk menjalankan ``tcpdump`` pada instance ini dan melihat apakah kami dapat menjalankannya kembali. Cukup yakin, kami melakukannya.

source: We hope you have enjoyed this quick tour of your working environment, including how to interact with your cloud and extract useful information. From here, you can use the `OpenStack Administrator Guide <https://docs.openstack.org/latest/admin/>`_ as your reference for all of the command-line functionality in your cloud.
de: Wir hoffen, dass Ihnen diese kurze Tour durch Ihre Arbeitsumgebung gefallen hat, einschließlich der Interaktion mit Ihrer Cloud und der Extraktion nützlicher Informationen. Von hier aus können Sie das `OpenStack Administrator Guide <https://docs.openstack.org/latest/admin/>`_ als Referenz für alle Befehlszeilenfunktionen in Ihrer Cloud verwenden.
id: Kami harap Anda menikmati tur singkat ini di lingkungan kerja Anda, termasuk bagaimana berinteraksi dengan cloud Anda dan mengekstrak informasi yang berguna. Dari sini, Anda dapat menggunakan `OpenStack Administrator Guide <https://docs.openstack.org/latest/admin/>`_ sebagai referensi Anda untuk semua fungsi baris perintah di cloud Anda.

source: We initially deployed on Ubuntu 12.04 with the Essex release of OpenStack using FlatDHCP multi-host networking.
de: Wir haben ursprünglich auf Ubuntu 12.04 mit der Essex-Version von OpenStack unter Verwendung von FlatDHCP Multi-Host-Netzwerken eingesetzt.
id: Kami awalnya digunakan di Ubuntu 12.04 dengan rilis Essex OpenStack menggunakan jaringan multi-host FlatDHCP.

source: We reached out for help. A networking engineer suggested it was an MTU issue. Great! MTU! Something to go on! What's MTU and why would it cause a problem?
de: Wir griffen nach Hilfe. Ein Netzwerkingenieur schlug vor, es sei ein MTU-Problem. Großartig! MTU! Etwas, um weiterzumachen! Was ist die MTU und warum sollte sie ein Problem verursachen?
id: Kami mencari bantuan. Seorang insinyur jaringan menyarankan itu adalah masalah MTU. Besar! MTU! Sesuatu untuk terus berlanjut! Apa itu MTU dan mengapa itu menyebabkan masalah?

source: We recommend that you choose one of the following multiple disk options:
de: Wir empfehlen Ihnen, eine der folgenden Optionen für mehrere Festplatten zu wählen:
id: Kami menyarankan Anda memilih salah satu dari beberapa opsi disk berikut:

source: We recommend that you turn to the `Installation Tutorials and Guides <https://docs.openstack.org/install/>`_, which contains a step-by-step guide on how to manually install the OpenStack packages and dependencies on your cloud.
de: Wir empfehlen Ihnen, sich an die `Installations-Tutorials und -Anleitungen <https://docs.openstack.org/install/>`_ zu wenden, die eine Schritt-für-Schritt-Anleitung enthält, wie Sie die OpenStack-Pakete und -Abhängigkeiten manuell in Ihrer Cloud installieren.
id: Kami menyarankan Anda beralih ke `Installation Tutorials and Guides <https://docs.openstack.org/install/>`_, yang berisi panduan langkah demi langkah tentang cara menginstal paket OpenStack dan dependensi secara manual pada cloud Anda.

source: We recommend that you use the same hardware for new compute and block storage nodes. At the very least, ensure that the CPUs are similar in the compute nodes to not break live migration.
de: Wir empfehlen, dass Sie die gleiche Hardware für neue Rechen- und Blockspeicherknoten verwenden. Stellen Sie zumindest sicher, dass die CPUs in den Compute-Knoten ähnlich sind, um die Live-Migration nicht zu unterbrechen.
id: Kami menyarankan Anda menggunakan perangkat keras yang sama untuk komputasi dan memblokir node penyimpanan baru. Paling tidak, pastikan bahwa CPU serupa dalam node komputasi untuk tidak memutuskan migrasi langsung.

source: We recommend using a combination of the OpenStack command-line interface (CLI) tools and the OpenStack dashboard for administration. Some users with a background in other cloud technologies may be using the EC2 Compatibility API, which uses naming conventions somewhat different from the native API.
de: Wir empfehlen, für die Administration eine Kombination aus den OpenStack-Command-line Interface (CLI)-Tools und dem OpenStack Dashboard zu verwenden. Einige Benutzer mit Hintergrund in anderen Cloud-Technologien verwenden möglicherweise die EC2 Compatibility API, die Namenskonventionen verwendet, die sich etwas von der ursprünglichen API unterscheiden.
id: Kami merekomendasikan penggunaan kombinasi alat command-line interface (CLI) OpenStack dan dashboard OpenStack untuk administrasi. Beberapa pengguna dengan latar belakang dalam teknologi cloud lain mungkin menggunakan EC2 Compatibility API, yang menggunakan konvensi penamaan yang agak berbeda dari API asli.

source: We reviewed both sets of logs. The one thing that stood out the most was DHCP. At the time, OpenStack, by default, set DHCP leases for one minute (it's now two minutes). This means that every instance contacts the cloud controller (DHCP server) to renew its fixed IP. For some reason, this instance could not renew its IP. We correlated the instance's logs with the logs on the cloud controller and put together a conversation:
de: Wir haben beide Protokolle überprüft. Die eine Sache, die am meisten auffiel, war DHCP. Damals setzte OpenStack standardmäßig DHCP-Leases für eine Minute (jetzt sind es zwei Minuten). Das bedeutet, dass jede Instanz den Cloud Controller (DHCP-Server) kontaktiert, um seine feste IP zu erneuern. Aus irgendeinem Grund konnte diese Instanz ihre IP nicht verlängern. Wir haben die Logs der Instanz mit den Logs auf dem Cloud-Controller korreliert und ein Gespräch aufgebaut:
id: Kami meninjau kedua set log. Satu hal yang paling menonjol adalah DHCP. Pada saat itu, OpenStack, secara default, mengatur penyewaan DHCP selama satu menit (sekarang dua menit). Ini berarti bahwa setiap instance menghubungi pengendali cloud (server DHCP) untuk memperbarui IP tetapnya. Untuk beberapa alasan, instance ini tidak dapat memperbarui IP-nya. Kami mengkorelasikan log instance dengan log pada pengontrol cloud dan membuat percakapan:

source: We use the Puppet Labs OpenStack modules to configure Compute, Image service, Identity, and dashboard. Puppet is used widely for instance configuration, and Foreman is used as a GUI for reporting and instance provisioning.
de: Wir verwenden die Puppet Labs OpenStack-Module, um Compute, Image Service, Identity und Dashboard zu konfigurieren. Puppet wird häufig verwendet, z.B. zur Konfiguration, und Foreman wird als GUI für Reporting und Instanz-Provisionierung verwendet.
id: Kami menggunakan modul Puppet Labs OpenStack untuk mengonfigurasikan Compute, Image service, Identity, dan dashboard. Puppet digunakan secara luas untuk konfigurasi instance, dan Foreman digunakan sebagai GUI untuk pelaporan dan penyediaan instance.

source: We want to acknowledge our excellent host Rackers at Rackspace in Austin:
de: Wir möchten unsere hervorragenden Host-Racker bei Rackspace in Austin würdigen:
id: Kami ingin mengakui tuan rumah terbaik kami Rackers di Rackspace di Austin:

source: We wrote furiously from our own experiences and bounced ideas between each other. At regular intervals we reviewed the shape and organization of the book and further molded it, leading to what you see today.
de: Wir haben furios aus unseren eigenen Erfahrungen geschrieben und Ideen miteinander verknüpft. In regelmäßigen Abständen überprüften wir die Form und Organisation des Buches und formten es weiter, was zu dem führte, was Sie heute sehen.
