Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: The first step in finding the source of an error is typically to search for a CRITICAL, or ERROR message in the log starting at the bottom of the log file.
de: Der erste Schritt zum Auffinden der Fehlerursache ist in der Regel die Suche nach einer CRITICAL oder ERROR Meldung im Protokoll, beginnend am Ende der Protokolldatei.
id: Langkah pertama dalam menemukan sumber kesalahan biasanya untuk mencari pesan CRITICAL, atau ERROR dalam log mulai dari bagian bawah file log.

source: The first step is setting the aggregate metadata keys ``cpu_allocation_ratio`` and ``ram_allocation_ratio`` to a floating-point value. The filter schedulers ``AggregateCoreFilter`` and ``AggregateRamFilter`` will use those values rather than the global defaults in ``nova.conf`` when scheduling to hosts in the aggregate. Be cautious when using this feature, since each host can be in multiple aggregates, but should have only one allocation ratio for each resources. It is up to you to avoid putting a host in multiple aggregates that define different values for the same resource.
de: Der erste Schritt besteht darin, die aggregierten Metadatenschlüssel ``cpu_allocation_ratio`` und `ram_allocation_ratio`` auf einen Fließkommawert zu setzen. Die Filterplaner ``AggregateCoreFilter`` und ``AggregateRamFilter`` verwenden diese Werte anstelle der globalen Standardwerte in `nova.conf`` bei der Planung auf Hosts im Aggregat. Seien Sie vorsichtig bei der Verwendung dieser Funktion, da jeder Host in mehreren Aggregaten sein kann, aber nur ein Zuordnungsverhältnis für jede Ressource haben sollte. Es liegt an Ihnen, zu vermeiden, einen Host in mehrere Aggregate zu stecken, die unterschiedliche Werte für dieselbe Ressource definieren.
id: Langkah pertama adalah mengatur kunci metadata agregat ``cpu_allocation_ratio`` dan ``ram_allocation_ratio`` ke nilai floating-point. Penjadwal filter ``AggregateCoreFilter`` dan ``AggregateRamFilter`` akan menggunakan nilai-nilai itu daripada standar global di ``nova.conf`` saat menjadwalkan host di agregat. Berhati-hatilah saat menggunakan fitur ini, karena setiap host dapat terdiri dari beberapa agregat, tetapi harus hanya memiliki satu rasio alokasi untuk setiap sumber daya. Terserah Anda untuk menghindari menempatkan host dalam beberapa agregat yang menentukan nilai yang berbeda untuk sumber daya yang sama.

source: The first thing you must do is authenticate with the cloud using your credentials to get an :term:`authentication token`.
de: Das erste, was Sie tun müssen, ist, sich mit Ihren Anmeldeinformationen in der Cloud zu authentifizieren, um einen :term:`Authentifizierungstoken` zu erhalten.
id: Hal pertama yang harus Anda lakukan adalah mengautentikasi dengan cloud menggunakan kredensial Anda untuk mendapatkan :term:`authentication token`.

source: The flag verify_glance_signatures enables Compute to automatically validate signed instances prior to its launch. This validation feature is enabled when the value is set to TRUE
de: Das Flag verify_glance_signatures ermöglicht Compute die automatische Validierung signierter Instanzen vor dem Start. Diese Validierungsfunktion ist aktiviert, wenn der Wert auf TRUE gesetzt ist
id: Flag verifikasi_glance_signatures memungkinkan Compute untuk secara otomatis memvalidasi signed instance sebelum diluncurkan. Fitur validasi ini diaktifkan ketika nilainya diatur ke TRUE

source: The following are steps needed to create the signature used for the signed images:
de: Die folgenden Schritte sind erforderlich, um die Signatur zu erstellen, die für die signierten Abbilder verwendet wird:
id: Berikut ini adalah langkah-langkah yang diperlukan untuk membuat signature yang digunakan untuk signed image:

source: The following command requires you to have your shell environment configured with the proper administrative variables:
de: Der folgende Befehl erfordert, dass Sie Ihre Shell-Umgebung mit den richtigen administrativen Variablen konfigurieren:
id: Perintah berikut ini mengharuskan Anda untuk mengkonfigurasi lingkungan shell Anda dengan variabel administratif yang tepat:

source: The following command will boot a new instance and attach a volume at the same time. The volume of ID 13 will be attached as ``/dev/vdc``. It is not a snapshot, does not specify a size, and will not be deleted when the instance is terminated:
de: Der folgende Befehl startet eine neue Instanz und hängt gleichzeitig ein Datenträger an. Der Datenträger der ID 13 wird als ``/dev/vdc`` angehängt. Wenn es keine Schattenkopie ist, wird keine Größe angegeben und wird beim Beenden der Instanz nicht gelöscht:

source: The following comments are added to the rule set as appropriate:
de: Die folgenden Kommentare werden dem Regelsatz entsprechend hinzugefügt:
id: Komentar berikut ditambahkan ke aturan yang ditetapkan sesuai:

source: The following implicit values are being used to create the signature in this example:
de: Die folgenden impliziten Werte werden in diesem Beispiel zur Erstellung der Signatur verwendet:
id: Nilai implisit berikut ini digunakan untuk membuat signature dalam contoh ini:

source: The following options are currently supported:
de: Die folgenden Optionen werden derzeit unterstützt:
id: Opsi berikut saat ini didukung:

source: The following people have contributed to this book: Akihiro Motoki, Alejandro Avella, Alexandra Settle, Andreas Jaeger, Andy McCallum, Benjamin Stassart, Chandan Kumar, Chris Ricker, David Cramer, David Wittman, Denny Zhang, Emilien Macchi, Gauvain Pocentek, Ignacio Barrio, James E. Blair, Jay Clark, Jeff White, Jeremy Stanley, K Jonathan Harker, KATO Tomoyuki, Lana Brindley, Laura Alves, Lee Li, Lukasz Jernas, Mario B. Codeniera, Matthew Kassawara, Michael Still, Monty Taylor, Nermina Miller, Nigel Williams, Phil Hopkins, Russell Bryant, Sahid Orentino Ferdjaoui, Sandy Walsh, Sascha Peilicke, Sean M. Collins, Sergey Lukjanov, Shilla Saebi, Stephen Gordon, Summer Long, Uwe Stuehler, Vaibhav Bhatkar, Veronica Musso, Ying Chun "Daisy" Guo, Zhengguang Ou, and ZhiQiang Fan.
de: Die folgenden Personen haben zu diesem Buch beigetragen: Akihiro Motoki, Alejandro Avella, Alexandra Settle, Andreas Jaeger, Andy McCallum, Benjamin Stassart, Chandan Kumar, Chris Ricker, David Cramer, David Wittman, Denny Zhang, Emilien Macchi, Gauvain Pocentek, Ignacio Barrio, James E. Blair, Jay Clark, Jeff White, Jeremy Stanley, K Jonathan Harker, KATO Tomoyuki, Lana Brindley, Laura Alves, Lee Li, Lukasz Jernas, Mario B. Codeniera, Matthew Kassawara, Michael Still, Monty Taylor, Nermina Miller, Nigel Williams, Phil Hopkins, Russell Bryant, Sahid Orentino Ferdjaoui, Sandy Walsh, Sascha Peilicke, Sean M. Collins, Sergey Lukjanov, Shilla Saebi, Stephen Gordon, Summer Long, Uwe Stuehler, Vaibhav Bhatkar, Veronica Musso, Ying Chun "Daisy" Guo, Zhengguang Ou und ZhiQiang Fan.

source: The following procedure is a possible workaround to retrieve an IP address when an instance has been deleted with the port still attached:
de: Die folgende Vorgehensweise ist ein möglicher Workaround, um eine IP-Adresse abzurufen, wenn eine Instanz gelöscht wurde und der Port noch angeschlossen ist:
id: Prosedur berikut adalah solusi yang mungkin untuk mengambil alamat IP ketika sebuah instance telah dihapus dengan port masih terpasang:

source: The following section is from Sébastien Han's `OpenStack: Perform Consistent Snapshots blog entry <http://www.sebastien-han.fr/blog/2012/12/10/openstack-perform-consistent-snapshots/>`__.
de: Der folgende Abschnitt ist aus Sébastien Hans `OpenStack: Durchführen eines konsistenten Snapshots-Blog-Eintrags <http://www.sebastien-han.fr/blog/2012/12/10/openstack-perform-consistent-snapshots/>`__.

source: The following security controls are described below.
de: Die folgenden Sicherheitskontrollen werden im Folgenden beschrieben.
id: Kontrol keamanan berikut dijelaskan di bawah ini.

source: The following signature properties are used:
de: Die folgenden Signatureigenschaften werden verwendet:
id: Properti signature berikut digunakan:

source: The following steps described for Ubuntu have worked on at least one production environment, but they might not work for all environments.
de: Die folgenden für Ubuntu beschriebenen Schritte haben auf mindestens einer Produktionsumgebung funktioniert, aber sie funktionieren möglicherweise nicht für alle Umgebungen.
id: Langkah-langkah berikut yang dijelaskan untuk Ubuntu telah bekerja pada setidaknya satu lingkungan produksi, tetapi mereka mungkin tidak bekerja untuk semua lingkungan.

source: The frequency is defined separately for each periodic task. Therefore, to disable every periodic task in OpenStack Compute (nova), you would need to set a number of configuration options to zero. The current list of configuration options you would need to set to zero are:
de: Die Häufigkeit wird für jede periodische Aufgabe separat definiert. Um daher jede periodische Aufgabe in OpenStack Compute (nova) zu deaktivieren, müssen Sie eine Reihe von Konfigurationsoptionen auf Null setzen. Die aktuelle Liste der Konfigurationsoptionen, die Sie auf Null setzen müssten, sind:
id: Frekuensi didefinisikan secara terpisah untuk setiap tugas berkala. Oleh karena itu, untuk menonaktifkan setiap tugas berkala di OpenStack Compute (nova), Anda perlu mengatur sejumlah opsi konfigurasi ke nol. Daftar opsi konfigurasi saat ini yang perlu Anda atur ke nol adalah:

source: The general case for this is setting key-value pairs in the aggregate metadata and matching key-value pairs in flavor's ``extra_specs`` metadata. The ``AggregateInstanceExtraSpecsFilter`` in the filter scheduler will enforce that instances be scheduled only on hosts in aggregates that define the same key to the same value.
de: Der allgemeine Fall dafür ist das Setzen von Schlüssel-Wert-Paaren in den aggregierten Metadaten und das Abgleichen von Schlüssel-Wert-Paaren in den Metadaten von Flavor's ``extra_specs``. Der ``AggregateInstanceExtraSpecsFilter`` im Filterplaner erzwingt, dass Instanzen nur auf Hosts in Aggregaten geplant werden, die den gleichen Schlüssel zum gleichen Wert definieren.
id: Kasus umum untuk ini adalah pengaturan pasangan key-value dalam metadata agregat dan pasangan key-value yang cocok dalam metadata ``extra_specs`` flavor. ``AggregateInstanceExtraSpecsFilter`` di penjadwal filter akan memastikan bahwa instance hanya dijadwalkan pada host dalam agregat yang menentukan key yang sama dengan value yang sama.

source: The generated file looks something like this:
de: Die generierte Datei sieht in etwa so aus:
id: File yang dihasilkan terlihat seperti ini:

source: The genesis of this book was an in-person event, but now that the book is in your hands, we want you to contribute to it. OpenStack documentation follows the coding principles of iterative work, with bug logging, investigating, and fixing. We also store the source content on GitHub and invite collaborators through the OpenStack Gerrit installation, which offers reviews. For the O'Reilly edition of this book, we are using the company's Atlas system, which also stores source content on GitHub and enables collaboration among contributors.
de: Die Entstehung dieses Buches war ein persönliches Ereignis, aber jetzt, da das Buch in Ihren Händen liegt, möchten wir, dass Sie dazu beitragen. Die OpenStack-Dokumentation folgt den Kodierungsprinzipien der iterativen Arbeit, mit Fehlerprotokollierung, Untersuchung und Behebung. Wir speichern auch die Quellinhalte auf GitHub und laden Mitarbeiter über die OpenStack Gerrit-Installation ein, die Bewertungen anbietet. Für die O'Reilly-Ausgabe dieses Buches verwenden wir das Atlas-System des Unternehmens, das auch Quellinhalte auf GitHub speichert und die Zusammenarbeit zwischen den Autoren ermöglicht.

source: The good news: OpenStack has unprecedented transparency when it comes to providing information about what's coming up. The bad news: each release moves very quickly. The purpose of this appendix is to highlight some of the useful pages to track, and take an educated guess at what is coming up in the next release and perhaps further afield.
de: Die gute Nachricht: OpenStack hat eine beispiellose Transparenz, wenn es darum geht, Informationen darüber bereitzustellen, was auf uns zukommt. Die schlechte Nachricht: Jedes Release bewegt sich sehr schnell. Der Zweck dieses Anhangs ist es, einige der nützlichen Seiten hervorzuheben, die zu verfolgen sind, und eine fundierte Vermutung darüber anzustellen, was in der nächsten Version und vielleicht auch darüber hinaus auftaucht.
id: Berita baiknya: OpenStack memiliki transparansi yang belum pernah terjadi sebelumnya ketika datang untuk memberikan informasi tentang apa yang akan terjadi. Berita buruknya: setiap rilis bergerak sangat cepat. Tujuan dari lampiran ini adalah untuk menyoroti beberapa halaman yang berguna untuk dilacak, dan mengambil tebakan yang terpelajar tentang apa yang akan terjadi pada rilis berikutnya dan mungkin lebih jauh.

source: The guest security domain handles compute data generated by instances on the cloud, but not services that support the operation of the cloud, such as API calls. Public cloud providers and private cloud providers who do not have stringent controls on instance use or who allow unrestricted internet access to instances should consider this domain to be untrusted. Private cloud providers may want to consider this network as internal and therefore trusted only if they have controls in place to assert that they trust instances and all their tenants.
de: Die Gastsicherheitsdomäne verarbeitet Compute-Daten, die von Instanzen in der Cloud erzeugt werden, nicht aber Dienste, die den Betrieb der Cloud unterstützen, wie beispielsweise API-Aufrufe. Public Cloud-Provider und private Cloud-Provider, die keine strengen Kontrollen der Instanznutzung haben oder einen uneingeschränkten Internetzugang zu Instanzen erlauben, sollten diese Domain als nicht vertrauenswürdig betrachten. Private Cloud-Anbieter können dieses Netzwerk als intern betrachten und daher nur dann vertrauenswürdig sein, wenn sie über Kontrollen verfügen, um zu behaupten, dass sie Instanzen und allen ihren Mandanten vertrauen.
id: Domain keamanan guest menangani data komputasi yang dihasilkan oleh instance di cloud, tetapi bukan layanan yang mendukung operasi cloud, seperti panggilan API. Penyedia cloud publik dan penyedia cloud pribadi yang tidak memiliki kontrol ketat pada penggunaan instance atau yang memungkinkan akses internet tidak terbatas ke instance harus menganggap domain ini tidak dapat dipercaya. Penyedia cloud swasta mungkin ingin mempertimbangkan jaringan ini sebagai internal dan karenanya hanya dipercaya jika mereka memiliki kontrol untuk menegaskan bahwa mereka mempercayai mesin virtual dan semua penyewa mereka.

source: The horizon dashboard web application
de: Die Webanwendung des Horizon Dashboards
id: Aplikasi web dasbor horizon

source: The hypervisor also requires a security assessment. In a public cloud, organizations typically do not have control over the choice of hypervisor. Properly securing your hypervisor is important. Attacks made upon the unsecured hypervisor are called a **hypervisor breakout**. Hypervisor breakout describes the event of a compromised or malicious instance breaking out of the resource controls of the hypervisor and gaining access to the bare metal operating system and hardware resources.
de: Der Hypervisor verlangt auch eine Sicherheitsbewertung. In einer Public Cloud haben Unternehmen in der Regel keine Kontrolle über die Wahl des Hypervisors. Die richtige Sicherung Ihres Hypervisors ist wichtig. Angriffe auf den ungesicherten Hypervisor werden als **Hypervisor Breakout** bezeichnet. Hypervisor Breakout beschreibt das Ereignis, bei dem eine kompromittierte oder bösartige Instanz aus den Ressourcenkontrollen des Hypervisors ausbricht und Zugang zu den Bare-Metal-Betriebssystem- und Hardware-Ressourcen erhält.
id: Hypervisor juga membutuhkan penilaian keamanan. Dalam cloud publik, organisasi biasanya tidak memiliki kendali atas pilihan hypervisor. Mengamankan hypervisor dengan benar adalah penting. Serangan yang dilakukan pada hypervisor yang tidak aman disebut sebagai **hypervisor breakout**. Hypervisor breakout menggambarkan peristiwa yang berkompromi atau berbahaya yang memecah kontrol sumber daya dari hypervisor dan mendapatkan akses ke sistem operasi bare metal dan sumber daya perangkat keras.

source: The initial implementation of OpenStack Compute had its own authentication system and used the term ``project``. When authentication moved into the OpenStack Identity (keystone) project, it used the term ``tenant`` to refer to a group of users. Because of this legacy, some of the OpenStack tools refer to projects and some refer to tenants.
de: Die erste Implementierung von OpenStack Compute hatte ein eigenes Authentifizierungssystem und benutzte den Begriff ``Projekt``. Als die Authentifizierung in das OpenStack Identity (keystone)-Projekt verschoben wurde, verwendete sie den Begriff "Mandant", um sich auf eine Gruppe von Benutzern zu beziehen. Aufgrund dieses Vermächtnisses beziehen sich einige der OpenStack-Tools auf Projekte und andere auf Mandanten.
id: Implementasi awal OpenStack Compute memiliki sistem otentikasi sendiri dan menggunakan istilah ``project``. Ketika otentikasi pindah ke proyek OpenStack Identity (keystone), ia menggunakan istilah ``tenant`` untuk merujuk ke sekelompok pengguna. Karena warisan ini, beberapa alat OpenStack merujuk ke proyek dan beberapa merujuk ke penyewa.

source: The instance finally gives up.
de: Die Instanz gibt schließlich auf.
id: Instance akhirnya menyerah.

source: The instance generates a packet and places it on the virtual NIC inside the instance, such as eth0.
de: Die Instanz erzeugt ein Paket und platziert es auf dem virtuellen NIC innerhalb der Instanz, z.B. eth0.
id: Instance menghasilkan paket dan menempatkannya di NIC virtual di dalam instance, seperti eth0.

source: The instance generates a packet and places it on the virtual Network Interface Card (NIC) inside the instance, such as ``eth0``.
de: Die Instanz erzeugt ein Paket und legt es auf der virtuellen Network Interface Card (NIC) innerhalb der Instanz ab, z.B. ``eth0``.
id: Mesin virtual menghasilkan paket dan menempatkannya pada Network Interface Card (NIC) virtual di dalam mesin virtual, seperti ``eth0``.

source: The instances table carries most of the information related to both running and deleted instances. It has a bewildering array of fields; for an exhaustive list, look at the database. These are the most useful fields for operators looking to form queries:
de: Die Instanztabelle enthält die meisten Informationen über laufende und gelöschte Instanzen. Es hat eine verwirrende Anzahl von Feldern; eine vollständige Liste finden Sie in der Datenbank. Dies sind die nützlichsten Felder für Operatoren, die nach Formularabfragen suchen:

source: The internal availability zone is hidden in euca-describe-availability_zones (nonverbose).
de: Die interne Verfügbarkeitszone ist in euca-describe-availability_zones (nonverbose) versteckt.
id: Zona ketersediaan internal disembunyikan di euca-description-availability_zones (nonverbose).

source: The inverse operation is called :command:`openstack security group rule delete`, specifying security-group-rule ID. Whole security groups can be removed with :command:`openstack security group delete`.
de: Die umgekehrte Operation heißt :command:`openstack security group rule delete` und gibt die ID der Sicherheitsgruppe an. Ganze Sicherheitsgruppen können mit :command:`openstack security group delete` entfernt werden.
id: Operasi terbalik disebut :command:`openstack security group rule delete`, yang menentukan ID aturan grup keamanan. Seluruh grup keamanan dapat dihapus dengan :command:`openstack security group delete`.

source: The keystone processes are run within Apache as WSGI applications.
de: Die Keystone-Prozesse werden innerhalb des Apache als WSGI-Anwendungen ausgeführt.
id: Proses keystone dijalankan dalam Apache sebagai aplikasi WSGI.

source: The keystone service
de: Der Keystone-Service
id: Layanan keystone

source: The load shot up to 8 right before I received the alert
de: Die Load schoss auf 8, kurz bevor ich den Alarm erhielt
id: Muatan naik hingga 8 tepat sebelum saya menerima peringatan

source: The main idea of consistency groups is to enable you to create snapshots at the exact same point in time from multiple file system shares. Those snapshots can be then used for restoring all shares that were associated with the consistency group.
de: Die Grundidee von Konsistenzgruppen besteht darin, dass Sie Schattenkopien zum gleichen Zeitpunkt aus mehreren Dateisystemfreigaben erstellen können. Diese Schattenkopien können dann zur Wiederherstellung aller Freigaben verwendet werden, die der Konsistenzgruppe zugeordnet waren.

source: The management security domain is where services interact. Sometimes referred to as the control plane, the networks in this domain transport confidential data such as configuration parameters, user names, and passwords. In most deployments this domain is considered trusted when it is behind an organization's firewall.
de: In der Verwaltungssicherheitsdomäne interagieren die Dienste. Die Netzwerke in dieser Domäne, die manchmal auch als Steuerungsebene bezeichnet werden, transportieren vertrauliche Daten wie Konfigurationsparameter, Benutzernamen und Passwörter. In den meisten Implementierungen gilt diese Domäne als vertrauenswürdig, wenn sie sich hinter der Firewall eines Unternehmens befindet.
id: Domain keamanan manajemen adalah tempat layanan berinteraksi. Kadang-kadang disebut sebagai bidang kontrol, jaringan dalam domain ini mengangkut data rahasia seperti parameter konfigurasi, nama pengguna, dan kata sandi. Dalam sebagian besar penggunaan, domain ini dianggap tepercaya saat berada di belakang firewall organisasi.

source: The many different forms of license agreements for software are often written with the use of dedicated hardware in mind. This model is relevant for the cloud platform itself, including the hypervisor operating system, supporting software for items such as database, RPC, backup, and so on. Consideration must be made when offering Compute service instances and applications to end users of the cloud, since the license terms for that software may need some adjustment to be able to operate economically in the cloud.
de: Die vielen verschiedenen Formen von Lizenzverträgen für Software werden oft mit Blick auf den Einsatz von dedizierter Hardware geschrieben. Dieses Modell ist für die Cloud-Plattform selbst relevant, einschließlich des Hypervisor-Betriebssystems, der unterstützenden Software für Elemente wie Datenbank, RPC, Backup und so weiter. Bei der Bereitstellung von Compute-Service-Instanzen und -Anwendungen für Endnutzer der Cloud ist zu berücksichtigen, da die Lizenzbedingungen für diese Software möglicherweise angepasst werden müssen, um in der Cloud wirtschaftlich arbeiten zu können.
id: Berbagai bentuk perjanjian lisensi untuk perangkat lunak sering ditulis dengan menggunakan perangkat keras khusus. Model ini relevan untuk platform cloud itu sendiri, termasuk sistem operasi hypervisor, perangkat lunak pendukung untuk item seperti basis data, RPC, cadangan, dan sebagainya. Pertimbangan harus dibuat ketika menawarkan layanan Compute instance dan aplikasi untuk end users cloud, karena persyaratan lisensi untuk perangkat lunak itu mungkin memerlukan beberapa penyesuaian untuk dapat beroperasi secara ekonomis di cloud.

source: The maximum image signature character limit is 255.
de: Die maximale Grenze für die Zeichensignatur des Abbildes beträgt 255.
id: Batas karakter image signature maksimum adalah 255.
