Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: Output from ``/var/log/nova/nova-api.log`` on :term:`Havana`:
de: Ausgabe von ``/var/log/nova/nova/nova-api.log`` auf :term:`Havana`:
id: Output dari ``/var/log/nova/nova-api.log`` pada :term:`Havana`:

source: Overlay interconnects for joining separated tenant networks
de: Overlay-Verbindungen zum Verbinden getrennter Mandantennetze
id: Overlay interkoneksi untuk bergabung dengan jaringan penyewa yang terpisah

source: Packets, now tagged with the external VLAN tag, then exit onto the physical network via ``eth1``. The Layer2 switch this interface is connected to must be configured to accept traffic with the VLAN ID used. The next hop for this packet must also be on the same layer-2 network.
de: Pakete, die jetzt mit dem externen VLAN-Tag versehen sind, verlassen dann das physische Netzwerk über ``eth1``. Der Layer2-Switch, an den diese Schnittstelle angeschlossen ist, muss so konfiguriert sein, dass er den Datenverkehr mit der verwendeten VLAN-ID akzeptiert. Der nächste Hop für dieses Paket muss sich ebenfalls im gleichen Layer-2-Netzwerk befinden.
id: Paket, sekarang ditandai dengan tag VLAN eksternal, kemudian keluar ke jaringan fisik melalui ``eth1``. Switch Layer2 yang terhubung dengan antarmuka ini harus dikonfigurasi untuk menerima lalu lintas dengan ID VLAN yang digunakan. Hop berikutnya untuk paket ini juga harus berada di jaringan layer-2 yang sama.

source: Partition all drives in the same way in a horizontal fashion, as shown in :ref:`partition_setup`.
de: Partitionieren Sie alle Laufwerke horizontal auf die gleiche Weise, wie in :ref:`partition_setup` gezeigt.
id: Partisi semua drive dengan cara yang sama secara horizontal, seperti yang ditunjukkan pada :ref:`partition_setup`.

source: Partition setup of drives
de: Partitionierung von Laufwerken
id: Pengaturan partisi drive

source: Partitioning, which provides greater flexibility for layout of operating system and swap space, as described below.
de: Partitionierung, die eine größere Flexibilität für das Layout von Betriebssystem und Swap Space bietet, wie im Folgenden beschrieben.
id: Partisi, yang memberikan fleksibilitas lebih besar untuk tata letak sistem operasi dan ruang swap, seperti dijelaskan di bawah ini.

source: Password
de: Passwort

source: Payment Card Industry Data Security Standard (PCI DSS)
de: Zahlungskartenindustrie Datensicherheitsstandard (PCI DSS)

source: Perform a backup
de: Durchführen einer Sicherung
id: Lakukan pencadangan

source: Perform operations with share snapshots: create, change name, create a share from a snapshot, delete
de: Führen Sie Operationen mit Share Snapshots durch: Erstellen, Ändern des Namens, Erstellen einer Freigabe aus einer Schattenkopie, Löschen
id: Lakukan operasi dengan berbagi snapshot: buat, ubah nama, buat share dari snapshot, hapus

source: Perform some cleaning of the environment prior to starting the upgrade process to ensure a consistent state. For example, instances not fully purged from the system after deletion might cause indeterminate behavior.
de: Führen Sie vor Beginn des Upgrade-Prozesses eine gewisse Reinigung der Umgebung durch, um einen konsistenten Zustand sicherzustellen. Beispielsweise können Instanzen, die nach dem Löschen nicht vollständig aus dem System entfernt wurden, zu unbestimmtem Verhalten führen.
id: Lakukan pembersihan lingkungan sebelum memulai proses upgrade untuk memastikan kondisi yang konsisten. Misalnya, instance yang tidak sepenuhnya dibersihkan dari sistem setelah penghapusan dapat menyebabkan perilaku tak tentu.

source: Perform source NAT on outgoing traffic.
de: Führen Sie Quell-NAT für ausgehenden Datenverkehr durch.
id: Lakukan NAT sumber pada lalu lintas keluar.

source: Perform the day-to-day tasks required to administer a cloud.
de: Führen Sie die täglichen Aufgaben aus, die für die Verwaltung einer Cloud erforderlich sind.

source: Performance and Optimizing
de: Leistung und Optimierung
id: Performa dan Mengoptimalkan

source: Performance increased greatly after deleting the old records and my new deployment continues to behave well.
de: Die Leistung wurde nach dem Löschen der alten Datensätze stark verbessert, und meine neue Bereitstellung verhält sich weiterhin gut.
id: Performa meningkat pesat setelah menghapus catatan lama dan penerapan baru saya terus berperilaku baik.

source: Periodic tasks are important to understand because of limitations in the threading model that OpenStack uses. OpenStack uses cooperative threading in Python, which means that if something long and complicated is running, it will block other tasks inside that process from running unless it voluntarily yields execution to another cooperative thread.
de: Periodische Aufgaben sind wegen der Einschränkungen im Threading-Modell, das OpenStack verwendet, wichtig zu verstehen. OpenStack verwendet kooperatives Threading in Python, was bedeutet, dass, wenn etwas langes und kompliziertes läuft, es andere Aufgaben innerhalb dieses Prozesses blockiert, es sei denn, es führt freiwillig eine Ausführung für einen anderen kooperativen Thread durch.
id: Tugas berkala penting untuk dipahami karena keterbatasan dalam model threading yang digunakan OpenStack. OpenStack menggunakan threading kooperatif dalam Python, yang berarti bahwa jika sesuatu yang panjang dan rumit berjalan, itu akan memblokir tugas-tugas lain di dalam proses itu dari berjalan kecuali itu secara sukarela menghasilkan eksekusi ke thread kooperatif lain.

source: Pick a service endpoint from your service catalog, such as compute. Try a request, for example, listing instances (servers):
de: Wählen Sie einen Service-Endpunkt aus Ihrem Servicekatalog, z.B. Compute. Versuchen Sie eine Anfrage, z.B. die Auflistung von Instanzen (Servern):
id: Pilih endpoint layanan dari katalog layanan Anda, seperti komputasi. Coba permintaan, misalnya, daftar instance (server):

source: Place the tenant ID in a variable:
de: Platzieren Sie die Mandanten-ID in einer Variablen:
id: Tempatkan ID tenant dalam variabel:

source: Planned Maintenance
de: Geplante Wartung

source: Planning for deploying and provisioning OpenStack
de: Planung für die Bereitstellung und Bereitstellung von OpenStack
id: Merencanakan untuk menggunakan dan menyediakan OpenStack

source: Policies are triggered by an OpenStack policy engine whenever one of them matches an OpenStack API operation or a specific attribute being used in a given operation. For instance, the engine tests the ``create:compute`` policy every time a user sends a ``POST /v2/{tenant_id}/servers`` request to the OpenStack Compute API server. Policies can be also related to specific :term:`API extensions <API extension>`. For instance, if a user needs an extension like ``compute_extension:rescue``, the attributes defined by the provider extensions trigger the rule test for that operation.
de: Richtlinien werden von einer OpenStack-Richtlinien-Engine ausgelöst, wenn eine von ihnen mit einer OpenStack-API-Operation oder einem bestimmten Attribut übereinstimmt, das in einer bestimmten Operation verwendet wird. Beispielsweise testet die Engine die Richtlinie ``create:compute`` jedes Mal, wenn ein Benutzer eine ``POST /v2/{tenant_id}/servers`` Anfrage an den OpenStack Compute API-Server sendet. Richtlinien können auch mit einem bestimmten :term:`API extensions <API extension>` verbunden sein. Wenn ein Benutzer beispielsweise eine Erweiterung wie "compute_extension:rescue" benötigt, lösen die durch die Provider-Erweiterungen definierten Attribute den Regeltest für diese Operation aus.

source: Policies specify access criteria for specific operations, possibly with fine-grained control over specific attributes.
de: Richtlinien legen Zugriffskriterien für bestimmte Vorgänge fest, möglicherweise mit fein abgestufter Kontrolle über bestimmte Attribute.

source: Pre-upgrade considerations
de: Überlegungen zur Vorbereitung des Upgrades
id: Pertimbangan pra-upgrade

source: Pre-upgrade testing environment
de: Vorab-Upgrade-Testumgebung
id: Pra-upgrade lingkungan pengujian

source: Preface
de: Vorwort

source: Prepare any quarterly reports on usage and statistics.
de: Erstellen Sie alle vierteljährlichen Berichte über Nutzung und Statistiken.
id: Siapkan laporan triwulanan tentang penggunaan dan statistik.

source: Prerequisites
de: Voraussetzungen
id: Prasyarat

source: Press **Ctrl+A** followed by **0**.
de: Drücken Sie **Strg+A** gefolgt von **0**.
id: Tekan **Ctrl+A** diikuti oleh **0**.

source: Press **Ctrl+A** followed by **3** to check the log output.
de: Drücken Sie **Ctrl+A** gefolgt von **3****, um die Protokollausgabe zu überprüfen.
id: Tekan **Ctrl+A** diikuti oleh **3** untuk memeriksa output log.

source: Press **Ctrl+A** followed by **3** to check the log output. Look at the swift log statements again, and among the log statements, you'll see the lines:
de: Drücken Sie **Ctrl+A** gefolgt von **3****, um die Protokollausgabe zu überprüfen. Betrachten Sie die Swift-Log-Anweisungen noch einmal, und unter den Log-Anweisungen sehen Sie die Zeilen:
id: Tekan **Ctrl+A** diikuti oleh **3** untuk memeriksa output log. Lihatlah pernyataan log swift lagi, dan di antara laporan log, Anda akan melihat baris:

source: Press **Ctrl+A** followed by **3**.
de: Drücken Sie **Strg+A** gefolgt von **3**.
id: Tekan **Ctrl+A** diikuti oleh **3**.

source: Press **Ctrl+A** followed by **9**.
de: Drücken Sie **Strg+A** gefolgt von **9**.
id: Tekan **Ctrl+A** diikuti oleh **9**.

source: Press **Ctrl+A** followed by **N** until you reach the ``n-sch`` screen.
de: Drücken Sie **Strg+A** gefolgt von **N**, bis Sie den Bildschirm ``n-sch`` erreichen.
id: Tekan **Ctrl+A** diikuti oleh **N** sampai Anda mencapai layar ``n-sch``.

source: Press **Ctrl+C** to kill the service.
de: Drücken Sie **Strg+C**, um den Dienst zu beenden.
id: Tekan **Ctrl+C** untuk membunuh layanan.

source: Press **Enter** to run it.
de: Drücken Sie **Enter**, um es auszuführen.
id: Tekan **Enter** untuk menjalankannya.

source: Press **Up Arrow** to bring up the last command.
de: Drücken Sie **Pfeil nach oben**, um den letzten Befehl aufzurufen.
id: Tekan **Up Arrow** untuk memunculkan perintah terakhir.

source: Press Enter to run it.
de: Drücken Sie die Eingabetaste, um es auszuführen.
id: Tekan Enter untuk menjalankannya.

source: Press **Ctrl+A** followed by **0**.
de: Drücken Sie **Strg+A** gefolgt von **0**.
id: Teken **Ctrl+A** diikuti oleh **0**.

source: Prevent DHCP Spoofing by VM.
de: DHCP-Spoofing durch VM verhindern.
id: Mencegah Spoofing DHCP oleh VM.

source: Preventive controls:
de: Vorbeugende Kontrollen:
id: Kontrol pencegahan (preventive):

source: Previously, all services had an availability zone. Currently, only the ``nova-compute`` service has its own availability zone. Services such as ``nova-scheduler``, ``nova-network``, and ``nova-conductor`` have always spanned all availability zones.
de: Bisher hatten alle Dienste eine Verfügbarkeitszone. Derzeit hat nur der Dienst ``nova-compute`` eine eigene Verfügbarkeitszone. Dienste wie ``nova-scheduler``, ``nova-network`` und ``nova-conductor`` erstrecken sich seit jeher über alle Verfügbarkeitszonen.
id: Sebelumnya, semua layanan memiliki zona ketersediaan. Saat ini, hanya layanan ``nova-compute`` yang memiliki zona ketersediaannya sendiri. Layanan seperti ``nova-scheduler``, ``nova-network``, dan ``nova-conductor`` selalu membentang semua zona ketersediaan.

source: Primary project
de: Primärprojekt

source: Prior to the steps below, an asymmetric keypair and certificate must be generated. In this example, these are called private_key.pem and new_cert.crt, respectively, and both reside in the current directory. Also note that the image in this example is cirros-0.3.5-x86_64-disk.img, but any image can be used.
de: Vor den folgenden Schritten muss ein asymmetrisches Schlüsselpaar und Zertifikat generiert werden. In diesem Beispiel heißen diese private_key.pem bzw. new_cert.crt und befinden sich beide im aktuellen Verzeichnis. Beachten Sie auch, dass das Abbild in diesem Beispiel cirros-0.3.5-x86_64-disk.img ist, aber jedes Abbild kann verwendet werden.
id: Sebelum langkah-langkah di bawah ini, asymmetric keypair dan certificate harus dibuat. Dalam contoh ini, masing-masing disebut private_key.pem dan new_cert.crt, dan keduanya berada di direktori saat ini. Perhatikan juga bahwa image dalam contoh ini adalah cirros-0.3.5-x86_64-disk.img, tetapi image apa pun dapat digunakan.

source: Priority
de: Priorität

source: Privacy and security are spread over different industry-specific laws and regulations:
de: Datenschutz und Sicherheit sind über verschiedene branchenspezifische Gesetze und Vorschriften verteilt:
id: Privasi dan keamanan tersebar di berbagai undang-undang dan peraturan khusus industri:

source: Private Flavors
de: Private Varianten

source: Process Monitoring
de: Prozessüberwachung
id: Pemantauan Proses

source: Profit. You can now see traffic on ``patch-tun`` by running :command:`tcpdump -i snooper0`.
de: Gewinn. Sie können nun den Traffic auf ``patch-tun`` sehen, indem Sie :command:`tcpdump -i snooper0` ausführen.
id: Profit. Anda sekarang dapat melihat lalu lintas di ``patch-tun`` dengan menjalankan :command:`tcpdump -i snooper0`.

source: Project ``771ed149ef7e4b2b88665cc1c98f77ca`` will now have access to image ``733d1c44-a2ea-414b-aca7-69decf20d810``.
de: Das Projekt ``771ed149ef7e4b2b88665cc1c98f77ca`` wird nun Zugang zum Abbild ``733d1c44-a2ea-414b-aca7-69decf20d810`` haben.
id: Project ``771ed149ef7e4b2b88665cc1c98f77ca`` sekarang akan memiliki akses ke image ``733d1c44-a2ea-414b-aca7-69decf20d810``.

source: Projects or Tenants?
de: Projekte oder Mandanten?
id: Proyek atau Penyewa?

source: Property name
de: Name der Eigenschaft
id: Nama properti

source: Provides best practices and conceptual information about securing an OpenStack cloud
de: Bietet Best Practices und konzeptionelle Informationen zur Sicherung einer OpenStack-Cloud

source: Provision an instance
de: Bereitstellen einer Instanz
id: Memberikan instance

source: Public network connectivity for user virtual machines
de: Konnektivität für öffentliche Netzwerke für benutzerdefinierte virtuelle Maschinen
id: Konektivitas jaringan publik untuk mesin virtual pengguna

source: Public security domains
de: Öffentliche Sicherheitsbereiche
id: Domain keamanan publik

source: Put the image ID for the only installed image into an environment variable:
de: Fügen Sie die Image-ID für das einzige installierte Image in eine Umgebungsvariable ein:
id: Masukkan ID image untuk satu-satunya image yang diinstal ke dalam variabel lingkungan:

source: QEMU provides a guest agent that can be run in guests running on KVM hypervisors. This guest agent, on Windows VMs, coordinates with the Windows VSS service to facilitate a workflow which ensures consistent snapshots. This feature requires at least QEMU 1.7. The relevant guest agent commands are:
de: QEMU stellt einen Gastagenten zur Verfügung, der bei Gästen ausgeführt werden kann, die auf KVM-Hypervisoren laufen. Dieser Gastagent koordiniert auf Windows-VMs mit dem Windows VSS-Dienst, um einen Workflow zu ermöglichen, der konsistente Snapshots gewährleistet. Diese Funktion erfordert mindestens QEMU 1.7. Die relevanten Befehle des Gastagenten sind:

source: Quarterly
de: Vierteljährlich
id: Triwulanan

source: Quota
de: Kontingent
id: Kuota

source: Quotas
de: Kontingente
id: Kuota

source: RAID is not used in this simplistic one-drive setup because generally for production clouds, you want to ensure that if one disk fails, another can take its place. Instead, for production, use more than one disk. The number of disks determine what types of RAID arrays to build.
de: RAID wird in diesem vereinfachten Ein-Laufwerk-Setup nicht verwendet, da Sie im Allgemeinen für Produktions-Clouds sicherstellen möchten, dass bei Ausfall einer Festplatte eine andere an ihre Stelle treten kann. Verwenden Sie stattdessen für die Produktion mehr als eine Festplatte. Die Anzahl der Festplatten bestimmt, welche Arten von RAID-Arrays erstellt werden sollen.
id: RAID tidak digunakan dalam pengaturan satu drive yang sederhana ini karena umumnya untuk cloud produksi, Anda ingin memastikan bahwa jika satu disk gagal, disk lain dapat menggantikannya. Sebagai gantinya, untuk produksi, gunakan lebih dari satu disk. Jumlah disk menentukan jenis array RAID yang akan dibuat.

source: RabbitMQ Web Management Interface or rabbitmqctl
de: RabbitMQ Web Management Interface oder rabbitmqctl
id: RabbitMQ Web Management Interface atau rabbitmqctl

source: RabbitMQ alerts
de: RabbitMQ Warnmeldungen
id: Peringatan RabbitMQ

source: RabbitMQ service hangs
de: RabbitMQ-Dienst hängt fest
id: Layanan RabbitMQ hang

source: RabbitMQ troubleshooting
de: RabbitMQ Fehlerbehebung
id: Pemecahan masalah RabbitMQ

source: Rate limits
de: Ratenbegrenzungen

source: Rate limits control the frequency at which users can issue specific API requests. Rate limits are configured by administrators in a config file. Also, administrator can specify quotas also known as max values of absolute limits per tenant. Whereas users can see only the amount of their consumed resources. Administrator can specify rate limits or quotas for the following resources:
de: Ratenbegrenzungen steuern die Häufigkeit, mit der Benutzer spezifische API-Anfragen stellen können. Die Ratenbegrenzungen werden von den Administratoren in einer Konfigurationsdatei konfiguriert. Außerdem kann der Administrator Quoten angeben, die auch als Maximalwerte für absolute Limits pro Mandant bekannt sind. Während Benutzer nur die Menge ihrer verbrauchten Ressourcen sehen können. Der Administrator kann für die folgenden Ressourcen Ratenbegrenzungen oder Quoten festlegen:

source: Read about how to track the OpenStack roadmap through the open and transparent development processes.
de: Lesen Sie, wie Sie die OpenStack-Roadmap durch die offenen und transparenten Entwicklungsprozesse verfolgen können.

source: Read more detailed instructions for launching an instance from a bootable volume in the `OpenStack End User Guide <https://docs.openstack.org/user-guide/cli-nova-launch-instance-from-volume.html>`__.
de: Detaillierte Anweisungen zum Starten einer Instanz von einem bootfähigen Datenträger finden Sie im `OpenStack End User Guide <https://docs.openstack.org/user-guide/cli-nova-launch-instance-from-volume.html>`__.

source: Read through the JSON response to get a feel for how the catalog is laid out.
de: Lesen Sie die JSON-Antwort durch, um ein Gefühl dafür zu bekommen, wie der Katalog aufgebaut ist.
id: Bacalah respons JSON untuk merasakan bagaimana katalog disusun.

source: Reading the Logs
de: Lesen der Protokolle
id: Membaca Log

source: Rebooting a Cloud Controller or Storage Proxy
de: Neustart eines Cloud Controllers oder Storage Proxy
id: Reboot Pengontrol Cloud atau Proksi Penyimpanan

source: Rebooting a Storage Node
de: Neustarten eines Storage Node
id: Rebooting Storage Node

source: Recovering Backups
de: Wiederherstellen von Backups
id: Memulihkan Cadangan

source: Recovering backups is a fairly simple process. To begin, first ensure that the service you are recovering is not running. For example, to do a full recovery of ``nova`` on the cloud controller, first stop all ``nova`` services:
de: Die Wiederherstellung von Backups ist ein ziemlich einfacher Prozess. Stellen Sie zunächst sicher, dass der wiederherzustellende Dienst nicht ausgeführt wird. Um beispielsweise eine vollständige Wiederherstellung von ``nova`` auf dem Cloud-Controller durchzuführen, stoppen Sie zunächst alle ``nova`` Dienste:
id: Memulihkan cadangan adalah proses yang cukup sederhana. Untuk memulai, pertama pastikan bahwa layanan yang Anda pulihkan tidak berjalan. Misalnya, untuk melakukan pemulihan penuh ``nova`` pada pengontrol cloud, pertama-tama hentikan semua layanan ``nova``:

source: Reduce the consequences of an incident, normally by limiting the damage. They come into effect during or after an incident. Restoring system backups in order to rebuild a compromised system is an example of a corrective control.
de: Reduzieren Sie die Folgen eines Vorfalls, in der Regel durch Begrenzung des Schadens. Sie treten während oder nach einem Vorfall in Kraft. Die Wiederherstellung von System-Backups, um ein kompromittiertes System wiederherzustellen, ist ein Beispiel für eine Korrekturkontrolle.
id: Kurangi konsekuensi dari suatu insiden, biasanya dengan membatasi kerusakan. Mereka mulai berlaku selama atau setelah suatu insiden. Mengembalikan cadangan sistem untuk membangun kembali sistem yang dikompromikan adalah contoh dari kontrol korektif.

source: Refer to the following upgrade notes for information on upgrading specific OpenStack services:
de: In den folgenden Upgrade-Hinweisen finden Sie Informationen zum Upgrade bestimmter OpenStack-Dienste:
id: Lihat catatan upgrade berikut untuk informasi tentang upgrade layanan OpenStack tertentu:

source: Regardless of the overcommit ratio, an instance can not be placed on any physical node with fewer raw (pre-overcommit) resources than instance flavor requires.
de: Unabhängig vom Overcommit-Verhältnis kann eine Instanz nicht auf einem physischen Knoten mit weniger Raw-Ressourcen (Pre-Overcommit) platziert werden, als der Instanz-Variante entspricht.
id: Terlepas dari rasio overcommit, sebuah instance tidak dapat ditempatkan pada setiap node fisik dengan sumber daya (pre-overcommit) mentah yang lebih sedikit daripada yang dibutuhkan oleh instance flavor.

source: Regardless of which AMQP broker you use, such as RabbitMQ, there are common issues which not only slow down operations, but can also cause real problems. Sometimes messages queued for services stay on the queues and are not consumed. This can be due to dead or stagnant services and can be commonly cleared up by either restarting the AMQP-related services or the OpenStack service in question.
de: Unabhängig davon, welchen AMQP-Broker Sie verwenden, wie RabbitMQ, gibt es häufige Probleme, die nicht nur den Betrieb verlangsamen, sondern auch echte Probleme verursachen können. Manchmal bleiben Nachrichten, die für Dienste in der Warteschlange stehen, auf den Warteschlangen und werden nicht verbraucht. Dies kann auf tote oder stagnierende Dienste zurückzuführen sein und kann in der Regel durch einen Neustart der AMQP-bezogenen Dienste oder des betreffenden OpenStack-Dienstes behoben werden.
id: Terlepas dari broker AMQP mana yang Anda gunakan, seperti RabbitMQ, ada masalah umum yang tidak hanya memperlambat operasi, tetapi juga dapat menyebabkan masalah nyata. Terkadang pesan yang antri untuk layanan tetap berada di antrian dan tidak digunakan. Ini bisa disebabkan oleh layanan mati atau stagnan dan biasanya dapat diselesaikan dengan me-restart layanan terkait AMQP atau layanan OpenStack yang bersangkutan.

source: Regions
de: Regionen

source: Remote management
de: Fernverwaltung
id: Manajemen jarak jauh
