Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: If you can't ping the IP address of the compute node, the problem is between the instance and the compute node. This includes the bridge connecting the compute node's main NIC with the vnet NIC of the instance.
de: Wenn Sie die IP-Adresse des Compute-Knotens nicht auslesen können, liegt das Problem zwischen der Instanz und dem Compute-Knoten. Dazu gehört auch die Brücke, die das Haupt-NIC des Compute-Knotens mit dem Vnet-NIC der Instanz verbindet.
id: Jika Anda tidak bisa melakukan ping alamat IP dari node komputasi, masalahnya adalah antara instance dan node komputasi. Ini termasuk jembatan yang menghubungkan NIC utama node komputasi dengan vnet NIC dari instance.

source: If you can't, try pinging the IP address of the compute node where the instance is hosted. If you can ping this IP, then the problem is somewhere between the compute node and that compute node's gateway.
de: Wenn Sie dies nicht können, versuchen Sie, die IP-Adresse des Compute-Knotens, auf dem die Instanz gehostet wird, anzupingen. Wenn Sie diese IP pingen können, dann liegt das Problem irgendwo zwischen dem Compute-Knoten und dem Gateway dieses Compute-Knotens.
id: Jika Anda tidak bisa, coba ping alamat IP dari node compute tempat instance di-host. Jika Anda dapat melakukan ping IP ini, maka masalahnya adalah di suatu tempat antara node komputasi dan gateway node komputasi itu.

source: If you cannot have any data loss at all, you should also focus on a highly available deployment. The `OpenStack High Availability Guide <https://docs.openstack.org/ha-guide/index.html>`_ offers suggestions for elimination of a single point of failure that could cause system downtime. While it is not a completely prescriptive document, it offers methods and techniques for avoiding downtime and data loss.
de: Wenn Sie überhaupt keinen Datenverlust erleiden können, sollten Sie sich auch auf eine hochverfügbare Bereitstellung konzentrieren. Der `OpenStack High Availability Guide <https://docs.openstack.org/ha-guide/index.html>`_ bietet Vorschläge zur Beseitigung eines einzelnen Fehlers, der zu Systemausfällen führen kann. Es ist zwar kein vollständig normatives Dokument, bietet aber Methoden und Techniken zur Vermeidung von Ausfallzeiten und Datenverlust.
id: Jika Anda tidak dapat kehilangan data sama sekali, Anda juga harus fokus pada penyebaran yang sangat tersedia. The `OpenStack High Availability Guide <https://docs.openstack.org/ha-guide/index.html>`_ menawarkan saran untuk menghilangkan satu titik kegagalan yang dapat menyebabkan gangguan sistem. Meskipun ini bukan dokumen yang sepenuhnya preskriptif, ia menawarkan metode dan teknik untuk menghindari downtime dan kehilangan data.

source: If you cannot launch an instance, check the ``/var/log/rabbitmq`` log files for reported connection issues.
de: Wenn Sie eine Instanz nicht starten können, überprüfen Sie die Protokolldateien ``/var/log/rabbitmq`` auf gemeldete Verbindungsprobleme.
id: Jika Anda tidak dapat meluncurkan instance, periksa file log ``/var/log/rabbitmq`` untuk masalah koneksi yang dilaporkan.

source: If you cannot launch an instance, continue to troubleshoot the issue.
de: Wenn Sie eine Instanz nicht starten können, fahren Sie mit der Fehlerbehebung fort.
id: Jika Anda tidak dapat meluncurkan sebuah instance, lanjutkan untuk memecahkan masalah.

source: If you configured the back-end with ``driver_handles_share_servers = True`` (with the share servers) and had already some operations in the Shared File Systems service, you can see ``manila_service_network`` in the neutron list of networks. This network was created by the share driver for internal usage.
de: Wenn Sie das Backend mit ``driver_handles_share_servers = True`` (mit den Share-Servern) konfiguriert haben und bereits einige Operationen im Dienst Shared File Systems hatten, können Sie ``manila_service_network`` in der Neutronenliste der Netzwerke sehen. Dieses Netzwerk wurde vom Share-Treiber für den internen Gebrauch erstellt.

source: If you do not follow last three steps, OpenStack Compute cannot manage the instance any longer. It fails to respond to any command issued by OpenStack Compute, and it is marked as shut down.
de: Wenn Sie die letzten drei Schritte nicht befolgen, kann OpenStack Compute die Instanz nicht mehr verwalten. Es reagiert nicht auf Befehle von OpenStack Compute und wird als heruntergefahren markiert.
id: Jika Anda tidak mengikuti tiga langkah terakhir, OpenStack Compute tidak dapat mengelola instance lagi. Gagal merespons perintah apa pun yang dikeluarkan oleh OpenStack Compute, dan ditandai sebagai dimatikan.

source: If you do not need a share any more, you can delete it using :command:`manila delete share_name_or_ID` command like:
de: Wenn Sie eine Freigabe nicht mehr benötigen, können Sie sie mit dem Befehl `manila delete share_name_or_ID` löschen:

source: If you do not see the ``DHCPDISCOVER``, a problem exists with the packet getting from the instance to the machine running dnsmasq. If you see all of the preceding output and your instances are still not able to obtain IP addresses, then the packet is able to get from the instance to the host running dnsmasq, but it is not able to make the return trip.
de: Wenn Sie den ``DHCPDISCOVER`` nicht sehen, besteht ein Problem damit, dass das Paket von der Instanz zu der Maschine gelangt, auf der dnsmasq läuft. Wenn Sie alle vorhergehenden Ausgaben sehen und Ihre Instanzen immer noch nicht in der Lage sind, IP-Adressen zu erhalten, dann kann das Paket von der Instanz zum Host mit dnsmasq gelangen, aber es ist nicht in der Lage, die Rückreise durchzuführen.
id: Jika Anda tidak melihat ``DHCPDISCOVER``, ada masalah dengan paket yang didapat dari instance ke mesin yang menjalankan dnsmasq. Jika Anda melihat semua output sebelumnya dan instance Anda masih tidak dapat memperoleh alamat IP, maka paket tersebut bisa mendapatkan dari instance ke host yang menjalankan dnsmasq, tetapi tidak dapat melakukan perjalanan kembali.

source: If you find that you have reached or are reaching the capacity limit of your computing resources, you should plan to add additional compute nodes. Adding more nodes is quite easy. The process for adding compute nodes is the same as when the initial compute nodes were deployed to your cloud: use an automated deployment system to bootstrap the bare-metal server with the operating system and then have a configuration-management system install and configure OpenStack Compute. Once the Compute service has been installed and configured in the same way as the other compute nodes, it automatically attaches itself to the cloud. The cloud controller notices the new node(s) and begins scheduling instances to launch there.
de: Wenn Sie feststellen, dass Sie die Kapazitätsgrenze Ihrer Computerressourcen erreicht haben oder erreichen, sollten Sie planen, weitere Compute-Knoten hinzuzufügen. Es ist ganz einfach, weitere Knoten hinzuzufügen. Der Prozess zum Hinzufügen von Compute-Knoten ist derselbe wie bei der Bereitstellung der ersten Compute-Knoten in Ihrer Cloud: Verwenden Sie ein automatisiertes Bereitstellungssystem, um den Bare-Metal-Server mit dem Betriebssystem zu starten, und lassen Sie dann ein Konfigurationsmanagementsystem OpenStack Compute installieren und konfigurieren. Sobald der Compute-Dienst installiert und konfiguriert wurde, wie die anderen Compute-Knoten, hängt er sich automatisch an die Cloud. Der Cloud-Controller bemerkt die neuen Knoten und beginnt mit der Planung von Instanzen, um dort zu starten.
id: Jika Anda menemukan bahwa Anda telah mencapai atau sedang mencapai batas kapasitas sumber daya komputasi Anda, Anda harus merencanakan untuk menambahkan node komputasi tambahan. Menambahkan lebih banyak node cukup mudah. Proses untuk menambahkan node komputasi sama dengan ketika node komputasi awal dikerahkan ke cloud Anda: gunakan sistem penyebaran otomatis untuk mem-bootstrap server bare-metal dengan sistem operasi dan kemudian memiliki sistem manajemen konfigurasi menginstal dan mengkonfigurasi OpenStack Compute . Setelah layanan Compute telah diinstal dan dikonfigurasikan dengan cara yang sama seperti node komputasi lainnya, ia secara otomatis melampirkan dirinya ke cloud. Kontroler awan memperhatikan node baru dan mulai menjadwalkan instance untuk diluncurkan di sana.

source: If you have previously prepared block storage with a bootable file system image, it is even possible to boot from persistent block storage. The following command boots an image from the specified volume. It is similar to the previous command, but the image is omitted and the volume is now attached as ``/dev/vda``:
de: Wenn Sie zuvor den Blockspeicher mit einem bootfähigen Dateisystem-Abbild vorbereitet haben, ist es sogar möglich, von einem persistenten Blockspeicher zu booten. Der folgende Befehl bootet ein Abbild von dem angegebenen Datenträger. Es ist ähnlich wie der vorherige Befehl, aber das Abbild wird weggelassen und der Datenträger wird nun als ``/dev/vda`` angehängt:

source: If you know the fully qualified domain name (FQDN) that will be assigned to the IP address, assign the port with the same name:
de: Wenn Sie den voll qualifizierten Domainnamen (FQDN) kennen, der der IP-Adresse zugewiesen wird, weisen Sie den Port mit dem gleichen Namen zu:
id: Jika Anda tahu nama domain yang sepenuhnya memenuhi syarat (FQDN) yang akan ditetapkan ke alamat IP, tetapkan porta dengan nama yang sama:

source: If you modify the configuration, it reverts the next time you restart ``nova-network`` or ``neutron-server``. You must use OpenStack to manage iptables.
de: Wenn Sie die Konfiguration ändern, kehrt sie beim nächsten Neustart von ``nova-network`` oder ``neutron-server`` zurück. Sie müssen OpenStack verwenden, um iptables zu verwalten.
id: Jika Anda mengubah konfigurasi, itu akan kembali saat Anda memulai kembali ``nova-network`` atau ``neutron-server`` di lain waktu. Anda harus menggunakan OpenStack untuk mengelola iptables.

source: If you need to reboot a compute node due to planned maintenance, such as a software or hardware upgrade, perform the following steps:
de: Wenn Sie einen Compute-Knoten aufgrund geplanter Wartungsarbeiten, wie z. B. einem Software- oder Hardware-Upgrade, neu starten müssen, führen Sie die folgenden Schritte aus:
id: Jika Anda perlu me-reboot node komputasi karena pemeliharaan yang direncanakan, seperti peningkatan perangkat lunak atau perangkat keras, lakukan langkah-langkah berikut:

source: If you need to shut down a storage node for an extended period of time (one or more days), consider removing the node from the storage ring. For example:
de: Wenn Sie einen Speicherknoten für einen längeren Zeitraum (einen oder mehrere Tage) herunterfahren müssen, ziehen Sie in Betracht, den Knoten aus dem Speicherring zu entfernen. Zum Beispiel:
id: Jika Anda perlu mematikan storage node untuk periode waktu yang lama (satu hari atau lebih), pertimbangkan untuk melepaskan node dari lingkaran storage. Sebagai contoh:

source: If you only want to backup a single database, you can instead run:
de: Wenn Sie nur eine einzelne Datenbank sichern möchten, können Sie stattdessen ausführen:
id: Jika Anda hanya ingin membuat cadangan satu database, Anda dapat menjalankan:

source: If you receive alerts for RabbitMQ, take the following steps to troubleshoot and resolve the issue:
de: Wenn Sie Warnmeldungen für RabbitMQ erhalten, führen Sie die folgenden Schritte aus, um das Problem zu beheben und zu beheben:
id: Jika Anda menerima peringatan untuk RabbitMQ, ambil langkah-langkah berikut untuk memecahkan masalah dan menyelesaikan masalah:

source: If you removed the release repositories, you must first reinstall them and run the :command:`apt-get update` command.
de: Wenn Sie die Release-Repositories entfernt haben, müssen Sie sie zunächst neu installieren und den Befehl :command:`apt-get update` ausführen.
id: Jika Anda menghapus repositori rilis, Anda harus menginstalnya kembali dan menjalankan perintah :command:`apt-get update`

source: If you run FlatDHCPManager, one bridge is on the compute node. If you run VlanManager, one bridge exists for each VLAN.
de: Wenn Sie den FlatDHCPManager ausführen, befindet sich eine Bridge auf dem Compute-Knoten. Wenn Sie VlanManager ausführen, existiert für jedes VLAN eine Bridge.
id: Jika Anda menjalankan FlatDHCPManager, satu bridge ada di simpul komputasi. Jika Anda menjalankan VlanManager, ada satu bridge untuk setiap VLAN.

source: If you specified the consistency group while creating a share, you should provide the --consistency-group parameter to delete the share:
de: Wenn Sie beim Erstellen einer Freigabe die Konsistenzgruppe angegeben haben, sollten Sie den Parameter --consistency-group angeben, um die Freigabe zu löschen:

source: If you still cannot find the lost IP address, repeat these steps again.
de: Wenn Sie die verlorene IP-Adresse immer noch nicht finden, wiederholen Sie diese Schritte erneut.
id: Jika Anda masih tidak dapat menemukan alamat IP yang hilang, ulangi langkah ini lagi.

source: If you support the EC2 API on your cloud, you should also install the euca2ools package or some other EC2 API tool so that you can get the same view your users have. Using EC2 API-based tools is mostly out of the scope of this guide, though we discuss getting credentials for use with it.
de: Wenn Sie die EC2-API in Ihrer Cloud unterstützen, sollten Sie auch das euca2ools-Paket oder ein anderes EC2-API-Tool installieren, damit Sie die gleiche Ansicht wie Ihre Benutzer erhalten. Die Verwendung von EC2-API-basierten Tools liegt größtenteils außerhalb des Umfangs dieses Leitfadens, obwohl wir uns mit der Beschaffung von Anmeldeinformationen für die Verwendung damit befassen.
id: Jika Anda mendukung EC2 API di cloud Anda, Anda juga harus menginstal paket euca2ools atau alat EC2 API lainnya sehingga Anda bisa mendapatkan tampilan yang sama dengan yang dimiliki oleh pengguna Anda. Menggunakan alat berbasis EC2 API sebagian besar berada di luar cakupan panduan ini, meskipun kami membahas cara mendapatkan kredensial untuk digunakan dengannya.

source: If you use a configuration-management system, such as Puppet, that ensures the ``nova-compute`` service is always running, you can temporarily move the ``init`` files:
de: Wenn Sie ein Konfigurationsmanagementsystem wie Puppet verwenden, das sicherstellt, dass der Dienst ``nova-compute`` immer läuft, können Sie die ``init`` Dateien vorübergehend verschieben:
id: Jika Anda menggunakan sistem manajemen konfigurasi, seperti Puppet, yang memastikan layanan ``nova-compute`` selalu berjalan, Anda dapat memindahkan sementara file ``init`` untuk sementara:

source: If you use an external storage plug-in or shared file system with your cloud, you can test whether it works by creating a second share or endpoint. This allows you to test the system before entrusting the new version on to your storage.
de: Wenn Sie mit Ihrer Cloud ein externes Speicher-Plugin oder ein gemeinsam genutztes Dateisystem verwenden, können Sie testen, ob es funktioniert, indem Sie eine zweite Freigabe oder einen zweiten Endpunkt erstellen. So können Sie das System testen, bevor Sie die neue Version Ihrem Speicher anvertrauen.
id: Jika Anda menggunakan plug-in penyimpanan eksternal atau sistem file bersama dengan cloud Anda, Anda dapat menguji apakah itu berfungsi dengan membuat share atau endpoint kedua. Ini memungkinkan Anda untuk menguji sistem sebelum mempercayakan versi baru ke penyimpanan Anda.

source: If you use libvirt version ``1.2.2``, you may experience intermittent problems with live snapshot creation.
de: Wenn Sie die libvirt-Version ``1.2.2.2`` verwenden, kann es zu intermittierenden Problemen bei der Erstellung von Live-Schattenkopie kommen.

source: If you want to back up the root file system, you can't simply run the preceding command because it will freeze the prompt. Instead, run the following one-liner, as root, inside the instance:
de: Wenn Sie das Root-Dateisystem sichern möchten, können Sie den vorhergehenden Befehl nicht einfach ausführen, da er die Eingabeaufforderung einfriert. Führen Sie stattdessen den folgenden Einzeiler, als root, innerhalb der Instanz aus:

source: If you're running the Cirros image, it doesn't have the "host" program installed, in which case you can use ping to try to access a machine by hostname to see whether it resolves. If DNS is working, the first line of ping would be:
de: Wenn Sie das Cirros-Abbild ausführen, ist das Programm "host" nicht installiert. In diesem Fall können Sie mit ping versuchen, über den Hostnamen auf eine Maschine zuzugreifen, um zu sehen, ob sie sich auflöst. Wenn DNS funktioniert, ist die erste Zeile von ping:
id: Jika Anda menjalankan image Cirros, itu tidak memiliki program "host" yang diinstal, dalam hal ini Anda dapat menggunakan ping untuk mencoba mengakses mesin dengan nama host untuk melihat apakah itu menyelesaikan. Jika DNS berfungsi, baris pertama ping adalah:

source: If you're using the Networking service ML2 plug-in, update the Networking service database to indicate that all ports that used to be hosted on c01.example.com are now hosted on c02.example.com:
de: Wenn Sie das Plug-in für den Netzwerkdienst ML2 verwenden, aktualisieren Sie die Datenbank des Netzwerkdienstes, um anzuzeigen, dass alle Ports, die früher auf c01.example.com gehostet wurden, nun auf c02.example.com gehostet werden:
id: Jika Anda menggunakan ML2 plug-in layanan Networking , perbarui database layanan Networking untuk menunjukkan bahwa semua port yang dulu di-host di c01.example.com sekarang di-host di c02.example.com:

source: If your OpenStack Block Storage nodes are separate from your compute nodes, the same procedure still applies because the same queuing and polling system is used in both services.
de: Wenn Ihre OpenStack-Blockspeicherknoten von Ihren Compute-Knoten getrennt sind, gilt weiterhin das gleiche Verfahren, da in beiden Diensten dasselbe Warteschlangen- und Polling-System verwendet wird.
id: Jika node Block Storage OpenStack Anda terpisah dari node komputasi Anda, prosedur yang sama masih berlaku karena sistem antrian dan sistem suara polling yang sama digunakan di kedua layanan.

source: If your cloud is not using a shared storage, run:
de: Wenn Ihre Cloud keinen gemeinsamen Speicher verwendet, führen Sie:
id: Jika cloud Anda tidak menggunakan penyimpanan bersama, jalankan:

source: If your cloud is using a shared storage:
de: Wenn Ihre Cloud einen gemeinsamen Speicher verwendet:
id: Jika cloud Anda menggunakan penyimpanan bersama:

source: If your environment is using Neutron, you can configure security groups settings using the :command:`openstack` command. Get a list of security groups for the project you are acting in, by using following command:
de: Wenn Ihre Umgebung Neutron verwendet, können Sie die Einstellungen für Sicherheitsgruppen mit dem Befehl :command:`openstack` konfigurieren. Holen Sie sich eine Liste der Sicherheitsgruppen für das Projekt, in dem Sie tätig sind, indem Sie folgenden Befehl verwenden:
id: Jika lingkungan Anda menggunakan Neutron, Anda dapat mengonfigurasi pengaturan grup keamanan menggunakan perintah :command:`openstack`. Dapatkan daftar grup keamanan untuk proyek tempat Anda bertindak, dengan menggunakan perintah berikut:

source: If your instance failed to obtain an IP through DHCP, some messages should appear in the console. For example, for the Cirros image, you see output that looks like the following:
de: Wenn Ihre Instanz keine IP über DHCP erhalten hat, sollten einige Meldungen in der Konsole erscheinen. Beispielsweise sehen Sie für das Cirros-Bild eine Ausgabe, die wie folgt aussieht:
id: Jika instance Anda gagal mendapatkan IP melalui DHCP, beberapa pesan akan muncul di konsol. Misalnya, untuk image Cirros, Anda melihat output yang terlihat seperti berikut:

source: If your instances are still not able to obtain IP addresses, the next thing to check is whether dnsmasq is seeing the DHCP requests from the instance. On the machine that is running the dnsmasq process, which is the compute host if running in multi-host mode, look at ``/var/log/syslog`` to see the dnsmasq output. If dnsmasq is seeing the request properly and handing out an IP, the output looks like this:
de: Wenn Ihre Instanzen immer noch nicht in der Lage sind, IP-Adressen zu erhalten, ist das nächste, was zu prüfen ist, ob dnsmasq die DHCP-Anforderungen von der Instanz sieht. Auf der Maschine, auf der der dnsmasq-Prozess läuft, der im Multi-Host-Modus der Compute-Host ist, finden Sie unter ``/var/log/syslog`` die Ausgabe von dnsmasq. Wenn dnsmasq die Anforderung richtig sieht und eine IP ausgibt, sieht die Ausgabe so aus:
id: Jika instance Anda masih tidak dapat memperoleh alamat IP, hal berikutnya yang perlu diperiksa adalah apakah dnsmasq melihat permintaan DHCP dari instance. Pada mesin yang menjalankan proses dnsmasq, yang merupakan host komputasi jika berjalan dalam mode multi-host, lihat ``/var/log/syslog`` untuk melihat output dnsmasq. Jika dnsmasq melihat permintaan dengan benar dan membagikan IP, hasilnya terlihat seperti ini:

source: If your new object storage node has a different number of disks than the original nodes have, the command to add the new node is different from the original commands. These parameters vary from environment to environment.
de: Wenn Ihr neuer Objekt-Speicherknoten eine andere Anzahl von Festplatten hat als die ursprünglichen Knoten, unterscheidet sich der Befehl zum Hinzufügen des neuen Knotens von den ursprünglichen Befehlen. Diese Parameter variieren von Umgebung zu Umgebung.
id: Jika node penyimpanan objek baru Anda memiliki jumlah disk yang berbeda dari node asli, perintah untuk menambahkan node baru berbeda dari perintah asli. Parameter ini bervariasi dari satu lingkungan ke lingkungan lainnya.

source: If your operating system doesn't have a version of ``fsfreeze`` available, you can use ``xfs_freeze`` instead, which is available on Ubuntu in the xfsprogs package. Despite the "xfs" in the name, xfs_freeze also works on ext3 and ext4 if you are using a Linux kernel version 2.6.29 or greater, since it works at the virtual file system (VFS) level starting at 2.6.29. The xfs_freeze version supports the same command-line arguments as ``fsfreeze``.
de: Wenn Ihr Betriebssystem keine Version von ``fsfreeze``` zur Verfügung hat, können Sie stattdessen ``xfs_freeze`` verwenden, die unter Ubuntu im Paket xfsprogs verfügbar ist. Trotz der "xfs" im Namen funktioniert xfs_freeze auch auf ext3 und ext4, wenn Sie einen Linux-Kernel der Version 2.6.29 oder höher verwenden, da es auf der Ebene des virtuellen Dateisystems (VFS) ab 2.6.29 funktioniert. Die xfs_freeze-Version unterstützt die gleichen Befehlszeilenargumente wie ``fsfsfreeze``.

source: Image API v2 supports multiline properties, so this option is not required for v2 but it can still be used.
de: Die Image API v2 unterstützt mehrzeilige Eigenschaften, so dass diese Option für v2 nicht erforderlich ist, aber dennoch verwendet werden kann.
id: Image API v2 mendukung properti multiline, jadi opsi ini tidak diperlukan untuk v2 tetapi masih dapat digunakan.

source: Image Catalog and Delivery
de: Abbildkatalog und Lieferung
id: Katalog Image dan Pengiriman

source: Image Catalog and Delivery services
de: Imagekatalog und Lieferservice
id: Katalog Image dan layanan Delivery

source: Image service
de: Image service [Abbilddienst (glance)]
id: Layanan Image

source: Image usage
de: Abbildnutzung
id: Penggunaan image

source: Images
de: Bild
