Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: Different share features are supported by different share drivers. In these examples there was used generic (Cinder as a back-end) driver that does not support ``user`` and ``cert`` authentication methods.
de: Verschiedene Freigabefunktionen werden von verschiedenen Freigabetreibern unterstützt. In diesen Beispielen wurde ein generischer (Cinder als Backend) Treiber verwendet, der die Authentifizierungsmethoden ``user`` und ``cert`` nicht unterstützt.

source: Differentiations between "hot" (active) and "cold" (inactive) sites, where significant savings may be made in situations where one site is a cold standby for disaster recovery purposes only.
de: Unterscheidung zwischen "heißen" (aktiven) und "kalten" (inaktiven) Standorten, bei denen erhebliche Einsparungen erzielt werden können, wenn ein Standort nur für Notfallzwecke als Cold Standby zur Verfügung steht.
id: Perbedaan antara situs "hot" (active) dan "cold" (inactive), di mana penghematan yang signifikan dapat dilakukan dalam situasi di mana satu situs siaga cold untuk tujuan pemulihan bencana saja.

source: Direct incoming traffic from VM to the security group chain.
de: Leiten Sie eingehenden Datenverkehr von der VM an die Sicherheitsgruppen-Kette weiter.
id: Lalu lintas masuk langsung dari VM ke rantai grup keamanan.

source: Direct packets associated with a known session to the RETURN chain.
de: Leiten Sie Pakete, die einer bekannten Sitzung zugeordnet sind, an die RETURN-Kette weiter.
id: Paket langsung yang terkait dengan sesi yang diketahui ke rantai RETURN.

source: Direct traffic from the VM interface to the security group chain.
de: Leiten Sie den Datenverkehr von der VM-Schnittstelle an die Sicherheitsgruppen-Kette weiter.
id: Lalu lintas langsung dari antarmuka VM ke rantai grup keamanan.

source: Disable scheduling of new VMs to the node, optionally providing a reason comment:
de: Deaktivieren Sie die Planung neuer VMs für den Knoten und geben Sie optional einen Kommentar zum Grund an:
id: Nonaktifkan penjadwalan VM baru ke node, opsional memberikan komentar alasan:

source: Disappearing Images
de: Verschwindende Abbilder
id: Gambar yang hilang

source: Disaster recovery policies ensuring regular data backups and relocation of cloud applications to another supplier in scenarios where a provider may go out of business, or their data center could become inoperable.
de: Disaster-Recovery-Richtlinien, die regelmäßige Datensicherungen und die Verlagerung von Cloud-Anwendungen zu einem anderen Anbieter in Szenarien gewährleisten, in denen ein Provider aus dem Geschäft ausscheiden könnte oder sein Rechenzentrum inoperabel werden könnte.
id: Kebijakan pemulihan bencana memastikan pencadangan data berkala dan relokasi aplikasi cloud ke pemasok lain dalam skenario di mana penyedia mungkin keluar dari bisnis, atau pusat data mereka bisa menjadi tidak dapat dioperasikan.

source: Disconnect the qemu-nbd device.
de: Trennen Sie das qemu-nbd Gerät.
id: Putuskan sambungan perangkat qemu-nbd.

source: Discrete regions with separate API endpoints and no coordination between regions.
de: Diskrete Regionen mit separaten API-Endpunkten und keiner Koordination zwischen den Regionen.
id: Wilayah diskrit dengan endpoint API terpisah dan tidak ada koordinasi antar wilayah.

source: Disk partitioning and RAID
de: Festplattenpartitionierung und RAID
id: Partisi disk dan RAID

source: Disk partitioning and disk array setup for scalability
de: Festplattenpartitionierung und Festplattenarray-Setup für Skalierbarkeit
id: Partisi disk dan pengaturan array disk untuk skalabilitas

source: Disk space
de: Speicherplatz
id: Ruang disk

source: Disk space is cheap these days. Data recovery is not.
de: Festplattenspeicher ist heutzutage billig. Datenrettung ist es nicht.
id: Ruang disk bisa murah hari ini. Pemulihan data akan tidak.

source: Disk usage
de: Festplattennutzung

source: Distributed Virtual Router
de: Distributed Virtual Router (DVR)
id: Distributed Virtual Router (router virtual terdistribusi)

source: Do a full manual install by using the `Installation Tutorials and Guides <https://docs.openstack.org/rocky/install/>`_ for your platform. Review the final configuration files and installed packages.
de: Führen Sie eine vollständige manuelle Installation durch, indem Sie die `Installations-Tutorials und Anleitungen <https://docs.openstack.org/rocky/install/>`_ für Ihre Plattform verwenden. Überprüfen Sie die endgültigen Konfigurationsdateien und installierten Pakete.
id: Lakukan instalasi manual lengkap dengan menggunakan `Installation Tutorials and Guides <https://docs.openstack.org/rocky/install/>` _ untuk platform Anda. Tinjau file konfigurasi akhir dan paket yang diinstal.

source: Do not mount a share without an access rule! This can lead to an exception.
de: Mounten Sie keine Freigabe ohne Zugriffsregel! Dies kann zu einer Ausnahme führen.

source: Double VLAN
de: Doppel-VLAN
id: VLAN ganda

source: Downgrade OpenStack packages.
de: Downgrade von OpenStack-Paketen.
id: Downgrade paket OpenStack.

source: Downgrading packages is by far the most complicated step; it is highly dependent on the distribution and the overall administration of the system.
de: Die Herabstufung von Paketen ist bei weitem der komplizierteste Schritt; er ist stark abhängig von der Verteilung und der gesamten Administration des Systems.
id: Paket penurunan versi sejauh ini merupakan langkah paling rumit; sangat tergantung pada distribusi dan administrasi keseluruhan sistem.

source: Downtime, whether planned or unscheduled, is a certainty when running a cloud. This chapter aims to provide useful information for dealing proactively, or reactively, with these occurrences.
de: Ausfallzeiten, ob geplant oder ungeplant, sind beim Betrieb einer Cloud eine Selbstverständlichkeit. Dieses Kapitel soll nützliche Informationen für den proaktiven oder reaktiven Umgang mit diesen Ereignissen liefern.
id: Waktu henti, baik yang direncanakan atau tidak, adalah kepastian saat menjalankan cloud. Bab ini bertujuan untuk memberikan informasi yang berguna untuk menangani kejadian ini secara proaktif, atau reaktif.

source: Driver Quality Improvements
de: Verbesserungen der Treiberqualität
id: Peningkatan Kualitas Driver

source: Drop packets that are not associated with a state.
de: Lassen Sie Pakete fallen, die nicht mit einem Zustand verknüpft sind.
id: Turunkan paket yang tidak terkait dengan keadaan.

source: Drop traffic without an IP/MAC allow rule.
de: Drop-Traffic ohne eine IP/MAC-Zulassungsregel.
id: Turunkan traffic tanpa aturan IP/MAC.

source: During an upgrade, operators can add configuration options to ``nova.conf`` which lock the version of RPC messages and allow live upgrading of the services without interruption caused by version mismatch. The configuration options allow the specification of RPC version numbers if desired, but release name alias are also supported. For example:
de: Während eines Upgrades können Betreiber Konfigurationsoptionen zu ``nova.conf`` hinzufügen, die die Version von RPC-Nachrichten sperren und ein Live-Upgrade der Dienste ohne Unterbrechung durch Versionsinkongruenz ermöglichen. Die Konfigurationsoptionen erlauben die Angabe von RPC-Versionsnummern auf Wunsch, aber auch Release-Namen-Aliase werden unterstützt. Zum Beispiel:
id: Selama upgrade, operator dapat menambahkan opsi konfigurasi ke ``nova.conf`` yang mengunci versi pesan RPC dan memungkinkan upgrade langsung layanan tanpa gangguan yang disebabkan oleh ketidakcocokan versi. Opsi konfigurasi memungkinkan spesifikasi nomor versi RPC jika diinginkan, tetapi nama alias rilis juga didukung. Sebagai contoh:

source: EC2 compatibility credentials can be downloaded by selecting :guilabel:`Project`, then :guilabel:`Compute`, then :guilabel:`Access & Security`, then :guilabel:`API Access` to display the :guilabel:`Download EC2 Credentials` button. Click the button to generate a ZIP file with server x509 certificates and a shell script fragment. Create a new directory in a secure location because these are live credentials containing all the authentication information required to access your cloud identity, unlike the default ``user-openrc``. Extract the ZIP file here. You should have ``cacert.pem``, ``cert.pem``, ``ec2rc.sh``, and ``pk.pem``. The ``ec2rc.sh`` is similar to this:
de: EC2-Kompatibilitäts-Anmeldeinformationen können heruntergeladen werden, indem Sie :guilabel:`Projekt`, dann :guilabel:'Compute`, dann :guilabel:`Zugang & Sicherheit`, dann :guilabel:`API-Zugang` auswählen, um die Schaltfläche :guilabel:`Download EC2 Anmeldeinformationen` anzuzeigen. Klicken Sie auf die Schaltfläche, um eine ZIP-Datei mit Server x509-Zertifikaten und einem Shell-Skriptfragment zu erzeugen. Erstellen Sie ein neues Verzeichnis an einem sicheren Ort, da es sich hierbei um Live-Anmeldeinformationen handelt, die alle Authentifizierungsinformationen enthalten, die für den Zugriff auf Ihre Cloud-Identität erforderlich sind, im Gegensatz zum Standard ``user-openrc``. Entpacken Sie die ZIP-Datei hier. Du solltest ``cacert.pem``, ``cert.pem``, ``ec2rc.sh``, und ``pk.pem`` haben. Die ``ec2rc.sh`` ist ähnlich wie diese:
id: Kredensial kompatibilitas EC2 dapat diunduh dengan memilih :guilabel:`Project`, lalu :guilabel:`Compute`, lalu :guilabel:`Access & Security`, lalu :guilabel:`API Access` untuk menampilkan tombol :guilabel:`Download EC2 Credentials`. Klik tombol untuk membuat file ZIP dengan sertifikat server x509 dan fragmen skrip shell. Buat direktori baru di lokasi yang aman karena ini adalah kredensial langsung yang berisi semua informasi otentikasi yang diperlukan untuk mengakses identitas cloud Anda, tidak seperti ``user-openrc`` default. Ekstrak file ZIP di sini. Anda harus memiliki ``cacert.pem``, ``cert.pem``, ``ec2rc.sh``, dan ``pk.pem``. ``Ec2rc.sh`` mirip dengan ini:

source: Each OpenStack cloud is different even if you have a near-identical architecture as described in this guide. As a result, you must still test upgrades between versions in your environment using an approximate clone of your environment.
de: Jede OpenStack-Cloud ist unterschiedlich, auch wenn Sie eine nahezu identische Architektur haben, wie in diesem Handbuch beschrieben. Daher müssen Sie weiterhin Upgrades zwischen Versionen in Ihrer Umgebung mit einem ungefähren Klon Ihrer Umgebung testen.
id: Setiap cloud OpenStack berbeda bahkan jika Anda memiliki arsitektur yang hampir sama seperti yang dijelaskan dalam panduan ini. Akibatnya, Anda masih harus menguji upgrade antar versi di lingkungan Anda menggunakan klon perkiraan lingkungan Anda.

source: Each cloud implements services differently. Understand the security requirements of every cloud that handles the organization's data or workloads.
de: Jede Cloud implementiert Services unterschiedlich. Verstehen Sie die Sicherheitsanforderungen jeder Cloud, die mit den Daten oder Workloads des Unternehmens umgeht.
id: Setiap cloud mengimplementasikan layanan secara berbeda. Memahami persyaratan keamanan setiap cloud yang menangani data atau beban kerja organisasi.

source: Each layer scales horizontally. As the number of logs grows you can add more log pushers, more Logstash indexers, and more ElasticSearch nodes.
de: Jede Ebene skaliert horizontal. Wenn die Anzahl der Logs wächst, können Sie mehr Log-Pushers, mehr Logstash-Indexer und mehr ElasticSearch-Knoten hinzufügen.
id: Setiap lapisan bersisik secara horizontal. Saat jumlah log bertambah, Anda dapat menambahkan lebih banyak push log, lebih banyak pengindeks log, dan lebih banyak node ElasticSearch.

source: Each method provides different functionality and can be best divided into two groups:
de: Jede Methode bietet unterschiedliche Funktionen und lässt sich am besten in zwei Gruppen einteilen:
id: Setiap metode menyediakan fungsionalitas yang berbeda dan dapat dibagi menjadi dua kelompok:

source: Each site runs a different configuration, as a resource cells in an OpenStack Compute cells setup. Some sites span multiple data centers, some use off compute node storage with a shared file system, and some use on compute node storage with a non-shared file system. Each site deploys the Image service with an Object Storage back end. A central Identity, dashboard, and Compute API service are used. A login to the dashboard triggers a SAML login with Shibboleth, which creates an account in the Identity service with an SQL back end. An Object Storage Global Cluster is used across several sites.
de: Jeder Standort führt eine andere Konfiguration als Ressourcenzellen in einem OpenStack Compute-Zellen-Setup aus. Einige Standorte erstrecken sich über mehrere Rechenzentren, andere verwenden Off-Compute-Node-Speicher mit einem gemeinsamen Dateisystem und wieder andere verwenden Compute-Node-Speicher mit einem nicht gemeinsam genutzten Dateisystem. Jeder Standort stellt den Image-Service mit einem Object Storage Backend bereit. Es werden ein zentraler Identitäts-, Dashboard- und Compute-API-Dienst verwendet. Eine Anmeldung am Dashboard löst eine SAML-Anmeldung mit Shibboleth aus, die ein Konto im Identity-Dienst mit einem SQL-Backend erstellt. Ein Object Storage Global Cluster wird an mehreren Standorten eingesetzt.
id: Setiap situs menjalankan konfigurasi yang berbeda, sebagai sel sumber daya dalam pengaturan sel OpenStack Compute. Beberapa situs menjangkau beberapa pusat data, beberapa menggunakan penyimpanan node komputasi dengan sistem file bersama, dan beberapa digunakan pada penyimpanan node komputasi dengan sistem file yang tidak digunakan bersama. Setiap situs menyebarkan layanan Image dengan back end Object Storage. Layanan Identity pokok, dashboard, dan Compute API digunakan. Login ke dasbor memicu login SAML dengan Shibboleth, yang membuat akun di layanan Identity dengan SQL back end. Object Storage Global Cluster digunakan di beberapa situs.

source: Early indications are that it does do this well for a base set of scenarios, such as using the ML2 plug-in with Open vSwitch, one flat external network and VXLAN tenant networks. However, it does appear that there are problems with the use of VLANs, IPv6, Floating IPs, high north-south traffic scenarios and large numbers of compute nodes. It is expected these will improve significantly with the next release, but bug reports on specific issues are highly desirable.
de: Erste Anzeichen deuten darauf hin, dass sie dies für eine Reihe von Szenarien gut tut, wie z.B. die Verwendung des ML2-Plugins mit Open vSwitch, einem flachen externen Netzwerk und VXLAN-Mieternetzen. Es scheint jedoch, dass es Probleme mit der Verwendung von VLANs, IPv6, Floating IPs, Szenarien mit hohem Nord-Süd-Verkehr und einer großen Anzahl von Compute-Knoten gibt. Es wird erwartet, dass sich diese mit dem nächsten Release deutlich verbessern werden, aber Fehlerberichte zu bestimmten Themen sind sehr wünschenswert.
id: Indikasi awal adalah bahwa ia melakukan ini dengan baik untuk serangkaian skenario dasar, seperti menggunakan plug-in ML2 dengan Open vSwitch, satu jaringan eksternal datar dan jaringan penyewa VXLAN. Namun, tampaknya ada masalah dengan penggunaan VLAN, IPv6, Floating IPs, skenario lalu lintas north-south yang tinggi dan sejumlah besar node komputasi. Diharapkan ini akan meningkat secara signifikan dengan rilis berikutnya, tetapi laporan bug tentang masalah spesifik sangat diinginkan.

source: Easier Upgrades
de: Einfachere Upgrades
id: Upgrade yang Lebih Mudah

source: Edit the ``/etc/rabbitmq/rabbitmq.config`` configuration file, and change the ``collect_statistics_interval`` parameter between 30000-60000 milliseconds. Alternatively you can turn off statistics collection by setting ``collect_statistics`` parameter to "none".
de: Bearbeiten Sie die Konfigurationsdatei ``/etc/rabbitmq/rabbitmq.config`` und ändern Sie den Parameter ``collect_statistics_interval`` zwischen 30000-60000 Millisekunden. Alternativ können Sie die Statistikerfassung deaktivieren, indem Sie den Parameter ``collect_statistics`` auf "none" setzen.
id: Edit file konfigurasi ``/etc/rabbitmq/rabbitmq.config``, dan ubah parameter ``collect_statistics_interval`` antara 30000-60000 milidetik. Atau Anda dapat mematikan pengumpulan statistik dengan mengatur parameter ``collect_statistics`` menjadi "none".

source: Either ``snap``, which means that the volume was created from a snapshot, or anything other than ``snap`` (a blank string is valid). In the preceding example, the volume was not created from a snapshot, so we leave this field blank in our following example.
de: Entweder ``snap``, was bedeutet, dass der Datenträger aus einer Schattenkopie erstellt wurde, oder etwas anderes als ``snap`` (eine leere Zeichenkette ist gültig). Im vorherigen Beispiel wurde der Datenträger nicht aus einer Schattenkopie erstellt, daher lassen wir dieses Feld in unserem folgenden Beispiel leer.

source: Either approach is valid. Use the approach that matches your experience.
de: Beide Ansätze sind gültig. Verwenden Sie den Ansatz, der Ihrer Erfahrung entspricht.
id: Semua pendekatan ini valid. Gunakan pendekatan yang sesuai dengan pengalaman Anda.

source: Email address
de: E-Mail-Adresse

source: Emma Richards of Rackspace Guest Relations took excellent care of our lunch orders and even set aside a pile of sticky notes that had fallen off the walls.
de: Emma Richards von Rackspace Guest Relations kümmerte sich hervorragend um unsere Lunchbestellungen und legte sogar einen Haufen Haftnotizen beiseite, die von den Wänden gefallen waren.
id: Emma Richards dari Rackspace Guest Relations merawat pesanan makan siang kami dengan sangat baik dan bahkan menyisihkan setumpuk catatan tempel yang jatuh dari dinding.

source: Enable scheduling of VMs to the node:
de: Aktivieren Sie die Planung von VMs für den Knoten:
id: Aktifkan penjadwalan VM ke node:

source: Enabled
de: Aktiviert

source: Enabling IPv6 Support
de: IPv6-Unterstützung aktivieren
id: Mengaktifkan Dukungan IPv6

source: Encode certificate in DER format
de: Zertifikat im DER-Format kodieren
id: Encode sertifikat dalam format DER

source: End-User Configuration of Security Groups
de: Endbenutzerkonfiguration von Sicherheitsgruppen
id: Konfigurasi Kelompok Keamanan End-User

source: Ensure that cryptsetup is installed, and ensure that ``pythin-barbicanclient`` Python package is installed
de: Stellen Sie sicher, dass cryptsetup installiert ist, und stellen Sie sicher, dass ``pythin-barbicanclient`` Python-Paket installiert ist
id: Pastikan cryptsetup diinstal, dan pastikan bahwa ``pythin-barbicanclient`` Python package diinstal

source: Ensure that the operating system has recognized the new disk:
de: Stellen Sie sicher, daß das Betriebssystem die neue Platte erkannt hat:
id: Pastikan sistem operasi telah mengenali disk baru:

source: Evaluate successfully if a field of the resource specified in the current request matches a specific value. For instance, ``"field:networks:shared=True"`` is successful if the attribute shared of the network resource is set to ``true``.
de: Bewerten Sie erfolgreich, ob ein Feld der in der aktuellen Anforderung angegebenen Ressource mit einem bestimmten Wert übereinstimmt. Zum Beispiel ist ``"field:networks:shared=True"``` erfolgreich, wenn das Attribut, das von der Netzwerkressource gemeinsam genutzt wird, auf ``true`` gesetzt ist.

source: Evaluate successfully if the user submitting the request has the specified role. For instance, ``"role:admin"`` is successful if the user submitting the request is an administrator.
de: Bewerten Sie erfolgreich, ob der Benutzer, der die Anfrage abschickt, die angegebene Rolle hat. Beispielsweise ist ``"role:admin"`` erfolgreich, wenn der Benutzer, der die Anfrage absendet, ein Administrator ist.

source: Even at smaller-scale testing, look for excess network packets to determine whether something is going horribly wrong in inter-component communication.
de: Selbst bei kleineren Tests sollten Sie nach überschüssigen Netzwerkpaketen suchen, um festzustellen, ob etwas in der Kommunikation zwischen den Komponenten schrecklich schief läuft.
id: Bahkan pada pengujian skala kecil, cari paket jaringan berlebih untuk menentukan apakah ada sesuatu yang salah dalam komunikasi antar-komponen.

source: Ever have one of those days where all of the sudden you get the Google results you were looking for? Well, that's what happened here. I was looking for information on dhclient and why it dies when it can't renew its lease and all of the sudden I found a bunch of OpenStack and dnsmasq discussions that were identical to the problem we were seeing!
de: Hatten Sie jemals einen dieser Tage, an denen Sie plötzlich die Google-Ergebnisse erhalten, nach denen Sie gesucht haben? Nun, das ist es, was hier passiert ist. Ich suchte nach Informationen über dhclient und warum er stirbt, wenn er seinen Mietvertrag nicht verlängern kann, und plötzlich fand ich eine Reihe von OpenStack- und dnsmasq-Diskussionen, die mit dem Problem identisch waren, das wir sahen!
id: Pernahkah mengalami salah satu dari hari-hari itu di mana tiba-tiba Anda mendapatkan hasil Google yang Anda cari? Nah, itulah yang terjadi di sini. Saya mencari informasi tentang dhclient dan mengapa ia mati ketika ia tidak dapat memperpanjang sewa dan tiba-tiba saya menemukan banyak diskusi OpenStack dan dnsmasq yang identik dengan masalah yang kami lihat!

source: Everett is a developer advocate at Rackspace making OpenStack and the Rackspace Cloud easy to use. Sometimes developer, sometimes advocate, and sometimes operator, he's built web applications, taught workshops, given presentations around the world, and deployed OpenStack for production use by academia and business.
de: Everett ist ein Entwicklerfürsprecher bei Rackspace und macht OpenStack und die Rackspace Cloud einfach zu bedienen. Manchmal hat er Webanwendungen entwickelt, Workshops unterrichtet, Präsentationen auf der ganzen Welt gehalten und OpenStack für die Produktion in Wissenschaft und Wirtschaft eingesetzt.

source: Example Image service Database Queries
de: Beispiel Abbild-Dienst Datenbankabfragen
id: Contoh Database Queries layanan Image

source: Excessive database management memory consumption
de: Übermäßiger Speicherverbrauch der Datenbankverwaltung
id: Konsumsi memori manajemen database yang berlebihan

source: Factors affecting OpenStack deployment
de: Faktoren, die die OpenStack-Bereitstellung beeinflussen
id: Faktor-faktor yang mempengaruhi pengerahan OpenStack
