Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: Look for the vnet NIC. You can also reference ``nova.conf`` and look for the ``flat_interface_bridge`` option.
de: Suchen Sie nach dem vnet NIC. Sie können auch auf ``nova.conf`` verweisen und nach der Option ``flat_interface_bridge`` suchen.
id: Carilah vnet NIC. Anda juga dapat mereferensikan ``nova.conf`` dan mencari opsi ``flat_interface_bridge``.

source: MTU is maximum transmission unit. It specifies the maximum number of bytes that the interface accepts for each packet. If two interfaces have two different MTUs, bytes might get chopped off and weird things happen—such as random session lockups.
de: MTU ist die maximale Übertragungseinheit. Es gibt die maximale Anzahl von Bytes an, die die Schnittstelle für jedes Paket akzeptiert. Wenn zwei Interfaces zwei verschiedene MTUs haben, können Bytes abgehackt werden und seltsame Dinge passieren - wie zufällige Session-Lockups.
id: MTU adalah unit transmisi maksimum. Ini menentukan jumlah maksimum byte yang diterima antarmuka untuk setiap paket. Jika dua antarmuka memiliki dua MTU yang berbeda, byte mungkin akan terpotong dan hal-hal aneh terjadi - seperti penguncian sesi acak.

source: Maintaining an OpenStack cloud requires that you manage multiple physical servers, and this number might grow over time. Because managing nodes manually is error prone, we strongly recommend that you use a configuration-management tool. These tools automate the process of ensuring that all your nodes are configured properly and encourage you to maintain your configuration information (such as packages and configuration options) in a version-controlled repository.
de: Um eine OpenStack-Cloud zu verwalten, müssen Sie mehrere physische Server verwalten, und diese Zahl kann mit der Zeit steigen. Da die manuelle Verwaltung von Knoten fehleranfällig ist, empfehlen wir Ihnen dringend, ein Konfigurationsmanagement-Tool zu verwenden. Diese Tools automatisieren den Prozess der Sicherstellung der ordnungsgemäßen Konfiguration aller Ihrer Knoten und empfehlen Ihnen, Ihre Konfigurationsinformationen (wie Pakete und Konfigurationsoptionen) in einem versionskontrollierten Repository zu pflegen.
id: Mempertahankan cloud OpenStack mengharuskan Anda mengelola beberapa server fisik, dan jumlah ini mungkin bertambah seiring waktu. Karena mengelola node secara manual rentan kesalahan, kami sangat menyarankan Anda menggunakan alat manajemen konfigurasi. Alat-alat ini mengotomatiskan proses memastikan bahwa semua node Anda dikonfigurasi dengan benar dan mendorong Anda untuk mempertahankan informasi konfigurasi Anda (seperti paket dan opsi konfigurasi) dalam version-controlled repository.

source: Maintenance, Failures, and Debugging
de: Wartung, Ausfälle und Fehlersuche
id: Pemeliharaan, Kegagalan, dan Debugging

source: Make a full database backup of your production data. Since the Kilo release, database downgrades are not supported, and restoring from backup is the only method available to retrieve a previous database version.
de: Erstellen Sie eine vollständige Datenbanksicherung Ihrer Produktionsdaten. Seit der Kilo-Version werden Datenbank-Downgrades nicht mehr unterstützt, und die Wiederherstellung aus dem Backup ist die einzige verfügbare Methode, um eine frühere Datenbankversion abzurufen.
id: Buat cadangan database lengkap dari data produksi Anda. Sejak rilis Kilo, penurunan versi database tidak didukung, dan memulihkan dari cadangan adalah satu-satunya metode yang tersedia untuk mengambil versi database sebelumnya.

source: Make another storage endpoint on the same system
de: Einen anderen Speicher-Endpunkt auf dem gleichen System erstellen
id: Buat endpoint penyimpanan lain pada sistem yang sama

source: Make sure that the share has been created successfully and is ready to use (check the share status and see the share export location)
de: Stellen Sie sicher, dass die Freigabe erfolgreich erstellt wurde und einsatzbereit ist (überprüfen Sie den Freigabestatus und sehen Sie sich den Exportort der Freigabe an).

source: Make sure you are in the ``devstack`` directory:
de: Stellen Sie sicher, dass Sie sich im Verzeichnis ``devstack`` befinden:
id: Pastikan Anda berada di direktori ``devstack``:

source: Make sure you're in the ``devstack`` directory:
de: Stellen Sie sicher, dass Sie sich im Verzeichnis ``devstack``` befinden:
id: Pastikan Anda berada di direktori ``devstack``:

source: Manage Access To Shares
de: Zugriff auf Freigaben verwalten

source: Manage Shares
de: Share-Links verwalten

source: Manage a Share Network
de: Verwalten eines Freigabe-Netzwerks

source: Manage a share network
de: Verwalten eines Freigabenetzwerkes

source: Manage access to shares
de: Zugriff auf Freigaben verwalten

source: Manage repositories
de: Verwalten von Repositories
id: Kelola repositori

source: Management security domains
de: Verwaltung von Sicherheitsdomänen
id: Manajemen domain keamanan

source: Managing Projects
de: Projekte verwalten
id: Mengelola Proyek

source: Managing Projects and Users
de: Projekte und Benutzer verwalten
id: Mengelola Proyek dan Pengguna

source: Managing floating IP addresses between instances
de: Verwaltung von Floating IP-Adressen zwischen Instanzen
id: Mengelola alamat IP mengambang antar instance

source: Managing the users for both public and private clouds. The Identity service allows for LDAP to be part of the authentication process. This may ease user management if integrating into existing systems.
de: Verwaltung der Benutzer für öffentliche und private Clouds. Der Identitätsdienst ermöglicht es, dass LDAP Teil des Authentifizierungsprozesses ist. Dies kann die Benutzerverwaltung bei der Integration in bestehende Systeme erleichtern.
id: Mengelola pengguna untuk cloud publik dan pribadi. Layanan Identity memungkinkan LDAP menjadi bagian dari proses otentikasi. Ini dapat memudahkan manajemen pengguna jika berintegrasi ke sistem yang ada.

source: Manually Disassociating a Floating IP
de: Manuelle Trennung einer Floating IP
id: Secara Manual Melepaskan IP Mengambang

source: Many OpenStack projects allow for customization of specific features using a driver architecture. You can write a driver that conforms to a particular interface and plug it in through configuration. For example, you can easily plug in a new scheduler for Compute. The existing schedulers for Compute are feature full and well documented at `Scheduling <https://docs.openstack.org/ocata/config-reference/compute/schedulers.html>`_. However, depending on your user's use cases, the existing schedulers might not meet your requirements. You might need to create a new scheduler.
de: Viele OpenStack-Projekte ermöglichen die Anpassung spezifischer Funktionen über eine Treiberarchitektur. Sie können einen Treiber schreiben, der einer bestimmten Schnittstelle entspricht, und ihn über die Konfiguration anschließen. So können Sie beispielsweise ganz einfach einen neuen Scheduler für Compute einbinden. Die vorhandenen Scheduler für Compute sind vollständig ausgestattet und gut dokumentiert unter `Scheduling <https://docs.openstack.org/ocata/config-reference/compute/schedulers.html>`_. Abhängig von den Anwendungsfällen Ihres Benutzers entsprechen die vorhandenen Planer jedoch möglicherweise nicht Ihren Anforderungen. Möglicherweise müssen Sie einen neuen Scheduler erstellen.
id: Banyak proyek OpenStack memungkinkan penyesuaian fitur tertentu menggunakan arsitektur driver. Anda dapat menulis driver yang sesuai dengan antarmuka tertentu dan menghubungkannya melalui konfigurasi. Misalnya, Anda dapat dengan mudah memasang penjadwal baru untuk Compute. Penjadwal yang ada untuk Compute adalah fitur lengkap dan didokumentasikan dengan baik di `Scheduling <https://docs.openstack.org/ocata/config-reference/compute/schedulers.html>`_. Namun, tergantung pada kasus penggunaan pengguna Anda, penjadwal yang ada mungkin tidak memenuhi persyaratan Anda. Anda mungkin perlu membuat penjadwal baru.

source: Many OpenStack projects implement a driver layer, and each of these drivers will implement its own configuration options. For example, in OpenStack Compute (nova), there are various hypervisor drivers implemented—libvirt, xenserver, hyper-v, and vmware, for example. Not all of these hypervisor drivers have the same features, and each has different tuning requirements.
de: Viele OpenStack-Projekte implementieren eine Treiberschicht, und jeder dieser Treiber implementiert seine eigenen Konfigurationsoptionen. In OpenStack Compute (nova) gibt es beispielsweise verschiedene Hypervisor-Treiber, die implementiert sind - beispielsweise libvirt, xenserver, hyper-v und vmware. Nicht alle diese Hypervisor-Treiber haben die gleichen Funktionen, und jeder hat unterschiedliche Tuning-Anforderungen.
id: Banyak proyek OpenStack menerapkan lapisan driver, dan masing-masing driver ini akan menerapkan opsi konfigurasi sendiri. Sebagai contoh, dalam OpenStack Compute (nova), ada berbagai driver hypervisor yang diimplementasikan — libvirt, xenserver, hyper-v, dan vmware, misalnya. Tidak semua driver hypervisor ini memiliki fitur yang sama, dan masing-masing memiliki persyaratan penyetelan yang berbeda.

source: Many individual efforts keep a community book alive. Our community members updated content for this book year-round. Also, a year after the first sprint, Jon Proulx hosted a second two-day mini-sprint at MIT with the goal of updating the book for the latest release. Since the book's inception, more than 30 contributors have supported this book. We have a tool chain for reviews, continuous builds, and translations. Writers and developers continuously review patches, enter doc bugs, edit content, and fix doc bugs. We want to recognize their efforts!
de: Viele individuelle Bemühungen halten ein Gemeinschaftsbuch am Leben. Unsere Community-Mitglieder haben die Inhalte für dieses Buch das ganze Jahr über aktualisiert. Auch ein Jahr nach dem ersten Sprint veranstaltete Jon Proulx einen zweiten zweitägigen Mini-Sprint am MIT mit dem Ziel, das Buch für die neueste Version zu aktualisieren. Seit der Gründung des Buches haben mehr als 30 Mitwirkende dieses Buch unterstützt. Wir haben eine Werkzeugkette für Überprüfungen, kontinuierliche Builds und Übersetzungen. Autoren und Entwickler überprüfen kontinuierlich Patches, geben Dokumentfehler ein, bearbeiten Inhalte und beheben Dokumentfehler. Wir wollen ihre Bemühungen anerkennen!

source: Many sites run with users being associated with only one project. This is a more conservative and simpler choice both for administration and for users. Administratively, if a user reports a problem with an instance or quota, it is obvious which project this relates to. Users needn't worry about what project they are acting in if they are only in one project. However, note that, by default, any user can affect the resources of any other user within their project. It is also possible to associate users with multiple projects if that makes sense for your organization.
de: Viele Websites werden mit Benutzern betrieben, die nur einem Projekt zugeordnet sind. Dies ist eine konservativere und einfachere Wahl sowohl für die Administration als auch für die Benutzer. Administrativ, wenn ein Benutzer ein Problem mit einer Instanz oder Quota meldet, ist es offensichtlich, auf welches Projekt sich dies bezieht. Benutzer müssen sich keine Gedanken darüber machen, in welchem Projekt sie tätig sind, wenn sie nur in einem Projekt sind. Beachten Sie jedoch, dass jeder Benutzer standardmäßig die Ressourcen jedes anderen Benutzers innerhalb seines Projekts beeinflussen kann. Es ist auch möglich, Benutzer mehreren Projekten zuzuordnen, wenn dies für Ihr Unternehmen sinnvoll ist.

source: Matching ``gre-<n>`` interfaces to tunnel endpoints is possible by looking at the Open vSwitch state:
de: Die Anpassung von ``gre-<n>`` Schnittstellen an Tunnel-Endpunkte ist im Zustand Open vSwitch möglich:
id: Mencocokkan antarmuka ``gre- <n> `` dengan endpoints terowongan dimungkinkan dengan melihat kondisi Open vSwitch:

source: Max amount of space available for all shares
de: Maximale verfügbare Fläche für alle Freigaben

source: Max number of share snapshots
de: Maximale Anzahl von Freigabe-Schattenkopien

source: Max number of shared networks
de: Maximale Anzahl der gemeinsamen Netzwerke

source: Max number of shares
de: Maximale Anzahl der Freigaben

source: Max total amount of all snapshots
de: Maximale Gesamtzahl aller Schattenkopien

source: Megabytes of instance RAM allowed per project.
de: Megabyte Instanz-RAM pro Projekt erlaubt.
id: Megabita instance RAM diizinkan per proyek.

source: Memory
de: Speicher

source: Memory usage
de: Speicherverbrauch

source: Memory\_MB
de: Speicher\_MB

source: Message Service (zaqar)
de: Message Service (zaqar) [Nachrichtendienst (zaqar)]

source: Message queue and database services
de: Nachrichtenwarteschlange und Datenbankdienste
id: Antrian pesan dan layanan basis data

source: Metadata items
de: Metadaten-Elemente
id: Item metadata

source: Migrate all instances one by one:
de: Migrieren Sie alle Instanzen einzeln:
id: Migrasikan semua instance satu per satu:

source: Modifying users is also done from this :guilabel:`Users` page. If you have a large number of users, this page can get quite crowded. The :guilabel:`Filter` search box at the top of the page can be used to limit the users listing. A form very similar to the user creation dialog can be pulled up by selecting :guilabel:`Edit` from the actions drop-down menu at the end of the line for the user you are modifying.
de: Die Änderung von Benutzern erfolgt ebenfalls über diese Seite :guilabel:`Users`. Wenn Sie eine große Anzahl von Benutzern haben, kann diese Seite sehr überfüllt sein. Das Suchfeld :guilabel:`Filter` oben auf der Seite kann verwendet werden, um die Benutzerliste einzuschränken. Ein Formular, das dem Dialog zur Benutzererstellung sehr ähnlich ist, kann aufgerufen werden, indem Sie :guilabel:`Edit` aus dem Dropdown-Menü Aktionen am Ende der Zeile für den Benutzer, den Sie ändern, auswählen.

source: Monitoring
de: Überwachung
id: Pemantauan

source: Monitoring Tools
de: Überwachungswerkzeuge
id: Alat Pemantau

source: Monitoring the resource usage and user growth will enable you to know when to procure. The `Logging and Monitoring <https://docs.openstack.org/operations-guide/ops-logging-monitoring.html>`_ chapte in the Operations Guide details some useful metrics.
de: Die Überwachung des Ressourcenverbrauchs und des Benutzerwachstums ermöglicht es Ihnen zu wissen, wann Sie beschaffen müssen. Das Kapitel `Logging und Monitoring <https://docs.openstack.org/operations-guide/ops-logging-monitoring.html>`_ im Operations Guide beschreibt einige nützliche Kennzahlen.
id: Memantau penggunaan sumber daya dan pertumbuhan pengguna akan memungkinkan Anda mengetahui kapan harus membeli. Bab `Logging and Monitoring <https://docs.openstack.org/operations-guide/ops-logging-monitoring.html>`_ dalam Operations Guide merinci beberapa metrik yang berguna.

source: Monthly
de: Monatlich
id: Bulanan

source: Most countries have legislative and regulatory requirements governing the storage and management of data in cloud environments. This is particularly relevant for public, community and hybrid cloud models, to ensure data privacy and protection for organizations using a third party cloud provider.
de: Die meisten Länder haben gesetzliche und regulatorische Anforderungen an die Speicherung und Verwaltung von Daten in Cloud-Umgebungen. Dies ist insbesondere für öffentliche, gemeinschaftliche und hybride Cloud-Modelle relevant, um den Datenschutz und den Schutz von Unternehmen zu gewährleisten, die einen Drittanbieter nutzen.
id: Sebagian besar negara memiliki persyaratan legislatif dan peraturan yang mengatur penyimpanan dan pengelolaan data di lingkungan cloud. Ini sangat relevan untuk model cloud publik, komunitas, dan hybrid, untuk memastikan privasi data dan perlindungan bagi organisasi yang menggunakan penyedia cloud pihak ketiga.

source: Most instances are size m1.medium (two virtual cores, 50 GB of storage).
de: Die meisten Fälle haben die Größe m1.medium (zwei virtuelle Kerne, 50 GB Speicher).
id: Sebagian besar instance adalah ukuran m1.medium (dua core virtual, 50 GB penyimpanan).

source: Most services use the convention of writing their log files to subdirectories of the ``/var/log directory``, as listed in :ref:`table_log_locations`.
de: Die meisten Dienste verwenden die Konvention, ihre Protokolldateien in Unterverzeichnisse des ``/var/log-Verzeichnisses`` zu schreiben, wie in :ref:`table_log_locations` aufgeführt.
id: Sebagian besar layanan menggunakan konvensi penulisan file log mereka ke subdirektori dari ``/var/log directory``, sebagaimana tercantum dalam :ref:`table_log_locations`.

source: Mount the Share:
de: Mounten Sie die Freigabe:

source: Mount the qemu-nbd device.
de: Montieren Sie das qemu-nbd Gerät.
id: Pasang (mount) perangkat qemu-nbd.

source: Much of OpenStack is driver-oriented, so you can plug in different solutions to the base set of services. This chapter describes some advanced configuration topics.
de: Ein Großteil von OpenStack ist treiberorientiert, so dass Sie verschiedene Lösungen in den Basisdienst einbinden können. In diesem Kapitel werden einige erweiterte Konfigurationsthemen beschrieben.

source: Multi-site OpenStack deployments present additional licensing considerations over and above regular OpenStack clouds, particularly where site licenses are in use to provide cost efficient access to software licenses. The licensing for host operating systems, guest operating systems, OpenStack distributions (if applicable), software-defined infrastructure including network controllers and storage systems, and even individual applications need to be evaluated.
de: Multi-Site-OpenStack-Implementierungen bieten zusätzliche Lizenzüberlegungen über die regulären OpenStack-Clouds hinaus, insbesondere wenn Standortlizenzen verwendet werden, um einen kosteneffizienten Zugriff auf Softwarelizenzen zu ermöglichen. Die Lizenzierung für Host-Betriebssysteme, Gastbetriebssysteme, OpenStack-Distributionen (falls zutreffend), softwaredefinierte Infrastrukturen einschließlich Netzwerkkontroller und Speichersysteme und sogar einzelne Anwendungen müssen bewertet werden.
id: Penyebaran OpenStack multi-situs menghadirkan pertimbangan lisensi tambahan di atas dan di atas cloud OpenStack biasa, khususnya di mana lisensi situs digunakan untuk menyediakan akses yang efisien biaya ke lisensi perangkat lunak. Lisensi untuk sistem operasi host, sistem operasi guest, distribusi OpenStack (jika ada), infrastruktur yang ditentukan perangkat lunak termasuk pengontrol jaringan dan sistem penyimpanan, dan bahkan aplikasi individual perlu dievaluasi.

source: Multi-site security
de: Sicherheit an mehreren Standorten
id: Keamanan multi-situs

source: Must be ``IPv4`` or ``IPv6``, and addresses represented in CIDR must match the ingress or egress rules.
de: Muss ``IPv4`` oder ``IPv6``` sein, und die im CIDR vertretenen Adressen müssen den Ein- oder Ausgangsregeln entsprechen.
id: Harus ``IPv4`` atau ``IPv6``, dan alamat yang diwakili dalam CIDR harus cocok dengan aturan ingress atau egress.

source: Nagios alerts you with a `WARNING` when any disk on the compute node is 80 percent full and `CRITICAL` when 90 percent is full.
de: Nagios warnt Sie mit einer WARNING, wenn ein Laufwerk auf dem Compute-Knoten zu 80 Prozent voll und zu 90 Prozent kritisch ist.
id: Nagios memberi tahu Anda dengan `WARNING ` saat semua disk pada node komputasi 80 persen penuh dan` CRITICAL ` saat 90 persen penuh.

source: Nagios checks that at least one ``nova-compute`` service is running at all times.
de: Nagios überprüft, ob mindestens ein ``nova-compute``Dienst jederzeit läuft.
id: Nagios memeriksa bahwa setidaknya satu layanan ``nova-compute`` berjalan setiap saat.

source: Nagios is an open source monitoring service. It is capable of executing arbitrary commands to check the status of server and network services, remotely executing arbitrary commands directly on servers, and allowing servers to push notifications back in the form of passive monitoring. Nagios has been around since 1999. Although newer monitoring services are available, Nagios is a tried-and-true systems administration staple.
de: Nagios ist ein Open Source Überwachungsdienst. Es ist in der Lage, beliebige Befehle auszuführen, um den Status von Server- und Netzwerkdiensten zu überprüfen, beliebige Befehle direkt auf Servern aus der Ferne auszuführen und es Servern zu ermöglichen, Benachrichtigungen in Form von passiver Überwachung zurückzuschicken. Nagios gibt es seit 1999. Obwohl neuere Überwachungsdienste verfügbar sind, ist Nagios ein bewährtes Systemadministrations-Tool.
id: Nagios adalah layanan pemantauan sumber terbuka. Ia mampu mengeksekusi perintah acak (arbitrary) untuk memeriksa status server dan layanan jaringan, melakukan perintah jarak jauh secara langsung pada server, dan memungkinkan server untuk mendorong pemberitahuan kembali dalam bentuk pemantauan pasif. Nagios telah ada sejak 1999. Meskipun layanan pemantauan yang lebih baru tersedia, Nagios adalah bahan pokok administrasi sistem yang benar-benar ada.

source: Negative or hostile users who would attack or compromise the security of your deployment regardless of firewalls or security agreements.
de: Negative oder feindliche Benutzer, die die Sicherheit Ihrer Bereitstellung angreifen oder gefährden würden, unabhängig von Firewalls oder Sicherheitsvereinbarungen.
id: Pengguna negatif atau bermusuhan yang akan menyerang atau membahayakan keamanan penyebaran Anda terlepas dari firewall atau perjanjian keamanan.

source: Network Configuration in the Database for nova-network
de: Netzwerkkonfiguration in der Datenbank für nova-network
id: Konfigurasi jaringan dalam Database untuk nova-network

source: Network I/O
de: Netzwerk-I/O

source: Network Inspection
de: Netzwerkinspektion
id: Inspeksi jaringan

source: Network Troubleshooting
de: Fehlerbehebung im Netzwerk
id: Pemecahan Masalah Jaringan

source: Network configuration
de: Netzwerkkonfiguration
id: Konfigurasi jaringan

source: Network configuration is a very large topic that spans multiple areas of this book. For now, make sure that your servers can PXE boot and successfully communicate with the deployment server.
de: Die Netzwerkkonfiguration ist ein sehr großes Thema, das sich über mehrere Bereiche dieses Buches erstreckt. Stellen Sie zunächst sicher, dass Ihre Server PXE booten und erfolgreich mit dem Bereitstellungsserver kommunizieren können.
id: Konfigurasi jaringan adalah topik yang sangat besar yang mencakup beberapa area buku ini. Untuk saat ini, pastikan server Anda dapat melakukan PXE booting dan berhasil berkomunikasi dengan server deployment.
