Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: OpenStack :term:`Image service <Image service (glance)>` can be slowed down by things related to the Identity service, but the Image service itself can be slowed down if connectivity to the back-end storage in use is slow or otherwise problematic. For example, your back-end NFS server might have gone down.
de: OpenStack :term:`Image service <Image service (glance)>` kann durch Dinge im Zusammenhang mit dem Identity-Dienst verlangsamt werden, aber der Image-Dienst selbst kann verlangsamt werden, wenn die Verbindung zum verwendeten Backend-Speicher langsam oder anderweitig problematisch ist. Beispielsweise könnte Ihr Backend-NFS-Server ausgefallen sein.
id: OpenStack :term:`Image service <Image service (glance)>` dapat diperlambat oleh hal-hal yang terkait dengan layanan Identity, tetapi layanan Image itu sendiri dapat diperlambat jika konektivitas ke penyimpanan back-end yang digunakan lambat atau sebaliknya bermasalah. Sebagai contoh, server NFS back-end Anda mungkin sudah turun.

source: OpenStack Block Storage also allows creating snapshots of volumes. Remember that this is a block-level snapshot that is crash consistent, so it is best if the volume is not connected to an instance when the snapshot is taken and second best if the volume is not in use on the instance it is attached to. If the volume is under heavy use, the snapshot may have an inconsistent file system. In fact, by default, the volume service does not take a snapshot of a volume that is attached to an image, though it can be forced to. To take a volume snapshot, either select :guilabel:`Create Snapshot` from the actions column next to the volume name on the dashboard :guilabel:`Volumes` page, or run this from the command line:
de: OpenStack Blockspeicher ermöglicht auch die Erstellung von Schattenkopien von Datenträgern. Denken Sie daran, dass es sich hierbei um einen Snapshot auf Blockebene handelt, der absturzkonsistent ist, so dass es am besten ist, wenn der Datenträger nicht mit einer Instanz verbunden ist, wenn die Schattenkopie erstellt wird, und zweitbester, wenn der Datenträger nicht auf der Instanz verwendet wird, an die es angehängt ist. Wenn der Datenträger stark genutzt wird, kann die Schattenkopie ein inkonsistentes Dateisystem aufweisen. Standardmäßig erstellt der Datenträger-Dienst keine Schattenkopie eines Datenträger, das an ein Abbild angehängt ist, obwohl er dazu gezwungen werden kann. Um einen Datei-Überblick zu erstellen, wählen Sie entweder :guilabel:`Create Snapshot` in der Spalte actions neben dem Datenträgernamen auf der Dashboard :guilabel:`Volumes` Seite, oder führen Sie diesen über die Befehlszeile aus:
id: OpenStack Block Storage juga memungkinkan membuat snapshot volume. Ingat bahwa ini adalah snapshot level blok yang konsisten dengan gangguan, jadi yang terbaik adalah jika volume tidak terhubung ke instance ketika snapshot diambil dan terbaik kedua jika volume tidak digunakan pada instance yang dilampirkan. Jika volumenya sedang digunakan, snapshot mungkin memiliki sistem file yang tidak konsisten. Bahkan, secara default, layanan volume tidak mengambil snapshot dari volume yang dilampirkan pada image, meskipun itu bisa dipaksa. Untuk mengambil snapshot volume, pilih :guilabel:`Create Snapshot` dari kolom tindakan di sebelah nama volume pada halaman dashboard :guilabel:`Volumes` , atau jalankan ini dari command line:

source: OpenStack Block Storage service
de: OpenStack Blockspeicherdienst
id: Layanan OpenStack Block Storage

source: OpenStack Compute service
de: OpenStack-Compute-Dienst
id: Layanan OpenStack Compute

source: OpenStack Identity service
de: OpenStack Identity-Dienst
id: Layanan OpenStack Identity

source: OpenStack Image service
de: OpenStack Abbilderdienst
id: Layanan OpenStack Image

source: OpenStack Networking has many more degrees of freedom than ``nova-network`` does because of its pluggable back end. It can be configured with open source or vendor proprietary plug-ins that control software defined networking (SDN) hardware or plug-ins that use Linux native facilities on your hosts, such as Open vSwitch or Linux Bridge.
de: OpenStack Networking hat viel mehr Freiheitsgrade als ``nova-network`` aufgrund seines steckbaren Backends. Es kann mit Open-Source- oder herstellerspezifischen Plug-Ins konfiguriert werden, die softwaredefinierte Netzwerk-Hardware (SDN) oder Plug-Ins steuern, die native Linux-Einrichtungen auf Ihren Hosts verwenden, wie Open vSwitch oder Linux Bridge.
id: OpenStack Networking memiliki lebih banyak derajat kebebasan daripada ``nova-network`` karena back end pluggable-nya. Ini dapat dikonfigurasikan dengan plug-in open source atau vendor proprietary yang mengontrol plug-in atau hardware software defined networking (SDN) yang menggunakan fasilitas native Linux pada host Anda, seperti Open vSwitch atau Linux Bridge.

source: OpenStack Networking service
de: OpenStack Netzwerkdienst
id: Layanan OpenStack Networking

source: OpenStack Object Storage, known as swift when reading the code, is based on the Python `Paste <https://pypi.org/project/Paste/>`_ framework. The best introduction to its architecture is on `Read The Docs <https://paste.readthedocs.io/en/latest/>`_. Because of the swift project's use of this framework, you are able to add features to a project by placing some custom code in a project's pipeline without having to change any of the core code.
de: OpenStack Object Storage, bekannt als swift beim Lesen des Codes, basiert auf dem Python `Paste <https://pypi.org/project/Paste/>`_ Framework. Die beste Einführung in seine Architektur ist auf `Read The Docs <https://paste.readthedocs.io/en/latest/>`_. Aufgrund der schnellen Nutzung dieses Frameworks durch das Projekt können Sie einem Projekt Funktionen hinzufügen, indem Sie benutzerdefinierten Code in die Pipeline eines Projekts einfügen, ohne den Kerncode ändern zu müssen.
id: OpenStack Object Storage, dikenal sebagai swift ketika membaca kode, didasarkan pada Python `Paste <https://pypi.org/project/Paste/>`_ framework. Pengantar terbaik untuk arsitekturnya aktif di `Read The Docs <https://paste.readthedocs.io/en/latest/>`_. Karena penggunaan framework proyek swift ini, Anda dapat menambahkan fitur ke proyek dengan menempatkan beberapa kode khusus dalam pipa proyek tanpa harus mengubah kode core apa pun.

source: OpenStack Operations Guide
de: OpenStack Bedienungsanleitung
id: Panduan Operasi OpenStack

source: OpenStack Specific Resources
de: OpenStack-spezifische Ressourcen
id: Sumber Daya Tertentu OpenStack

source: OpenStack believes in open source, open design, and open development, all in an open community that encourages participation by anyone. The long-term vision for OpenStack is to produce a ubiquitous open source cloud computing platform that meets the needs of public and private cloud providers regardless of size. OpenStack services control large pools of compute, storage, and networking resources throughout a data center.
de: OpenStack glaubt an Open Source, Open Design und Open Development, alles in einer offenen Gemeinschaft, die die Teilnahme von jedermann fördert. Die langfristige Vision von OpenStack ist es, eine allgegenwärtige Open-Source-Cloud-Computing-Plattform zu entwickeln, die die Bedürfnisse von öffentlichen und privaten Cloud-Anbietern unabhängig von ihrer Größe erfüllt. OpenStack-Dienste steuern große Pools von Rechen-, Speicher- und Netzwerkressourcen in einem Rechenzentrum.

source: OpenStack can be deployed on any hardware supported by an OpenStack compatible Linux distribution.
de: OpenStack kann auf jeder Hardware bereitgestellt werden, die von einer OpenStack-kompatiblen Linux-Distribution unterstützt wird.
id: OpenStack dapat digunakan pada perangkat keras apa pun yang didukung oleh distribusi Linux yang kompatibel dengan OpenStack.

source: OpenStack community members
de: Mitglieder der OpenStack-Community

source: OpenStack follows a six month release cycle, typically releasing in April/May and October/November each year. At the start of each cycle, the community gathers in a single location for a Project Teams Gathering (PTG). At the PTG, the features for the coming releases are discussed, prioritized, and planned. The below figure shows an example release cycle, with dates showing milestone releases, code freeze, and string freeze dates, along with an example of when the summit occurs. Milestones are interim releases within the cycle that are available as packages for download and testing. Code freeze is putting a stop to adding new features to the release. String freeze is putting a stop to changing any strings within the source code.
de: OpenStack folgt einem sechsmonatigen Release-Zyklus, der in der Regel im April/Mai und Oktober/November eines jeden Jahres erscheint. Zu Beginn eines jeden Zyklus versammelt sich die Community an einem einzigen Ort zu einem Project Teams Gathering (PTG). Im PTG werden die Features für die kommenden Releases diskutiert, priorisiert und geplant. Die folgende Abbildung zeigt einen exemplarischen Release-Zyklus mit Datumsangaben für Meilenstein-Releases, Code Freeze und String Freeze Datumsangaben sowie ein Beispiel dafür, wann der Summit stattfindet. Meilensteine sind Zwischenfreigaben innerhalb des Zyklus, die als Pakete zum Herunterladen und Testen zur Verfügung stehen. Das Einfrieren von Code stoppt das Hinzufügen neuer Funktionen zur Version. Das Einfrieren von Zeichenketten stoppt die Änderung von Zeichenketten im Quellcode.
id: OpenStack mengikuti siklus rilis enam bulan, biasanya dirilis pada bulan April / Mei dan Oktober / November setiap tahun. Pada awal setiap siklus, masyarakat berkumpul di satu lokasi untuk Project Teams Gathering (PTG). Di PTG, fitur untuk rilis mendatang dibahas, diprioritaskan, dan direncanakan. Gambar di bawah ini menunjukkan contoh siklus rilis, dengan tanggal yang menunjukkan rilis tonggak, pembekuan kode, dan tanggal pembekuan string, bersama dengan contoh kapan KTT terjadi. Tonggak sejarah adalah rilis sementara dalam siklus yang tersedia sebagai paket untuk diunduh dan diuji. Pembekuan kode (code freeze) menghentikan penambahan fitur baru ke rilis. Pembekuan string (string freeze) menghentikan perubahan string dalam kode sumber.

source: OpenStack images can often be thought of as "virtual machine templates." Images can also be standard installation media such as ISO images. Essentially, they contain bootable file systems that are used to launch instances.
de: OpenStack-Abbilder können oft als "Vorlagen für virtuelle Maschinen" bezeichnet werden. Abbilder können auch Standardinstallationsmedien wie ISO-Images sein. Im Wesentlichen enthalten sie bootfähige Dateisysteme, die zum Starten von Instanzen verwendet werden.
id: Images OpenStack sering dapat dianggap sebagai "virtual machine templates.". Images juga bisa menjadi media instalasi standar seperti image ISO. Pada dasarnya, mereka berisi sistem file bootable yang digunakan untuk meluncurkan instance.

source: OpenStack is an open source platform that lets you build an :term:`Infrastructure-as-a-Service (IaaS)` cloud that runs on commodity hardware.
de: OpenStack ist eine Open-Source-Plattform, mit der Sie einen :Term:`Infrastructure-as-a-Service (IaaS)`Cloud erstellen können, die auf handelsüblicher Hardware läuft.

source: OpenStack is designed for horizontal scalability, so you can easily add new compute, network, and storage resources to grow your cloud over time. In addition to the pervasiveness of massive OpenStack public clouds, many organizations, such as PayPal, Intel, and Comcast, build large-scale private clouds. OpenStack offers much more than a typical software package because it lets you integrate a number of different technologies to construct a cloud. This approach provides great flexibility, but the number of options might be daunting at first.
de: OpenStack ist auf horizontale Skalierbarkeit ausgelegt, so dass Sie problemlos neue Rechen-, Netzwerk- und Speicherressourcen hinzufügen können, um Ihre Cloud im Laufe der Zeit zu erweitern. Zusätzlich zur Verbreitung der massiven OpenStack Public Clouds bauen viele Unternehmen wie PayPal, Intel und Comcast große private Clouds auf. OpenStack bietet viel mehr als ein typisches Softwarepaket, denn es ermöglicht die Integration verschiedener Technologien zum Aufbau einer Cloud. Dieser Ansatz bietet eine große Flexibilität, aber die Anzahl der Optionen könnte zunächst entmutigend sein.

source: OpenStack is designed to be horizontally scalable. Rather than switching to larger servers, you procure more servers and simply install identically configured services. Ideally, you scale out and load balance among groups of functionally identical services (for example, compute nodes or ``nova-api`` nodes), that communicate on a message bus.
de: OpenStack ist so konzipiert, dass es horizontal skalierbar ist. Anstatt auf größere Server umzusteigen, beschaffen Sie mehr Server und installieren einfach identisch konfigurierte Dienste. Im Idealfall skalieren und verteilen Sie die Last zwischen Gruppen von funktional identischen Diensten (z.B. Compute-Knoten oder ``nova-api`` Knoten), die auf einem Nachrichtenbus kommunizieren.
id: OpenStack dirancang untuk dapat diskalakan secara horizontal. Daripada beralih ke server yang lebih besar, Anda membeli lebih banyak server dan cukup menginstal layanan yang dikonfigurasikan secara identik. Idealnya, Anda memperbesar dan memuat keseimbangan di antara grup layanan yang identik secara fungsional (misalnya, komputasi node atau node ``nova-api``), yang berkomunikasi pada bus pesan (message bus).

source: OpenStack is designed to increase in size in a straightforward manner. Taking into account the considerations previous mentioned, particularly on the sizing of the cloud controller, it should be possible to procure additional compute or object storage nodes as needed. New nodes do not need to be the same specification or vendor as existing nodes.
de: OpenStack wurde entwickelt, um die Größe auf einfache Weise zu vergrößern. Unter Berücksichtigung der oben genannten Überlegungen, insbesondere zur Dimensionierung des Cloud Controllers, sollte es möglich sein, bei Bedarf zusätzliche Rechen- oder Objektspeicherknoten zu beschaffen. Neue Knoten müssen nicht die gleiche Spezifikation oder den gleichen Lieferanten haben wie bestehende Knoten.
id: OpenStack dirancang untuk meningkatkan ukuran secara langsung. Mempertimbangkan pertimbangan yang disebutkan sebelumnya, terutama pada ukuran pengontrol cloud, harus dimungkinkan untuk mendapatkan node komputasi atau penyimpanan objek tambahan sesuai kebutuhan. Node baru tidak perlu spesifikasi atau vendor yang sama dengan node yang ada.

source: OpenStack is intended to work well across a variety of installation flavors, from very small private clouds to large public clouds. To achieve this, the developers add configuration options to their code that allow the behavior of the various components to be tweaked depending on your needs. Unfortunately, it is not possible to cover all possible deployments with the default configuration values.
de: OpenStack soll in einer Vielzahl von Installationsvarianten gut funktionieren, von sehr kleinen privaten Clouds bis hin zu großen öffentlichen Clouds. Um dies zu erreichen, fügen die Entwickler ihrem Code Konfigurationsoptionen hinzu, mit denen das Verhalten der verschiedenen Komponenten je nach Bedarf angepasst werden kann. Leider ist es nicht möglich, alle möglichen Implementierungen mit den Standardkonfigurationswerten abzudecken.
id: OpenStack dimaksudkan untuk bekerja dengan baik di berbagai flavor instalasi, dari awan pribadi yang sangat kecil hingga awan publik yang besar. Untuk mencapai ini, pengembang menambahkan opsi konfigurasi ke kode mereka yang memungkinkan perilaku berbagai komponen untuk di-tweak tergantung pada kebutuhan Anda. Sayangnya, tidak mungkin untuk mencakup semua kemungkinan penyebaran dengan nilai konfigurasi default.

source: OpenStack might not do everything you need it to do out of the box. To add a new feature, you can follow different paths.
de: OpenStack kann möglicherweise nicht alles tun, was Sie benötigen, um dies sofort nach dem Auspacken zu tun. Um ein neues Feature hinzuzufügen, können Sie verschiedenen Pfaden folgen.
id: OpenStack mungkin tidak melakukan semua yang Anda butuhkan untuk dilakukan di luar kotak. Untuk menambahkan fitur baru, Anda dapat mengikuti jalur yang berbeda.

source: OpenStack on OpenStack (TripleO)
de: OpenStack auf OpenStack (TripleO)
id: OpenStack pada OpenStack (TripleO)

source: OpenStack services use the standard logging levels, at increasing severity: TRACE, DEBUG, INFO, AUDIT, WARNING, ERROR, and CRITICAL. That is, messages only appear in the logs if they are more "severe" than the particular log level, with DEBUG allowing all log statements through. For example, TRACE is logged only if the software has a stack trace, while INFO is logged for every message including those that are only for information.
de: OpenStack-Dienste verwenden die Standard-Protokollierungsebenen mit zunehmendem Schweregrad: TRACE, DEBUG, INFO, AUDIT, WARNUNG, ERROR und KRITISCH. Das heißt, Nachrichten erscheinen in den Protokollen nur, wenn sie "schwerer" sind als die jeweilige Protokollebene, wobei DEBUG alle Protokollanweisungen durchlässt. Beispielsweise wird TRACE nur protokolliert, wenn die Software über einen Stack-Trace verfügt, während INFO für jede Nachricht protokolliert wird, einschließlich derjenigen, die nur zur Information dienen.
id: Layanan OpenStack menggunakan level logging standar, dengan tingkat keparahan (severity) meningkat: TRACE, DEBUG, INFO, AUDIT, WARNING, ERROR, dan CRITICAL. Artinya, pesan hanya muncul di log jika mereka lebih "severe" daripada tingkat log tertentu, dengan DEBUG memungkinkan semua pernyataan log dilalui. Misalnya, TRACE dicatat hanya jika perangkat lunak memiliki jejak tumpukan (stack trace), sementara INFO dicatat untuk setiap pesan termasuk yang hanya untuk informasi.

source: OpenStack truly welcomes your ideas (and contributions) and highly values feedback from real-world users of the software. By learning a little about the process that drives feature development, you can participate and perhaps get the additions you desire.
de: OpenStack begrüßt Ihre Ideen (und Beiträge) und schätzt das Feedback von Anwendern der Software aus der Praxis sehr. Indem Sie ein wenig über den Prozess lernen, der die Entwicklung von Funktionen antreibt, können Sie teilnehmen und vielleicht die gewünschten Ergänzungen erhalten.
id: OpenStack benar-benar menyambut ide-ide Anda (dan kontribusi) dan sangat menghargai umpan balik dari pengguna perangkat lunak dunia nyata. Dengan mempelajari sedikit tentang proses yang mendorong pengembangan fitur, Anda dapat berpartisipasi dan mungkin mendapatkan tambahan yang Anda inginkan.

source: OpenStack volumes are persistent block-storage devices that may be attached and detached from instances, but they can be attached to only one instance at a time. Similar to an external hard drive, they do not provide shared storage in the way a network file system or object store does. It is left to the operating system in the instance to put a file system on the block device and mount it, or not.
de: OpenStack-Datenträger sind persistente Blockspeichergeräte, die angehängt und von Instanzen getrennt werden können, aber immer nur an eine Instanz gleichzeitig angehängt werden können. Ähnlich wie bei einer externen Festplatte bieten sie keinen gemeinsamen Speicher wie ein Netzwerk-Dateisystem oder ein Objektspeicher. Es bleibt dem Betriebssystem in der Instanz überlassen, ein Dateisystem auf das Blockgerät zu legen und es zu mounten oder nicht.
id: Volume OpenStack adalah perangkat penyimpanan blok persisten yang dapat dilampirkan dan dilepaskan dari instance, tetapi mereka dapat dilampirkan hanya pada satu instance pada satu waktu. Mirip dengan hard drive eksternal, mereka tidak menyediakan penyimpanan bersama seperti sistem file jaringan atau penyimpanan objek. Itu diserahkan ke sistem operasi dalam instance untuk menempatkan sistem file pada perangkat blok dan me-mount-nya, atau tidak.

source: OpenStack's collection of different components interact with each other strongly. For example, uploading an image requires interaction from ``nova-api``, ``glance-api``, ``glance-registry``, keystone, and potentially ``swift-proxy``. As a result, it is sometimes difficult to determine exactly where problems lie. Assisting in this is the purpose of this section.
de: Die Sammlung der verschiedenen Komponenten von OpenStack interagiert stark miteinander. Das Hochladen eines Abbildes erfordert beispielsweise die Interaktion von ``nova-api``, ``glance-api``, ``glance-registry``, keystone und möglicherweise ``swift-proxy``. Daher ist es manchmal schwierig, genau festzustellen, wo die Probleme liegen. Dabei zu helfen, ist der Zweck dieses Abschnitts.
id: Koleksi OpenStack untuk berbagai komponen saling berinteraksi satu sama lain dengan kuat. Misalnya, mengunggah gambar memerlukan interaksi dari ``nova-api``, ``glance-api``, ``glance-registry``, keystone, dan berpotensi ``swift-proxy``. Akibatnya, terkadang sulit untuk menentukan dengan tepat di mana letak masalah. Membantu dalam hal ini adalah tujuan dari bagian ini.

source: Operate with consistency groups
de: Arbeiten mit Konsistenzgruppen
id: Beroperasi dengan kelompok konsistensi

source: Operating with a share
de: Arbeiten mit einer Freigabe

source: Operation based
de: Operationsbasiert

source: Optional property that allows created servers to have a different bandwidth cap from that defined in the network they are attached to. This factor is multiplied by the rxtx\_base property of the network. Default value is 1.0 (that is, the same as the attached network).
de: Optionale Eigenschaft, die es den erstellten Servern ermöglicht, eine andere Bandbreitenobergrenze als die in dem Netzwerk, an das sie angeschlossen sind, definierte zu haben. Dieser Faktor wird mit der rxtx\_base Eigenschaft des Netzwerks multipliziert. Der Standardwert ist 1,0 (d.h. derselbe wie im angeschlossenen Netzwerk).
id: Properti opsional yang memungkinkan server yang dibuat memiliki batas bandwidth yang berbeda dari yang ditentukan dalam jaringan yang dilampirkan. Faktor ini dikalikan dengan properti rxtx\_base dari jaringan. Nilai default adalah 1.0 (yaitu, sama dengan jaringan yang terpasang).

source: Optional swap space allocation for the instance.
de: Optionale Swap Space-Zuweisung für die Instanz.
id: Alokasi ruang swap opsional untuk instance.

source: Optionally, migrate the instances back to their original compute node.
de: Optional können Sie die Instanzen wieder auf ihren ursprünglichen Compute-Knoten migrieren.
id: Secara opsional, migrasi instance kembali ke node komputasi aslinya.

source: Orchestration
de: Orchestrierung

source: Orchestration service
de: Orchestrierungsdienst (heat)
id: Layanan Orchestration

source: Other CLI Options
de: Weitere CLI-Optionen
id: Opsi CLI lainnya

source: Other backup considerations include:
de: Andere Überlegungen zur Sicherung beinhalten:
id: Pertimbangan cadangan lainnya termasuk:

source: Other considerations
de: Weitere Überlegungen
id: Pertimbangan lainnya

source: Other services follow the same process, with their respective directories and databases.
de: Andere Dienste folgen dem gleichen Prozess, mit ihren jeweiligen Verzeichnissen und Datenbanken.
id: Layanan lain mengikuti proses yang sama, dengan direktori dan database masing-masing.

source: Output from ``/var/log/nova/nova-api.log`` on :term:`Grizzly`:
de: Ausgabe von ``/var/log/nova/nova/nova-api.log`` auf :term:`Grizzly`:
id: Output dari ``/var/log/nova/nova-api.log`` pada :term:`Grizzly`:
