Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: To enable nova to send notifications, add the following to the ``nova.conf`` configuration file:
de: Um nova das Senden von Benachrichtigungen zu ermöglichen, fügen Sie Folgendes zur Konfigurationsdatei ``nova.conf`` hinzu:
id: Untuk mengaktifkan nova untuk mengirim pemberitahuan, tambahkan berikut ini ke file konfigurasi ``nova.conf``:

source: To enable this feature, edit the ``/etc/glance/glance-api.conf`` file, and under the ``[DEFAULT]`` section, add:
de: Um diese Funktion zu aktivieren, bearbeiten Sie die Datei ``/etc/glance/glance/glance-api.conf``, und fügen Sie unter dem Abschnitt ``[DEFAULT]`` hinzu:
id: Untuk mengaktifkan fitur ini, edit file ``/etc/glance/glance-api.conf``, dan di bawah bagian ``[DEFAULT] ``, tambahkan:

source: To ensure that important services have written their contents to disk (such as databases), we recommend that you read the documentation for those applications to determine what commands to issue to have them sync their contents to disk. If you are unsure how to do this, the safest approach is to simply stop these running services normally.
de: Um sicherzustellen, dass wichtige Dienste ihren Inhalt auf die Festplatte geschrieben haben (z.B. Datenbanken), empfehlen wir Ihnen, die Dokumentation dieser Anwendungen zu lesen, um festzustellen, welche Befehle ausgegeben werden müssen, damit sie ihren Inhalt auf die Festplatte synchronisieren können. Wenn Sie sich nicht sicher sind, wie Sie dies tun sollen, ist der sicherste Ansatz, diese laufenden Dienste einfach zu stoppen.

source: To examine the secondary or ephemeral disk, use an alternate mount point if you want both primary and secondary drives mounted at the same time:
de: Um die sekundäre oder ephemere Festplatte zu untersuchen, verwenden Sie einen alternativen Mount-Punkt, wenn Sie möchten, dass sowohl primäre als auch sekundäre Laufwerke gleichzeitig montiert werden:
id: Untuk memeriksa disk sekunder atau sementara, gunakan titik pemasangan alternatif jika Anda ingin drive primer dan sekunder dipasang pada saat yang bersamaan:

source: To find out whether any floating IPs are available in your cloud, run:
de: Um herauszufinden, ob in Ihrer Cloud Floating IPs verfügbar sind, führen Sie aus:
id: Untuk mengetahui apakah IP mengambang tersedia di cloud Anda, jalankan:

source: To freeze the volume in preparation for snapshotting, you would do the following, as root, inside the instance:
de: Um den Datenträger in Vorbereitung auf die Schattenkopie einzufrieren, würden Sie folgendes als root innerhalb der Instanz tun:

source: To help understand how OpenStack works, this section describes the end-to-end process and interaction of components when provisioning an instance on OpenStack.
de: Um die Funktionsweise von OpenStack besser zu verstehen, beschreibt dieser Abschnitt den End-to-End-Prozess und das Zusammenspiel von Komponenten bei der Bereitstellung einer Instanz auf OpenStack.
id: Untuk membantu memahami cara kerja OpenStack, bagian ini menjelaskan proses uend-to-end dan interaksi komponen ketika menyediakan instance pada OpenStack.

source: To help users keep and restore their data, Shared File Systems service provides a mechanism to create and operate snapshots (see `Share snapshots <https://docs.openstack.org/manila/latest/admin/shared-file-systems-snapshots.html>`__ in OpenStack Manila Administrator Guide).
de: Um Benutzern die Aufbewahrung und Wiederherstellung ihrer Daten zu erleichtern, bietet der Dienst Shared File Systems einen Mechanismus zum Erstellen und Betreiben von Schattenkopien (siehe `Share Snapshots <https://docs.openstack.org/manila/latest/admin/shared-file-systems-snapshots.html>`__ im OpenStack Manila Administrator Guide).
id: Untuk membantu pengguna menyimpan dan mengembalikan data mereka, layanan Shared File Systems menyediakan mekanisme untuk membuat dan mengoperasikan snapshot (lihat `Share snapshots <https://docs.openstack.org/manila/latest/admin/shared-file-systems-snapshots.html>`__ dalam OpenStack Manila Administrator Guide).

source: To launch an instance, you need to select an image, a flavor, and a name. The name needn't be unique, but your life will be simpler if it is because many tools will use the name in place of the UUID so long as the name is unique. You can start an instance from the dashboard from the :guilabel:`Launch Instance` button on the :guilabel:`Instances` page or by selecting the :guilabel:`Launch` action next to an image or a snapshot on the :guilabel:`Images` page.
de: Um eine Instanz zu starten, müssen Sie ein Abbild, eine Variante und einen Namen auswählen. Der Name muss nicht eindeutig sein, aber Ihr Leben wird einfacher sein, wenn es darum geht, dass viele Tools den Namen anstelle der UUID verwenden, solange der Name eindeutig ist. Sie können eine Instanz aus dem Dashboard über die Schaltfläche :guilabel:`Launch Instance` auf der Seite :guilabel:`Instances` starten oder indem Sie die Aktion :guilabel:`Launch` neben einem Abbild oder einem Schattenkopie auf der Seite :guilabel:`Images` auswählen.

source: To list the bridges on a system, use :command:`ovs-vsctl list-br`. This example shows a compute node that has an internal bridge and a tunnel bridge. VLAN networks are trunked through the ``eth1`` network interface:
de: Um die Brücken auf einem System aufzulisten, verwenden Sie den Befehl :`ovs-vsctl listt-br`. Dieses Beispiel zeigt einen Compute-Knoten, der eine interne Brücke und eine Tunnelbrücke aufweist. VLAN-Netzwerke werden über die Netzwerkschnittstelle ``eth1``` trunked:
id: Untuk daftar jembatan pada suatu sistem, gunakan :command:`ovs-vsctl list-br`. . Contoh ini menunjukkan node komputasi yang memiliki jembatan internal dan jembatan terowongan. Jaringan VLAN trunked melalui antarmuka jaringan ``eth1``:

source: To make sure that the snapshot is available, run:
de: Um sicherzustellen, dass die Schattenkopie verfügbar ist, führen Sie nun aus:

source: To make working with subsequent requests easier, store the token in an environment variable:
de: Um die Arbeit mit nachfolgenden Anforderungen zu erleichtern, speichern Sie das Token in einer Umgebungsvariablen:
id: Untuk membuat bekerja dengan permintaan berikutnya lebih mudah, simpan token dalam variabel lingkungan:

source: To obtain snapshots of a Windows VM these commands can be scripted in sequence: flush the filesystems, freeze the filesystems, snapshot the filesystems, then unfreeze the filesystems. As with scripting similar workflows against Linux VMs, care must be used when writing such a script to ensure error handling is thorough and filesystems will not be left in a frozen state.
de: Um Schattenkopien von einer Windows-VM zu erhalten, können diese Befehle nacheinander geskriptet werden: die Dateisysteme leeren, die Dateisysteme einfrieren, die Dateisysteme schnappen und dann die Dateisysteme freigeben. Wie beim Skripten ähnlicher Workflows mit Linux-VMs muss beim Schreiben eines solchen Skripts Vorsicht walten, um sicherzustellen, dass die Fehlerbehandlung gründlich ist und Dateisysteme nicht im eingefrorenen Zustand verbleiben.

source: To perform this action from command line, run the following command:
de: Um diese Aktion von der Befehlszeile aus auszuführen, führen Sie den folgenden Befehl aus:

source: To plug this middleware into the swift Paste pipeline, you edit one configuration file, ``/etc/swift/proxy-server.conf``:
de: Um diese Middleware in die swift Paste Pipeline einzubinden, bearbeiten Sie eine Konfigurationsdatei, ``/etc/swift/proxy-server.conf``:
id: Untuk menghubungkan middleware ini ke swift Paste pipeline, Anda mengedit satu file konfigurasi, ``/etc/swift/proxy-server.conf``:

source: To plug this scheduler into nova, edit one configuration file, ``/etc/nova/nova.conf``:
de: Um diesen Scheduler in nova einzubinden, bearbeiten Sie eine Konfigurationsdatei, ``/etc/nova/nova/nova.conf``:
id: Untuk menghubungkan penjadwal ini ke nova, edit satu file konfigurasi, ``/etc/nova/nova.conf``:

source: To provide a chain of trust from an end user to the Image service, and the Image service to Compute, an end user can import signed images that can be initially verified in the Image service, and later verified in the Compute service. Appropriate Image service properties need to be set to enable this signature feature.
de: Um eine Vertrauenskette von einem Endbenutzer zum Abbild-Dienst und zum Compute-Abbild-Dienst zu schaffen, kann ein Endbenutzer signierte Abbilder importieren, die zunächst im Abbild-Dienst und später im Compute-Dienst verifiziert werden können. Für die Aktivierung dieser Signaturfunktion müssen entsprechende Eigenschaften des Abbild-Dienstes eingestellt werden.
id: Untuk memberikan rantai kepercayaan dari end user ke layanan Image, dan layanan Image untuk Compute, end user dapat mengimpor signed image yang pada awalnya dapat diverifikasi dalam layanan Image, dan kemudian diverifikasi dalam layanan Compute. Properti layanan Image yang tepat perlu diatur untuk mengaktifkan fitur signature ini.

source: To put the EC2 credentials into your environment, source the ``ec2rc.sh`` file.
de: Um die EC2-Anmeldeinformationen in Ihre Umgebung zu übertragen, verwenden Sie die Datei ``ec2rc.sh``.
id: Untuk memasukkan kredensial EC2 ke lingkungan Anda, sumber file ``ec2rc.sh``.

source: To schedule a group of hosts with common features.
de: So planen Sie eine Gruppe von Hosts mit gemeinsamen Funktionen.
id: Untuk menjadwalkan sekelompok host dengan fitur-fitur umum.

source: To see a list of projects that have been added to the cloud, run:
de: Um eine Liste der Projekte anzuzeigen, die der Cloud hinzugefügt wurden, führen Sie:
id: Untuk melihat daftar proyek yang telah ditambahkan ke cloud, jalankan:

source: To see a list of running instances, run:
de: Um eine Liste der laufenden Instanzen anzuzeigen, führen Sie aus:
id: Untuk melihat daftar instance yang berjalan, jalankan:

source: To see a list of users, run:
de: Um eine Liste der Benutzer zu sehen, führen Sie aus:
id: Untuk melihat daftar pengguna, jalankan:

source: To see whether you are using namespaces, run :command:`ip netns`:
de: Um zu sehen, ob Sie Namensräume verwenden, führen Sie :command:`ip netns` aus:
id: Untuk melihat apakah Anda menggunakan namespace, jalankan :command:`ip netns`:

source: To see which bridge the packet will use, run the command:
de: Um zu sehen, welche Bridge das Paket verwenden wird, führen Sie den Befehl aus:
id: Untuk melihat bridge mana yang akan digunakan paket, jalankan perintah:

source: To see which fixed IP networks are configured in your cloud, you can use the :command:`openstack` command-line client to get the IP ranges:
de: Um zu sehen, welche festen IP-Netzwerke in Ihrer Cloud konfiguriert sind, können Sie den Befehlszeilen-Client :command:`openstack` verwenden, um die IP-Bereiche abzurufen:
id: Untuk melihat jaringan IP tetap mana yang dikonfigurasikan di cloud Anda, Anda dapat menggunakan klien command-line :command:`openstack` untuk mendapatkan rentang IP:

source: To set a configuration option to zero, include a line such as ``image_cache_manager_interval=0`` in your ``nova.conf`` file.
de: Um eine Konfigurationsoption auf Null zu setzen, fügen Sie eine Zeile wie ``image_cache_manager_interval=0`` in Ihre ``nova.conf`` Datei ein.
id: Untuk mengatur opsi konfigurasi ke nol, sertakan baris seperti file ``image_cache_manager_interval=0`` in your ``nova.conf``.

source: To set up the test environment, you can use one of several methods:
de: Um die Testumgebung einzurichten, können Sie eine von mehreren Methoden verwenden:
id: Untuk mengatur lingkungan pengujian, Anda dapat menggunakan salah satu dari beberapa metode:

source: To share an image or snapshot with another project, do the following:
de: Um ein Abbild oder eine Schattenkopie mit einem anderen Projekt zu teilen, gehen Sie wie folgt vor:
id: Untuk berbagi image atau snapshot dengan proyek lain, lakukan hal berikut:

source: To take advantage of either container quotas or account quotas, your Object Storage proxy server must have ``container_quotas`` or ``account_quotas`` (or both) added to the ``[pipeline:main]`` pipeline. Each quota type also requires its own section in the ``proxy-server.conf`` file:
de: Um die Vorteile von Container- oder Account-Kontingenten nutzen zu können, muss Ihr Object Storage Proxy-Server ``container_quotas`` oder ``account_quotas`` (oder beides) zur Pipeline ``[pipeline:main]`` hinzugefügt haben. Jeder Kontingenttyp benötigt auch einen eigenen Abschnitt in der Datei ``proxy-server.conf``:
id: Untuk memanfaatkan kuota container atau kuota akun, server proksi Object Storage Anda harus memiliki ``container_quotas`` atau ``account_quotas`` (atau keduanya) ditambahkan ke pipaline ``[pipeline: main] ``. Setiap jenis kuota juga memerlukan bagiannya sendiri di file ``proxy-server.conf``:

source: To take the first path, you can modify the OpenStack code directly. Learn `how to contribute <https://wiki.openstack.org/wiki/How_To_Contribute>`_, follow the `Developer's Guide <https://docs.openstack.org/infra/manual/developers.html>`_, make your changes, and contribute them back to the upstream OpenStack project. This path is recommended if the feature you need requires deep integration with an existing project. The community is always open to contributions and welcomes new functionality that follows the feature-development guidelines. This path still requires you to use DevStack for testing your feature additions, so this chapter walks you through the DevStack environment.
de: Um den ersten Pfad zu nehmen, können Sie den OpenStack-Code direkt ändern. Erfahren Sie, `wie Sie einen Beitrag leisten können <https://wiki.openstack.org/wiki/How_To_Contribute>`_, folgen Sie dem `Developer's Guide <https://docs.openstack.org/infra/manual/developers.html>`_, nehmen Sie Ihre Änderungen vor und tragen Sie sie wieder in das vorgelagerte OpenStack-Projekt ein. Dieser Pfad wird empfohlen, wenn die gewünschte Funktion eine tiefe Integration mit einem bestehenden Projekt erfordert. Die Community ist immer offen für Beiträge und begrüßt neue Funktionen, die den Richtlinien zur Entwicklung von Funktionen entsprechen. Dieser Pfad erfordert immer noch, dass Sie DevStack zum Testen Ihrer Feature-Erweiterungen verwenden, daher führt Sie dieses Kapitel durch die DevStack-Umgebung.
id: Untuk mengambil jalur pertama, Anda dapat memodifikasi kode OpenStack secara langsung. Belajar `how to contribute <https://wiki.openstack.org/wiki/How_To_Contribute>`_, ikuti `Developer's Guide <https://docs.openstack.org/infra/manual/developers.html>`_, buat perubahan Anda, dan kontribusikan kembali ke proyek OpenStack hulu. Jalur ini disarankan jika fitur yang Anda butuhkan memerlukan integrasi yang mendalam dengan proyek yang ada. Komunitas selalu terbuka untuk kontribusi dan menyambut fungsionalitas baru yang mengikuti panduan pengembangan fitur. Jalur ini masih mengharuskan Anda untuk menggunakan DevStack untuk menguji penambahan fitur Anda, jadi bab ini menuntun Anda melalui lingkungan DevStack.

source: To this day, `the issue <https://bugs.launchpad.net/nova/+bug/832507>`__ doesn't have a permanent resolution, but we look forward to the discussion at the next summit.
de: Bis heute hat die `Frage <https://bugs.launchpad.net/nova/+bug/832507>`__ keine dauerhafte Lösung, aber wir freuen uns auf die Diskussion beim nächsten Szmmit.
id: Sampai hari ini, `the issue <https://bugs.launchpad.net/nova/+bug/832507>`__ tidak memiliki resolusi permanen, tetapi kami menantikan diskusi di pertemuan berikutnya.

source: To understand the difference between user data and metadata, realize that user data is created before an instance is started. User data is accessible from within the instance when it is running. User data can be used to store configuration, a script, or anything the tenant wants.
de: Um den Unterschied zwischen Benutzerdaten und Metadaten zu verstehen, stellen Sie fest, dass Benutzerdaten erstellt werden, bevor eine Instanz gestartet wird. Auf die Benutzerdaten kann innerhalb der Instanz zugegriffen werden, wenn sie ausgeführt werden. Benutzerdaten können verwendet werden, um die Konfiguration, ein Skript oder alles, was der Mandant wünscht, zu speichern.

source: To update a default value for a new tenant, update the property in the ``/etc/cinder/cinder.conf`` file.
de: Um einen Standardwert für einen neuen Mandanten zu aktualisieren, aktualisieren Sie die Eigenschaft in der Datei ``/etc/cinder/cinder/cinder.conf``.
id: Untuk memperbarui nilai default untuk penyewa baru, perbarui properti di file ``/etc/cinder/cinder.conf``.

source: To update a service on each node, you generally modify one or more configuration files, stop the service, synchronize the database schema, and start the service. Some services require different steps. We recommend verifying operation of each service before proceeding to the next service.
de: Um einen Dienst auf jedem Knoten zu aktualisieren, ändern Sie in der Regel eine oder mehrere Konfigurationsdateien, stoppen den Dienst, synchronisieren das Datenbankschema und starten den Dienst. Einige Dienste erfordern unterschiedliche Schritte. Wir empfehlen, den Betrieb jedes Dienstes zu überprüfen, bevor Sie mit dem nächsten Dienst fortfahren.
id: Untuk update layanan pada setiap node, Anda biasanya memodifikasi satu atau lebih file konfigurasi, menghentikan layanan, menyinkronkan skema database, dan memulai layanan. Beberapa layanan memerlukan langkah-langkah berbeda. Kami merekomendasikan verifikasi operasi setiap layanan sebelum melanjutkan ke layanan berikutnya.

source: To verify the quota, run the :command:`swift stat` command again:
de: Um die Quote zu überprüfen, führen Sie den Befehl :command:`swift stat` erneut aus:
id: Untuk memverifikasi kuota, jalankan kembali perintah :command:`swift stat``:

source: To view a flavor's access list, do the following:
de: Um die Zugriffsliste einer Variante anzuzeigen, gehen Sie wie folgt vor:
id: Untuk melihat daftar akses flavor, lakukan hal berikut:

source: To view a list of options for the ``nova quota-update`` command, run:
de: Um eine Liste der Optionen für den Befehl ``nova quota-update`` anzuzeigen, führen Sie aus:
id: Untuk melihat daftar opsi untuk perintah ``nova quota-update``, jalankan:

source: To view account quotas placed on a project:
de: Zum Anzeigen von Kontoquoten, die für ein Projekt vergeben wurden:
id: Untuk melihat kuota akun yang ditempatkan pada proyek:

source: To view all tenants, run:
de: Um alle Mandanten anzuzeigen, führen Sie aus:
id: Untuk melihat semua penyewa, jalankan:

source: To view and update Object Storage quotas, use the :command:`swift` command provided by the ``python-swiftclient`` package. Any user included in the project can view the quotas placed on their project. To update Object Storage quotas on a project, you must have the role of ResellerAdmin in the project that the quota is being applied to.
de: Um Kontingente für die Objektspeicherung anzuzeigen und zu aktualisieren, verwenden Sie den Befehl :command:`swift`, der vom Paket ``python-swiftclient`` bereitgestellt wird. Jeder in das Projekt eingebundene Benutzer kann die in seinem Projekt platzierten Quoten einsehen. Um die Kontingente für die Objektspeicherung in einem Projekt zu aktualisieren, müssen Sie die Rolle des ResellerAdmin in dem Projekt haben, auf das das Kontingent angewendet wird.
id: Untuk melihat dan memperbarui kuota Object Storage, gunakan perintah :command:`swift` yang disediakan oleh paket ``python-swiftclient``. Setiap pengguna yang termasuk dalam proyek dapat melihat kuota yang ditempatkan pada proyek mereka. Untuk memperbarui kuota Object Storage pada proyek, Anda harus memiliki peran ResellerAdmin dalam proyek yang sedang diterapkan kuota.

source: To view the details of a security group:
de: Um die Details einer Sicherheitsgruppe anzuzeigen:
id: Untuk melihat detail grup keamanan:

source: Tools for automated neutron diagnosis
de: Werkzeuge zur automatisierten Neutron-Diagnose
id: Alat untuk diagnosis neutron otomatis

source: Topics to consider include:
de: Zu den zu berücksichtigenden Themen gehören:
id: Topik yang perlu dipertimbangkan meliputi:

source: Total Cloud Controller Failure
de: Totaler Ausfall des Cloud Controllers
id: Total Kegagalan Pengontrol Cloud

source: Total Compute Node Failure
de: Totaler Ausfall des Compute-Knotens
id: kegagalan total Compute Node

source: Toward a Python SDK
de: Auf dem Weg zu einem Python SDK
id: Menuju SDK Python

source: Tracing Instance Requests
de: Verfolgung von Instanzanforderungen
id: Melacak Permintaan Instance

source: Trending
de: Beliebt
id: Tren

source: Trending can give you great insight into how your cloud is performing day to day. You can learn, for example, if a busy day was simply a rare occurrence or if you should start adding new compute nodes.
de: Trending kann Ihnen einen guten Einblick in die tägliche Performance Ihrer Cloud geben. Sie können z.B. erfahren, ob ein arbeitsreicher Tag einfach ein seltenes Ereignis war oder ob Sie neue Compute-Knoten hinzufügen sollten.
id: Tren dapat memberi Anda wawasan hebat tentang kinerja cloud Anda dari hari ke hari. Anda dapat belajar, misalnya, jika hari yang sibuk hanyalah kejadian langka atau jika Anda harus mulai menambahkan node komputasi baru.

source: Trending takes a slightly different approach than alerting. While alerting is interested in a binary result (whether a check succeeds or fails), trending records the current state of something at a certain point in time. Once enough points in time have been recorded, you can see how the value has changed over time.
de: Der Trend verfolgt einen etwas anderen Ansatz als die Alarmierung. Während die Alarmierung an einem binären Ergebnis interessiert ist (ob eine Prüfung erfolgreich ist oder nicht), zeichnet der Trend den aktuellen Zustand von etwas zu einem bestimmten Zeitpunkt auf. Sobald genügend Zeitpunkte erfasst wurden, können Sie sehen, wie sich der Wert im Laufe der Zeit verändert hat.
id: Tren mengambil pendekatan yang sedikit berbeda dari yang mengingatkan. Sementara peringatan tertarik pada hasil biner (apakah cek berhasil atau gagal), tren mencatat kondisi saat ini dari sesuatu pada titik waktu tertentu. Setelah titik waktu yang cukup telah dicatat, Anda dapat melihat bagaimana nilainya berubah dari waktu ke waktu.

source: Troubleshooting Open vSwitch
de: Fehlerbehebung Open vSwitch
id: Pemecahan masalah Open vSwitch

source: Try executing the :command:`openstack server reboot` command again. You should see an error message about why the instance was not able to boot.
de: Versuchen Sie, den Befehl :command:`openstack server reboot` erneut auszuführen. Du solltest eine Fehlermeldung sehen, warum die Instanz nicht booten konnte.
id: Coba jalankan perintah :command:`openstack server reboot` lagi. Anda akan melihat pesan kesalahan tentang mengapa instance tidak bisa boot.

source: Type and number of API calls that can be made in a specific time interval
de: Art und Anzahl der API-Aufrufe, die in einem bestimmten Zeitintervall erfolgen können
