Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: I noticed that the API would suffer from a heavy load and respond slowly to particular EC2 requests such as ``RunInstances``.
de: Ich bemerkte, dass die API unter einer hohen Last leidet und langsam auf bestimmte EC2-Anfragen wie "RunInstances" reagiert.
id: Saya perhatikan bahwa API akan menderita dari beban yang berat dan merespons dengan lambat permintaan EC2 tertentu seperti ``RunInances``.

source: I reviewed the ``nova`` database and saw the instance's entry in the ``nova.instances`` table. The image that the instance was using matched what virsh was reporting, so no inconsistency there.
de: Ich habe die ``nova``-Datenbank überprüft und den Eintrag der Instanz in der Tabelle ``nova.instances`` gesehen. Das Bild, das die Instanz verwendete, entsprach dem, was virsh berichtete, also keine Inkonsistenz dort.
id: Saya meninjau basis data ``nova`` dan melihat entri instance di tabel ``nova.instances``. Image yang menggunakan instance cocok dengan apa yang dilaporkan virsh, jadi tidak ada ketidakkonsistenan di sana.

source: I was on-site in Kelowna, British Columbia, Canada setting up a new OpenStack cloud. The deployment was fully automated: Cobbler deployed the OS on the bare metal, bootstrapped it, and Puppet took over from there. I had run the deployment scenario so many times in practice and took for granted that everything was working.
de: Ich war vor Ort in Kelowna, British Columbia, Kanada, beim Aufbau einer neuen OpenStack-Cloud. Die Bereitstellung wurde vollständig automatisiert: Cobbler stellte das Betriebssystem auf dem blanken Metall bereit, bootstrapte es, und Puppet übernahm von dort aus. Ich hatte das Deployment-Szenario in der Praxis so oft ausgeführt und war davon ausgegangen, dass alles funktionierte.
id: Saya ada di lokasi di Kelowna, British Columbia, Kanada menyiapkan cloud OpenStack baru. Penyebaran sepenuhnya otomatis: Cobbler mengerahkan OS pada bare metal, bootstrap, dan Puppet mengambil alih dari sana. Saya telah menjalankan skenario penyebaran berkali-kali dalam praktik dan menerima begitu saja bahwa semuanya bekerja.

source: I was totally confused at this point, so I texted our network admin to see if he was available to help. He logged in to both switches and immediately saw the problem: the switches detected spanning tree packets coming from the two compute nodes and immediately shut the ports down to prevent spanning tree loops:
de: Ich war an dieser Stelle völlig verwirrt, also schrieb ich unserem Netzwerkadministrator eine SMS, um zu sehen, ob er für Hilfe zur Verfügung stand. Er loggte sich bei beiden Switches ein und sah sofort das Problem: Die Switches erkannten Spanning-Tree-Pakete, die von den beiden Compute-Knoten kamen, und schlossen sofort die Ports, um Spanning-Tree-Schleifen zu verhindern:
id: Saya benar-benar bingung pada saat ini, jadi saya mengirim sms admin jaringan kami untuk melihat apakah dia tersedia untuk membantu. Dia login ke kedua switch dan segera melihat masalahnya: switch mendeteksi spanning tree paket yang berasal dari dua node komputasi dan segera menutup port untuk mencegah spanning tree loop:

source: Identity
de: Identität

source: Identity is another security consideration. Authentication centralization provides a single authentication point for users across the deployment, and a single administration point for traditional create, read, update, and delete operations. Centralized authentication is also useful for auditing purposes because all authentication tokens originate from the same source.
de: Identität ist ein weiterer Sicherheitsaspekt. Die Zentralisierung der Authentifizierung bietet einen einzigen Authentifizierungspunkt für Benutzer in der gesamten Bereitstellung und einen einzigen Verwaltungspunkt für traditionelle Erstellungs-, Lese-, Aktualisierungs- und Löschvorgänge. Die zentralisierte Authentifizierung ist auch für Auditierungszwecke nützlich, da alle Authentifizierungstoken aus derselben Quelle stammen.
id: Identitas adalah pertimbangan keamanan lainnya. Sentralisasi otentikasi menyediakan titik otentikasi tunggal untuk pengguna di seluruh penyebaran, dan titik administrasi tunggal untuk operasi tradisional membuat, membaca, memperbarui, dan menghapus. Otentikasi terpusat juga berguna untuk tujuan audit karena semua token otentikasi berasal dari sumber yang sama.

source: Identity service - Clear any expired tokens before synchronizing the database.
de: Identitätsdienst - Löschen Sie alle abgelaufenen Token, bevor Sie die Datenbank synchronisieren.
id: Layanan Identity - Hapus token yang kedaluwarsa sebelum menyinkronkan database.

source: If :command:`openstack server show` does not sufficiently explain the failure, searching for the instance UUID in the ``nova-compute.log`` on the compute node it was scheduled on or the ``nova-scheduler.log`` on your scheduler hosts is a good place to start looking for lower-level problems.
de: Wenn :command:`openstack server show` den Fehler nicht ausreichend erklärt, ist die Suche nach der Instanz UUID in der ``nova-compute.log`` auf dem Compute-Knoten, auf dem sie geplant wurde, oder der ``nova-scheduler.log`` auf Ihren Scheduler-Hosts ein guter Ort, um mit der Suche nach Problemen der unteren Ebene zu beginnen.

source: If Keystone is located remotely instead, edit the ``glance-api.conf`` and ``nova.conf`` files. In the ``[barbican]`` section, configre the ``auth_endpoint`` option:
de: Wenn sich Keystone stattdessen entfernt befindet, bearbeiten Sie die Dateien ``glance-api.conf`` und ``nova.conf``. Konfigurieren Sie im Abschnitt ``[barbican]`` die Option ``auth_endpoint``:
id: Jika Keystone terletak dari jarak jauh, edit file ``glance-api.conf`` dan ``nova.conf``. Di bagian ``[barbican] ``, konfigurasikan opsi ``auth_endpoint``:

source: If OpenStack :term:`Identity service <Identity service (keystone)>` is responding slowly, it could be due to the token table getting large. This can be fixed by running the :command:`keystone-manage token_flush` command.
de: Wenn OpenStack :term:`Identity service <Identity service (keystone)>` langsam reagiert, könnte es daran liegen, dass die Token-Tabelle groß wird. Dies kann durch Ausführen des Befehls :command:`keystone-manage token_flush` behoben werden.
id: Jika OpenStack :term:`Identity service <Identity service (keystone)>` merespons dengan lambat, bisa jadi karena tabel token semakin besar. Ini dapat diperbaiki dengan menjalankan perintah :command:`keystone-manage token_flush` .

source: If a compute node fails and won't be fixed for a few hours (or at all), you can relaunch all instances that are hosted on the failed node if you use shared storage for ``/var/lib/nova/instances``.
de: Wenn ein Compute Node ausfällt und für einige Stunden (oder überhaupt nicht) repariert wird, können Sie alle Instanzen, die auf dem ausgefallenen Knoten gehostet werden, neu starten, wenn Sie gemeinsamen Speicher für ``/var/lib/nova/instances`` verwenden.
id: Jika compute Node gagal dan tidak akan diperbaiki selama beberapa jam (atau sama sekali), Anda dapat meluncurkan kembali semua instance yang di-host pada node gagal jika Anda menggunakan penyimpanan bersama untuk ``/var/lib/nova/instances``.

source: If a hard drive fails in an Object Storage node, replacing it is relatively easy. This assumes that your Object Storage environment is configured correctly, where the data that is stored on the failed drive is also replicated to other drives in the Object Storage environment.
de: Wenn eine Festplatte in einem Objektspeicherknoten ausfällt, ist das Ersetzen relativ einfach. Dies setzt voraus, dass Ihre Objektspeicherumgebung korrekt konfiguriert ist, wobei die Daten, die auf dem ausgefallenen Laufwerk gespeichert sind, auch auf andere Laufwerke in der Objektspeicherumgebung repliziert werden.
id: Jika hard drive gagal dalam node Object Storage, mengganti itu relatif mudah. Ini mengasumsikan bahwa lingkungan penyimpanan objek Anda dikonfigurasi dengan benar, di mana data yang disimpan pada drive yang gagal juga direplikasi ke drive lain di lingkungan penyimpanan objek.

source: If a storage node requires a reboot, simply reboot it. Requests for data hosted on that node are redirected to other copies while the server is rebooting.
de: Wenn ein Speicherknoten einen Neustart erfordert, starten Sie ihn einfach neu. Anfragen für Daten, die auf diesem Knoten gehostet werden, werden während des Neustarts des Servers auf andere Kopien umgeleitet.
id: Jika storage node memerlukan reboot, cukup reboot itu. Permintaan untuk data yang di-host pada node itu dialihkan ke salinan lain saat server me-reboot.

source: If a user tries to create a volume and the volume immediately goes into an error state, the best way to troubleshoot is to grep the cinder log files for the volume's UUID. First try the log files on the cloud controller, and then try the storage node where the volume was attempted to be created:
de: Wenn ein Benutzer versucht, einen Datenträger zu erstellen und der Datenträger in einen Fehlerzustand versetzt wird, ist der beste Weg zur Fehlerbehebung, die Cinder-Logdateien für die UUID des Datenträgers zu erfassen. Versuchen Sie zuerst die Protokolldateien auf dem Cloud-Controller und dann den Speicherknoten, auf dem der Datenträger erstellt werden sollte:
id: Jika pengguna mencoba membuat volume dan volume segera masuk ke status kesalahan, cara terbaik untuk memecahkan masalah adalah dengan mengambil file log cinder untuk UUID volume. Pertama-tama coba file log pada pengontrol cloud, dan kemudian coba node penyimpanan tempat volume dicoba dibuat:

source: If an instance does not boot, meaning ``virsh list`` never shows the instance as even attempting to boot, do the following on the compute node:
de: Wenn eine Instanz nicht bootet, d.h. ``virsh list`` zeigt die Instanz nie als Startversuch an, gehen Sie wie folgt vor auf dem Compute-Knoten:
id: Jika sebuah instance tidak bisa boot, berarti ``virsh list`` tidak pernah memperlihatkan instance tersebut bahkan ketika mencoba untuk boot, lakukan hal berikut pada node komputasi:

source: If an instance fails to start and immediately moves to an error state, there are a few different ways to track down what has gone wrong. Some of these can be done with normal user access, while others require access to your log server or compute nodes.
de: Wenn eine Instanz nicht startet und sofort in einen Fehlerzustand übergeht, gibt es verschiedene Möglichkeiten, um herauszufinden, was schief gelaufen ist. Einige davon können mit normalem Benutzerzugriff durchgeführt werden, während andere den Zugriff auf Ihren Protokollserver oder Compute-Knoten erfordern.

source: If any of these links are missing or incorrect, it suggests a configuration error. Bridges can be added with ``ovs-vsctl add-br``, and ports can be added to bridges with ``ovs-vsctl add-port``. While running these by hand can be useful debugging, it is imperative that manual changes that you intend to keep be reflected back into your configuration files.
de: Wenn einer dieser Links fehlt oder falsch ist, wird ein Konfigurationsfehler angezeigt. Brücken können mit ``ovs-vsctl add-br`` hinzugefügt werden, und Ports können Brücken mit ``ovs-vsctl add-port`` hinzugefügt werden. Während die manuelle Ausführung dieser Funktionen ein nützliches Debugging sein kann, ist es unerlässlich, dass manuelle Änderungen, die Sie beibehalten möchten, wieder in Ihre Konfigurationsdateien übernommen werden.
id: Jika ada dari tautan ini yang hilang atau salah, ini menunjukkan kesalahan konfigurasi. Bridges dapat ditambahkan dengan ``ovs-vsctl add-br``, dan port dapat ditambahkan ke bridge dengan ``ovs-vsctl add-port``. Saat menjalankan ini dengan tangan dapat menjadi debugging yang berguna, sangat penting bahwa perubahan manual yang Anda ingin tetap dipantulkan kembali ke file konfigurasi Anda.

source: If possible, we highly recommend that you dump your production database tables and test the upgrade in your development environment using this data. Several MySQL bugs have been uncovered during database migrations because of slight table differences between a fresh installation and tables that migrated from one version to another. This will have impact on large real datasets, which you do not want to encounter during a production outage.
de: Wenn möglich, empfehlen wir Ihnen dringend, Ihre Produktionsdatenbanktabellen zu sichern und das Upgrade in Ihrer Entwicklungsumgebung mit diesen Daten zu testen. Mehrere MySQL-Fehler wurden bei Datenbankmigrationen aufgedeckt, da es leichte Tabellenunterschiede zwischen einer Neuinstallation und Tabellen gibt, die von einer Version zur anderen migriert wurden. Dies hat Auswirkungen auf große reale Datensätze, die Sie bei einem Produktionsausfall nicht erleben möchten.
id: Jika memungkinkan, kami sangat menyarankan Anda membuang tabel database produksi Anda dan menguji upgrade di lingkungan pengembangan Anda menggunakan data ini. Beberapa bug MySQL telah ditemukan selama migrasi basis data karena sedikit perbedaan tabel antara instalasi baru dan tabel yang dimigrasikan dari satu versi ke versi lain. Ini akan berdampak pada kumpulan data nyata besar, yang Anda tidak ingin temui selama penghentian (outage) produksi.

source: If restarting the dnsmasq process doesn't fix the issue, you might need to use ``tcpdump`` to look at the packets to trace where the failure is. The DNS server listens on UDP port 53. You should see the DNS request on the bridge (such as, br100) of your compute node. Let's say you start listening with ``tcpdump`` on the compute node:
de: Wenn der Neustart des dnsmasq-Prozesses das Problem nicht behebt, müssen Sie möglicherweise ``tcpdump`` verwenden, um sich die Pakete anzusehen und zu verfolgen, wo der Fehler liegt. Der DNS-Server lauscht am UDP-Port 53. Sie sollten die DNS-Anfrage auf der Bridge (z.B. br100) Ihres Compute-Knotens sehen. Nehmen wir an, Sie beginnen mit dem Hören mit ``tcpdump`` auf dem Compute-Knoten:
id: Jika memulai kembali proses dnsmasq tidak memperbaiki masalah, Anda mungkin perlu menggunakan ``tcpdump`` untuk melihat paket-paket untuk melacak di mana kegagalannya. Server DNS mendengarkan pada port UDP 53. Anda harus melihat permintaan DNS pada bridge (seperti, br100) dari node komputasi Anda. Katakanlah Anda mulai mendengarkan dengan ``tcpdump`` pada compute node:

source: If share network list is empty or does not contain a required network, just create, for example, a share network with a private network and subnetwork.
de: Wenn die Liste der Freigaben-Netzwerke leer ist oder kein erforderliches Netzwerk enthält, erstellen Sie beispielsweise ein Freigabenetzwerk mit einem privaten Netzwerk und einem Subnetz.

source: If such a share type does not exist, an Admin should create it using :command:`manila type-create` command before other users are able to use it
de: Wenn ein solcher Share-Typ nicht existiert, sollte ein Admin ihn mit dem Befehl :command:`manila type-create` erstellen, bevor andere Benutzer ihn verwenden können

source: If the affected instances also had attached volumes, first generate a list of instance and volume UUIDs:
de: Wenn die betroffenen Instanzen auch angehängte Volumes hatten, erzeugen Sie zunächst eine Liste von Instanz- und Volume UUIDs:
id: Jika instance yang terpengaruh juga memiliki volume terlampir, pertama-tama buat daftar instance dan volume UUID:

source: If the error indicates that the problem is with another component, switch to tailing that component's log file. For example, if nova cannot access glance, look at the ``glance-api`` log:
de: Wenn der Fehler darauf hinweist, dass das Problem mit einer anderen Komponente zusammenhängt, wechseln Sie zum Tailing der Protokolldatei dieser Komponente. Wenn nova beispielsweise nicht auf glance zugreifen kann, schauen Sie sich das Protokoll ``glance-api`` an:
id: Jika kesalahan menunjukkan bahwa masalahnya ada pada komponen lain, alihkan untuk menyesuaikan file log komponen itu. Misalnya, jika nova tidak dapat mengakses glance, lihat pada log ``glance-api``:

source: If the instance fails to resolve the hostname, you have a DNS problem. For example:
de: Wenn die Instanz den Hostnamen nicht auflöst, haben Sie ein DNS-Problem. Zum Beispiel:
id: Jika instance gagal untuk menyelesaikan nama host, Anda memiliki masalah DNS. Sebagai contoh:

source: If the package manager prompts you to update configuration files, reject the changes. The package manager appends a suffix to newer versions of configuration files. Consider reviewing and adopting content from these files.
de: Wenn der Paketmanager Sie auffordert, die Konfigurationsdateien zu aktualisieren, lehnen Sie die Änderungen ab. Der Paketmanager fügt neueren Versionen von Konfigurationsdateien ein Suffix hinzu. Erwägen Sie, Inhalte aus diesen Dateien zu überprüfen und zu übernehmen.
id: Jika manajer paket meminta Anda untuk update file konfigurasi, tolak perubahannya. Manajer paket menambahkan akhiran ke versi yang lebih baru dari file konfigurasi. Pertimbangkan untuk meninjau dan mengadopsi konten dari file-file ini.

source: If the problem does not seem to be related to dnsmasq itself, at this point use ``tcpdump`` on the interfaces to determine where the packets are getting lost.
de: Wenn das Problem nicht mit dnsmasq selbst zusammenhängt, verwenden Sie an dieser Stelle ``tcpdump`` auf den Schnittstellen, um festzustellen, wo die Pakete verloren gehen.
id: Jika masalah tampaknya tidak terkait dengan dnsmasq itu sendiri, pada titik ini gunakan ``tcpdump`` pada antarmuka untuk menentukan di mana paket-paket hilang.

source: If the service refuses to stop, then run the :command:`pkill` command to stop the service, then restart the service:
de: Wenn sich der Dienst weigert zu stoppen, führen Sie den Befehl :command:`pkill` aus, um den Dienst zu stoppen, und starten Sie dann den Dienst neu:
id: Jika layanan menolak untuk berhenti, maka jalankan perintah :command:`pkill`untuk menghentikan layanan, kemudian mulai ulang layanan:

source: If the share types list is empty or does not contain a type you need, create the required share type using this command:
de: Wenn die Liste der Freigabetypen leer ist oder keinen benötigten Typ enthält, erstellen Sie mit diesem Befehl den gewünschten Freigabetyp:

source: If there are errors, run the :command:`cluster_status` command to make sure there are no partitions:
de: Wenn es Fehler gibt, führen Sie den Befehl :command:`cluster_status` aus, um sicherzustellen, dass es keine Partitionen gibt:
id: Jika ada kesalahan, jalankan perintah :command:`cluster_status` untuk memastikan tidak ada partisi:

source: If there are no errors, restart the RabbitMQ service on the next controller node.
de: Wenn keine Fehler vorliegen, starten Sie den RabbitMQ-Dienst auf dem nächsten Controller-Knoten neu.
id: Jika tidak ada kesalahan, restart layanan RabbitMQ pada node controller berikutnya.

source: If there is not enough information in the existing logs, you may need to add your own custom logging statements to the ``nova-*`` services.
de: Wenn nicht genügend Informationen in den vorhandenen Protokollen vorhanden sind, müssen Sie möglicherweise Ihre eigenen benutzerdefinierten Protokollanweisungen zu den ``nova-*``Diensten hinzufügen.
id: Jika tidak ada informasi yang cukup di log yang ada, Anda mungkin perlu menambahkan pernyataan logging kustom Anda sendiri ke layanan ``nova- * ``.

source: If there's a suspicious-looking dnsmasq log message, take a look at the command-line arguments to the dnsmasq processes to see if they look correct:
de: Wenn es eine verdächtig aussehende dnsmasq-Protokollnachricht gibt, werfen Sie einen Blick auf die Befehlszeilenargumente für die dnsmasq-Prozesse, um festzustellen, ob sie korrekt aussehen:
id: Jika ada pesan log dnsmasq yang tampak mencurigakan, lihat argumen baris perintah untuk proses dnsmasq untuk melihat apakah mereka terlihat benar:

source: If you access or view the user's content and data, get approval first!
de: Wenn Sie auf die Inhalte und Daten des Benutzers zugreifen oder diese anzeigen, holen Sie sich zuerst eine Genehmigung!
id: Jika Anda mengakses atau melihat konten dan data pengguna, dapatkan persetujuan terlebih dahulu!

source: If you are able to use :term:`SSH <secure shell (SSH)>` to log into an instance, but it takes a very long time (on the order of a minute) to get a prompt, then you might have a DNS issue. The reason a DNS issue can cause this problem is that the SSH server does a reverse DNS lookup on the IP address that you are connecting from. If DNS lookup isn't working on your instances, then you must wait for the DNS reverse lookup timeout to occur for the SSH login process to complete.
de: Wenn Sie in der Lage sind, sich mit :term:`SSH <secure shell (SSH)>` bei einer Instanz anzumelden, es aber sehr lange dauert (in der Größenordnung einer Minute), bis Sie eine Eingabeaufforderung erhalten, dann haben Sie möglicherweise ein DNS-Problem. Der Grund, warum ein DNS-Problem dieses Problem verursachen kann, ist, dass der SSH-Server eine Reverse-DNS-Suche nach der IP-Adresse durchführt, von der aus Sie eine Verbindung herstellen. Wenn das DNS-Lookup auf Ihren Instanzen nicht funktioniert, müssen Sie warten, bis der DNS-Reverse-Lookup-Timeout auftritt, damit der SSH-Anmeldeprozess abgeschlossen ist.
id: Jika Anda dapat menggunakan :term:`SSH <secure shell (SSH)>` untuk masuk ke sebuah instance, tetapi butuh waktu yang sangat lama (dalam urutan satu menit) untuk mendapatkan prompt, maka Anda mungkin memiliki DNS issue. Alasan masalah DNS dapat menyebabkan masalah ini adalah bahwa server SSH melakukan pencarian DNS terbalik pada alamat IP yang Anda hubungkan. Jika pencarian DNS tidak bekerja pada instance Anda, maka Jika Anda dapat menggunakan: istilah: `SSH <secure shell (SSH)>` untuk masuk ke sebuah instance, tetapi butuh waktu yang sangat lama (dalam urutan satu menit) untuk mendapatkan prompt, maka Anda mungkin memiliki Masalah DNS. Alasan masalah DNS dapat menyebabkan masalah ini adalah bahwa server SSH melakukan pencarian DNS terbalik pada alamat IP yang Anda hubungkan. Jika pencarian DNS tidak berfungsi pada instance Anda, maka Anda harus menunggu waktu tunggu DNS reverse lookup agar proses masuk SSH selesai.

source: If you are encountering any sort of networking difficulty, one good initial troubleshooting step is to make sure that your interfaces are up. For example:
de: Wenn Sie auf eine Art von Netzwerkproblem stoßen, ist ein guter erster Schritt zur Fehlerbehebung, sicherzustellen, dass Ihre Schnittstellen aktiviert sind. Zum Beispiel:
id: Jika Anda menghadapi kesulitan jaringan apa pun, satu langkah pemecahan masalah awal yang baik adalah memastikan bahwa antarmuka Anda sudah aktif. Sebagai contoh:

source: If you are logged in to an instance and ping an external host, for example, Google, the ping packet takes the route shown in :ref:`figure_traffic_route`.
de: Wenn Sie an einer Instanz angemeldet sind und einen externen Host, z.B. Google, pingen, nimmt das Ping-Paket den in :ref:`figure_traffic_route` angegebenen Weg.
id: Jika Anda masuk ke instance dan melakukan ping host eksternal, misalnya, Google, paket ping mengambil rute yang ditunjukkan :ref:`figure_traffic_route`.

source: If you are using cinder, run the following command to see a similar listing:
de: Wenn Sie Cinder verwenden, führen Sie den folgenden Befehl aus, um eine ähnliche Liste zu sehen:
id: Jika Anda menggunakan cinder, jalankan perintah berikut untuk melihat daftar serupa:
