Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: Once access to a flavor has been restricted, no other projects besides the ones granted explicit access will be able to see the flavor. This includes the admin project. Make sure to add the admin project in addition to the original project.
de: Sobald der Zugriff auf einen Flavor eingeschränkt wurde, können keine anderen Projekte außer denjenigen, die expliziten Zugriff haben, die Variante sehen. Dazu gehört auch das Admin-Projekt. Achten Sie darauf, dass Sie das Admin-Projekt zusätzlich zum ursprünglichen Projekt hinzufügen.
id: Setelah akses ke flavor telah dibatasi, tidak ada proyek lain selain yang diberikan akses eksplisit akan dapat melihat flavor. Ini termasuk proyek admin. Pastikan untuk menambahkan proyek admin di samping proyek asli.

source: Once allocated, a floating IP can be assigned to running instances from the dashboard either by selecting :guilabel:`Associate` from the actions drop-down next to the IP on the :guilabel:`Floating IPs` tab of the :guilabel:`Access & Security` page or by making this selection next to the instance you want to associate it with on the Instances page. The inverse action, Dissociate Floating IP, is available from the :guilabel:`Floating IPs` tab of the :guilabel:`Access & Security` page and from the :guilabel:`Instances` page.
de: Einmal zugewiesen, kann eine Floating IP laufenden Instanzen aus dem Dashboard zugewiesen werden, indem Sie entweder :guilabel:`Associate` aus der Dropdown-Liste Aktionen neben der IP auf der Seite :guilabel:`Floating IPs` der Seite :guilabel:`Access & Security` auswählen oder diese Auswahl neben der Instanz treffen, der Sie sie auf der Seite Instances zuordnen möchten. Die umgekehrte Aktion, Dissoziate Floating IP, ist auf der Registerkarte :guilabel:`Floating IPs` der Seite :guilabel:`Access & Security` und auf der Seite :guilabel:`Instances` verfügbar.

source: Once nova is sending notifications, install and configure StackTach. StackTach works for queue consumption and pipeline processing are configured to read these notifications from RabbitMQ servers and store them in a database. Users can inquire on instances, requests, and servers by using the browser interface or command-line tool, `Stacky <https://github.com/rackerlabs/stacky>`_. Since StackTach is relatively new and constantly changing, installation instructions quickly become outdated. Refer to the `StackTach Git repository <https://opendev.org/x/stacktach>`_ for instructions as well as a demostration video. Additional details on the latest developments can be discovered at the `official page <http://stacktach.com/>`_
de: Sobald nova Benachrichtigungen sendet, installieren und konfigurieren Sie StackTach. StackTach arbeitet für den Queue-Verbrauch und die Pipeline-Verarbeitung sind so konfiguriert, dass sie diese Benachrichtigungen von RabbitMQ-Servern lesen und in einer Datenbank speichern. Benutzer können Instanzen, Anforderungen und Server abfragen, indem sie die Browseroberfläche oder das Befehlszeilentool `Stacky <https://github.com/rackerlabs/stacky>`_ verwenden. Da StackTach relativ neu ist und sich ständig ändert, werden Installationsanweisungen schnell veraltet. Anweisungen sowie ein Demovideo finden Sie im `StackTach Git-Repository <https://opendev.org/x/stacktach>`_. Weitere Details zu den neuesten Entwicklungen finden Sie auf der `offiziellen Seite <http://stacktach.com/>`_

source: Once the files are restored, start everything back up:
de: Sobald die Dateien wiederhergestellt sind, starten Sie die Sicherung:
id: Setelah file dipulihkan, mulai kembali semuanya:

source: Once the volume has been frozen, do not attempt to read from or write to the volume, as these operations hang. The operating system stops every I/O operation and any I/O attempts are delayed until the file system has been unfrozen.
de: Sobald der Datenträger eingefroren ist, versuchen Sie nicht mehr, von dem Datenträger zu lesen oder in es zu schreiben, da diese Vorgänge hängen bleiben. Das Betriebssystem stoppt jeden I/O-Vorgang und alle I/O-Versuche werden verzögert, bis das Dateisystem aufgetaut wurde.

source: Once you have both pieces of information, run the :command:`openstack image add project` command:
de: Sobald Sie beide Informationen haben, führen Sie den Befehl :command:`openstack image add project` aus:
id: Setelah Anda memiliki kedua informasi tersebut, jalankan perintah :command:`openstack image add project` :

source: Once you have completed the inspection, unmount the mount point and release the qemu-nbd device:
de: Nachdem Sie die Inspektion abgeschlossen haben, entfernen Sie den Mount-Punkt und geben Sie das qemu-nbd-Gerät frei:
id: Setelah Anda menyelesaikan inspeksi, lepaskan mount point dan lepaskan perangkat qemu-nbd:

source: Once you have issued the :command:`fsfreeze` command, it is safe to perform the snapshot. For example, if the volume of your instance was named ``mon-volume`` and you wanted to snapshot it to an image named ``mon-snapshot``, you could now run the following:
de: Sobald Sie den Befehl :command:`fsfsfreeze` erteilt haben, ist es sicher, die Schattenkopie auszuführen. Wenn zum Beispiel den Datenträger Ihrer Instanz den Namen ``mon-volume`` hatte und Sie es zu einem Abbild mit dem Namen ``mon-snapshot`` schnappen wollten, konnten Sie nun folgendes ausführen:

source: Once you mount the disk file, you should be able to access it and treat it as a collection of normal directories with files and a directory structure. However, we do not recommend that you edit or touch any files because this could change the :term:`access control lists (ACLs) <access control list (ACL)>` that are used to determine which accounts can perform what operations on files and directories. Changing ACLs can make the instance unbootable if it is not already.
de: Sobald Sie die Festplattendatei gemountet haben, sollten Sie darauf zugreifen und sie wie eine Sammlung von normalen Verzeichnissen mit Dateien und einer Verzeichnisstruktur behandeln können. Wir empfehlen jedoch nicht, Dateien zu bearbeiten oder zu berühren, da dies den Begriff :`Zugriffskontrolllisten (ACLs) <Zugriffskontrollliste (ACL)>` ändern könnte, mit dem bestimmt wird, welche Konten welche Operationen an Dateien und Verzeichnissen durchführen können. Das Ändern von ACLs kann dazu führen, dass die Instanz nicht mehr bootfähig ist, wenn sie es nicht bereits ist.
id: Setelah Anda memasang file disk, Anda harus dapat mengaksesnya dan memperlakukannya sebagai kumpulan direktori normal dengan file dan struktur direktori. Namun, kami tidak menyarankan Anda mengedit atau menyentuh file apa pun karena ini dapat mengubah :term:`access control lists (ACLs) <access control list (ACL)>` yang digunakan untuk menentukan akun mana yang dapat melakukan operasi apa pada file dan direktori. Mengubah ACL dapat membuat instance tidak bisa di-boot jika belum.

source: Once you've determined which namespace you need to work in, you can use any of the debugging tools mention earlier by prefixing the command with ``ip netns exec <namespace>``. For example, to see what network interfaces exist in the first qdhcp namespace returned above, do this:
de: Sobald Sie festgestellt haben, in welchem Namensraum Sie arbeiten müssen, können Sie jedes der zuvor genannten Debugging-Tools verwenden, indem Sie dem Befehl ``ip netns exec <namespace>`` voranstellen. Um beispielsweise zu sehen, welche Netzwerkschnittstellen im ersten oben zurückgegebenen qdhcp-Namensraum vorhanden sind, führen Sie dies aus:
id: Setelah Anda menentukan namespace mana yang Anda butuhkan untuk bekerja, Anda dapat menggunakan salah satu alat debugging yang disebutkan sebelumnya dengan mengawali perintah dengan ``ip netns exec <namespace> ``. Misalnya, untuk melihat antarmuka jaringan apa yang ada di namespace qdhcp pertama yang dikembalikan di atas, lakukan ini:

source: Once you've gathered this information, creating the user in the dashboard is just another web form similar to what we've seen before and can be found by clicking the :guilabel:`Users` link in the :guilabel:`Identity` navigation bar and then clicking the :guilabel:`Create User` button at the top right.
de: Sobald Sie diese Informationen gesammelt haben, ist die Erstellung des Benutzers im Dashboard nur noch eine weitere Webform ähnlich dem, was wir zuvor gesehen haben und kann durch Anklicken des Links :guilabel:`Users` in der Navigationsleiste von :guilabel:`Identity` und dann durch Anklicken der Schaltfläche :guilabel:`Create User` oben rechts gefunden werden.

source: One cloud controller acted as a gateway to all compute nodes. VlanManager was used for the network config. This means that the cloud controller and all compute nodes had a different VLAN for each OpenStack project. We used the ``-s`` option of ``ping`` to change the packet size. We watched as sometimes packets would fully return, sometimes they'd only make it out and never back in, and sometimes the packets would stop at a random point. We changed ``tcpdump`` to start displaying the hex dump of the packet. We pinged between every combination of outside, controller, compute, and instance.
de: Ein Cloud-Controller fungierte als Gateway zu allen Compute-Knoten. Für die Netzwerkkonfiguration wurde der VlanManager verwendet. Das bedeutet, dass der Cloud-Controller und alle Compute-Knoten für jedes OpenStack-Projekt ein anderes VLAN hatten. Wir haben die Option ``-s`` von ``ping`` verwendet, um die Paketgröße zu ändern. Wir beobachteten, wie manchmal Pakete vollständig zurückkehrten, manchmal schafften sie es nur heraus und nie wieder hinein, und manchmal hörten die Pakete an einem beliebigen Punkt auf. Wir haben ``tcpdump`` geändert, um den Hex-Dump des Pakets anzuzeigen. Wir haben zwischen jeder Kombination von außen, Controller, Compute und Instanz gepingt.
id: Satu pengendali cloud bertindak sebagai gateway ke semua node komputasi. VlanManager digunakan untuk konfigurasi jaringan. Ini berarti bahwa pengontrol cloud dan semua node komputasi memiliki VLAN yang berbeda untuk setiap proyek OpenStack. Kami menggunakan opsi ``-s`` dari ``ping`` untuk mengubah ukuran paket. Kami menyaksikan kadang-kadang paket akan kembali sepenuhnya, kadang-kadang mereka hanya bisa keluar dan tidak pernah kembali, dan kadang-kadang paket akan berhenti secara acak. Kami mengubah ``tcpdump`` untuk mulai menampilkan dump hex paket. Kami melakukan ping di antara setiap kombinasi luar, pengontrol, komputasi, dan instance.

source: One common networking problem is that an instance boots successfully but is not reachable because it failed to obtain an IP address from dnsmasq, which is the DHCP server that is launched by the ``nova-network`` service.
de: Ein häufiges Netzwerkproblem ist, dass eine Instanz erfolgreich bootet, aber nicht erreichbar ist, weil sie keine IP-Adresse von dnsmasq erhalten hat, dem DHCP-Server, der vom Dienst ``nova-network`` gestartet wird.
id: Salah satu masalah jaringan yang umum adalah bahwa instance mem-boot dengan sukses tetapi tidak dapat dijangkau karena gagal mendapatkan alamat IP dari dnsmasq, yang merupakan server DHCP yang diluncurkan oleh layanan ``nova-network``.

source: One great, although very in-depth, way of troubleshooting network issues is to use ``tcpdump``. We recommended using ``tcpdump`` at several points along the network path to correlate where a problem might be. If you prefer working with a GUI, either live or by using a ``tcpdump`` capture, check out `Wireshark <https://www.wireshark.org/>`_.
de: Eine großartige, wenn auch sehr detaillierte Art der Fehlerbehebung bei Netzwerkproblemen ist die Verwendung von ``tcpdump``. Wir empfehlen, ``tcpdump`` an mehreren Stellen entlang des Netzwerkpfades zu verwenden, um festzustellen, wo ein Problem auftreten könnte. Wenn Sie es vorziehen, mit einer GUI zu arbeiten, entweder live oder mit einem ``tcpdump`` Capture, schauen Sie sich `Wireshark <https://www.wireshark.org/>`_ an.
id: Satu cara hebat, meskipun sangat mendalam, cara mengatasi masalah jaringan adalah dengan menggunakan ``tcpdump``. Kami merekomendasikan penggunaan ``tcpdump`` di beberapa titik di sepanjang jalur jaringan (network path) untuk menghubungkan di mana masalah mungkin terjadi. Jika Anda lebih suka bekerja dengan GUI, secara langsung atau dengan menggunakan tangkapan ``tcpdump``, periksa `Wireshark <https://www.wireshark.org/>`_.

source: One interesting example is modifying the table of images and the owner of that image. This can be easily done if you simply display the unique ID of the owner. This example goes one step further and displays the readable name of the owner:
de: Ein interessantes Beispiel ist das Ändern der Tabelle der Abbilder und des Besitzers dieses Abbildes. Dies ist einfach möglich, wenn Sie einfach die eindeutige ID des Eigentümers anzeigen. Dieses Beispiel geht einen Schritt weiter und zeigt den lesbaren Namen des Eigentümers an:
id: Salah satu contoh menarik adalah memodifikasi tabel image dan pemilik image itu. Ini dapat dengan mudah dilakukan jika Anda hanya menampilkan ID unik pemiliknya. Contoh ini melangkah lebih jauh dan menampilkan nama pemilik yang dapat dibaca:

source: One key element of systems administration that is often overlooked is that end users are the reason systems administrators exist. Don't go the BOFH route and terminate every user who causes an alert to go off. Work with users to understand what they're trying to accomplish and see how your environment can better assist them in achieving their goals. Meet your users needs by organizing your users into projects, applying policies, managing quotas, and working with them.
de: Ein Schlüsselelement der Systemadministration, das oft übersehen wird, ist, dass Endbenutzer der Grund dafür sind, dass Systemadministratoren existieren. Gehen Sie nicht auf die BOFH-Route und beenden Sie jeden Benutzer, der eine Warnung auslöst. Arbeiten Sie mit Benutzern zusammen, um zu verstehen, was sie zu erreichen versuchen, und sehen Sie, wie Ihre Umgebung sie bei der Erreichung ihrer Ziele besser unterstützen kann. Erfüllen Sie die Anforderungen Ihrer Benutzer, indem Sie Ihre Benutzer in Projekten organisieren, Richtlinien anwenden, Quoten verwalten und mit ihnen arbeiten.
id: Salah satu elemen kunci dari administrasi sistem yang sering diabaikan adalah bahwa end users (pengguna) menjadi alasan administrator sistem hidup. Jangan pergi dengan rute BOFH dan menghentikan setiap pengguna yang menyebabkan peringatan berbunyi. Bekerja dengan pengguna untuk memahami apa yang mereka coba capai dan melihat bagaimana lingkungan Anda dapat lebih membantu mereka dalam mencapai tujuan mereka. Memenuhi kebutuhan pengguna Anda dengan mengatur pengguna Anda ke dalam proyek, menerapkan kebijakan, mengelola kuota, dan bekerja dengan mereka.

source: One last test is to launch a second instance and see whether the two instances can ping each other. If they can, the issue might be related to the firewall on the compute node.
de: Ein letzter Test besteht darin, eine zweite Instanz zu starten und zu sehen, ob die beiden Instanzen sich gegenseitig pingen können. Wenn möglich, könnte das Problem mit der Firewall auf dem Compute-Knoten zusammenhängen.
id: Satu tes terakhir adalah meluncurkan instance kedua dan melihat apakah kedua instance dapat saling ping. Jika mereka bisa, masalahnya mungkin terkait dengan firewall pada node komputasi.

source: One morning, a compute node failed to run any instances. The log files were a bit vague, claiming that a certain instance was unable to be started. This ended up being a red herring because the instance was simply the first instance in alphabetical order, so it was the first instance that ``nova-compute`` would touch.
de: Eines Morgens konnte ein Compute-Knoten keine Instanzen ausführen. Die Protokolldateien waren etwas vage und behaupteten, dass eine bestimmte Instanz nicht gestartet werden konnte. Dies endete damit, dass es sich um einen roten Hering handelte, weil die Instanz einfach die erste Instanz in alphabetischer Reihenfolge war, also war es die erste Instanz, die ``Nova-Compute`` berühren würde.
id: Suatu pagi, sebuah compute node gagal menjalankan instance. File log agak kabur, mengklaim bahwa instance tertentu tidak dapat dimulai. Ini akhirnya menjadi red herring karena instance hanyalah instance pertama dalam urutan abjad, jadi itu adalah instance pertama yang akan disentuh ``nova-compute``.

source: One of the long-time complaints surrounding OpenStack Networking was the lack of high availability for the layer 3 components. The Juno release introduced Distributed Virtual Router (DVR), which aims to solve this problem.
de: Eine der langjährigen Beschwerden rund um OpenStack Networking war die mangelnde Hochverfügbarkeit der Layer-3-Komponenten. Mit der Juno-Version wurde der Distributed Virtual Router (DVR) eingeführt, der dieses Problem lösen soll.
id: Salah satu keluhan lama seputar OpenStack Networking adalah kurangnya ketersediaan tinggi untuk komponen layer 3. Rilis Juno memperkenalkan Distributed Virtual Router (DVR), yang bertujuan untuk menyelesaikan masalah ini.

source: One of the most complex aspects of an OpenStack cloud is the networking configuration. You should be familiar with concepts such as DHCP, Linux bridges, VLANs, and iptables. You must also have access to a network hardware expert who can configure the switches and routers required in your OpenStack cloud.
de: Einer der komplexesten Aspekte einer OpenStack-Cloud ist die Netzwerkkonfiguration. Sie sollten mit Konzepten wie DHCP, Linux-Bridges, VLANs und iptables vertraut sein. Sie müssen auch Zugang zu einem Netzwerk-Hardware-Experten haben, der die in Ihrer OpenStack-Cloud benötigten Switches und Router konfigurieren kann.

source: One of the most requested features since OpenStack began (for components other than Object Storage, which tends to "just work"): easier upgrades. In all recent releases internal messaging communication is versioned, meaning services can theoretically drop back to backward-compatible behavior. This allows you to run later versions of some components, while keeping older versions of others.
de: Eines der gefragtesten Features seit Beginn von OpenStack (für andere Komponenten als Object Storage, das dazu neigt, "nur zu funktionieren"): einfachere Upgrades. In allen aktuellen Versionen wird die interne Messaging-Kommunikation versioniert, was bedeutet, dass Dienste theoretisch auf rückwärtskompatibles Verhalten zurückfallen können. Dies ermöglicht es Ihnen, spätere Versionen einiger Komponenten auszuführen, während Sie ältere Versionen anderer Komponenten beibehalten.
id: Salah satu fitur yang paling banyak diminta sejak OpenStack dimulai (untuk komponen selain Object Storage, yang cenderung "just work"): peningkatan yang lebih mudah. Dalam semua rilis terbaru, komunikasi pesan internal diversi versi, layanan makna secara teoritis dapat kembali ke perilaku backward-compatible. Ini memungkinkan Anda untuk menjalankan versi beberapa komponen yang lebih baru, sambil mempertahankan versi yang lebih lama dari yang lain.

source: One way to plan for cloud controller or storage proxy maintenance is to simply do it off-hours, such as at 1 a.m. or 2 a.m. This strategy affects fewer users. If your cloud controller or storage proxy is too important to have unavailable at any point in time, you must look into high-availability options.
de: Eine Möglichkeit, die Wartung von Cloud Controllern oder Storage-Proxys zu planen, besteht darin, dies einfach außerhalb der Geschäftszeiten zu tun, z.B. um 1 Uhr morgens oder 2 Uhr morgens. Diese Strategie betrifft weniger Benutzer. Wenn Ihr Cloud-Controller oder Speicherproxy zu wichtig ist, um zu einem beliebigen Zeitpunkt nicht verfügbar zu sein, müssen Sie sich mit Hochverfügbarkeitsoptionen befassen.
id: Salah satu cara untuk merencanakan pengontrol cloud atau pemeliharaan proksi penyimpanan adalah dengan melakukannya di luar jam, seperti pada pukul 1 atau 2 pagi. Strategi ini memengaruhi lebih sedikit pengguna. Jika pengontrol cloud atau proksi penyimpanan Anda terlalu penting untuk tidak tersedia kapan pun, Anda harus melihat ke opsi ketersediaan tinggi.

source: Open OpenStack Dashboard and launch an instance. If the instance launches, the issue is resolved.
de: Öffnen Sie das OpenStack Dashboard und starten Sie eine Instanz. Wenn die Instanz startet, ist das Problem behoben.
id: Buka OpenStack Dashboard dan luncurkan instance. Jika instance diluncurkan, masalah teratasi.

source: Open vSwitch, as used in the previous OpenStack Networking examples is a full-featured multilayer virtual switch licensed under the open source Apache 2.0 license. Full documentation can be found at `the project's website <http://www.openvswitch.org/>`_. In practice, given the preceding configuration, the most common issues are being sure that the required bridges (``br-int``, ``br-tun``, and ``br-ex``) exist and have the proper ports connected to them.
de: Open vSwitch, wie in den vorherigen OpenStack Networking-Beispielen verwendet, ist ein vollwertiger mehrschichtiger virtueller Switch, der unter der Open-Source-Lizenz Apache 2.0 lizenziert ist. Die vollständige Dokumentation finden Sie auf der `Website des Projekts <http://www.openvswitch.org/>`_. In der Praxis ist es angesichts der vorhergehenden Konfiguration am häufigsten der Fall, sicherzustellen, dass die erforderlichen Brücken (``br-int``, ``br-tun``, `br-tun`` und ``br-ex``) existieren und die richtigen Ports mit ihnen verbunden sind.
id: Open vSwitch, seperti yang digunakan dalam contoh OpenStack Networking sebelumnya adalah switch virtual multilayer berfitur lengkap yang dilisensikan di bawah lisensi open source Apache 2.0. Dokumentasi lengkap dapat ditemukan di `the project's website <http://www.openvswitch.org/>` _. Dalam prakteknya, mengingat konfigurasi sebelumnya, masalah yang paling umum adalah memastikan bahwa jembatan yang diperlukan (``br-int``, ``br-tun``, dan ``br-ex``) ada dan memiliki hak port yang terhubung dengannya.

source: OpenStack :term:`Block Storage service <Block Storage service (cinder)>` is similar to the Image service, so start by checking Identity-related services, and the back-end storage. Additionally, both the Block Storage and Image services rely on AMQP and SQL functionality, so consider these when debugging.
de: OpenStack :term:`Block Storage Service <Block Storage Service (cinder)>` ist ähnlich wie der Image Service, also beginnen Sie mit der Überprüfung von identitätsbezogenen Diensten und dem Backend-Speicher. Darüber hinaus sind sowohl der Block Storage als auch der Image Service auf AMQP- und SQL-Funktionen angewiesen, daher sollten Sie diese beim Debuggen berücksichtigen.
id: OpenStack :term:`Block Storage service <Block Storage service (cinder)>` mirip dengan layanan Image, jadi mulailah dengan memeriksa layanan yang berhubungan dengan Identity, dan penyimpanan back-end. Selain itu, baik layanan Block Storage dan Image bergantung pada fungsi AMQP dan SQL, jadi pertimbangkan ini saat debugging.
