Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: The qemu-nbd device tries to export the instance disk's different partitions as separate devices. For example, if vda is the disk and vda1 is the root partition, qemu-nbd exports the device as ``/dev/nbd0`` and ``/dev/nbd0p1``, respectively:
de: Das qemu-nbd-Gerät versucht, die verschiedenen Partitionen der Instanzplatte als separate Geräte zu exportieren. Wenn vda beispielsweise die Festplatte und vda1 die Root-Partition ist, exportiert qemu-nbd die Vorrichtung als ``/dev/nbd0`` und ``/dev/nbd0p1``:
id: Perangkat qemu-nbd mencoba untuk mengekspor partisi disk yang berbeda sebagai perangkat yang terpisah. Misalnya, jika vda adalah disk dan vda1 adalah partisi root, qemu-nbd mengekspor perangkat sebagai ``/dev/nbd0`` dan ``/dev/nbd0p1``, masing-masing:

source: The roadmap for the next release as it is developed can be seen at `Releases <https://releases.openstack.org>`_.
de: Die Roadmap für das nächste Release, wie sie entwickelt wird, ist unter `Releases <https://releases.openstack.org>`_ zu finden.
id: Roadmap untuk rilis berikutnya yang sedang dikembangkan dapat dilihat di `Releases <https://releases.openstack.org>`_.

source: The simplest option to get started is to use one hard drive with two partitions:
de: Die einfachste Möglichkeit, mit dem Programm zu beginnen, ist die Verwendung einer Festplatte mit zwei Partitionen:
id: Opsi paling sederhana untuk memulai adalah menggunakan satu hard drive dengan dua partisi:

source: The simplest place to start testing the next version of OpenStack is by setting up a new environment inside your own cloud. This might seem odd, especially the double virtualization used in running compute nodes. But it is a sure way to very quickly test your configuration.
de: Der einfachste Ort, um mit dem Testen der nächsten Version von OpenStack zu beginnen, ist die Einrichtung einer neuen Umgebung innerhalb Ihrer eigenen Cloud. Dies mag seltsam erscheinen, insbesondere die doppelte Virtualisierung, die beim Betrieb von Compute-Knoten verwendet wird. Aber es ist ein sicherer Weg, um Ihre Konfiguration sehr schnell zu testen.
id: Tempat paling sederhana untuk mulai menguji versi OpenStack berikutnya adalah dengan mengatur lingkungan baru di dalam cloud Anda sendiri. Ini mungkin tampak aneh, terutama virtualisasi ganda yang digunakan dalam menjalankan node komputasi. Tetapi ini adalah cara yang pasti untuk menguji konfigurasi Anda dengan sangat cepat.

source: The simplest reasons for nodes to fail to launch are quota violations or the scheduler being unable to find a suitable compute node on which to run the instance. In these cases, the error is apparent when you run a :command:`openstack server show` on the faulted instance:
de: Die einfachsten Gründe, warum Knoten nicht starten können, sind Quotenverletzungen oder der Scheduler kann keinen geeigneten Compute-Knoten finden, auf dem die Instanz ausgeführt werden kann. In diesen Fällen ist der Fehler offensichtlich, wenn Sie einen :command:`openstack server show` auf der fehlerhaften Instanz ausführen:

source: The simplest way to identify that this is the problem with your instance is to look at the console output of your instance. If DHCP failed, you can retrieve the console log by doing:
de: Der einfachste Weg, um zu erkennen, dass dies das Problem mit Ihrer Instanz ist, ist ein Blick auf die Konsolenausgabe Ihrer Instanz. Wenn DHCP fehlgeschlagen ist, können Sie das Konsolenprotokoll abrufen:
id: Cara paling sederhana untuk mengidentifikasi bahwa ini adalah masalah dengan instance Anda adalah dengan melihat output konsol instance Anda. Jika DHCP gagal, Anda dapat mengambil log konsol dengan melakukan:

source: The size of the volume in gigabytes. It is safe to leave this blank and have the Compute Service infer the size.
de: Die Größe des Datenträgers in Gigabyte. Es ist sicher, dieses Feld leer zu lassen und den Compute Service die Größe herleiten zu lassen.

source: The software stack is still Ubuntu 12.04 LTS, but now with OpenStack Havana from the Ubuntu Cloud Archive. KVM is the hypervisor, deployed using `FAI <http://fai-project.org/>`_ and Puppet for configuration management. The FAI and Puppet combination is used lab-wide, not only for OpenStack. There is a single cloud controller node, which also acts as network controller, with the remainder of the server hardware dedicated to compute nodes.
de: Der Software-Stack ist immer noch Ubuntu 12.04 LTS, aber jetzt mit OpenStack Havana aus dem Ubuntu Cloud Archive. KVM ist der Hypervisor, der über `FAI <http://fai-project.org/>`_ und Puppet für das Konfigurationsmanagement bereitgestellt wird. Die FAI- und Puppen-Kombination wird im gesamten Labor eingesetzt, nicht nur bei OpenStack. Es gibt einen einzigen Cloud-Controller-Knoten, der auch als Netzwerk-Controller fungiert, während der Rest der Server-Hardware für Compute-Knoten vorgesehen ist.
id: Tumpukan perangkat lunak masih Ubuntu 12,04 LTS, tetapi sekarang dengan OpenStack Havana dari Ubuntu Cloud Archive. KVM adalah hypervisor, dikerahkan menggunakan `FAI <http://fai-project.org/>`_ dan Puppet untuk manajemen konfigurasi. Kombinasi FAI dan Puppet digunakan di seluruh lab, tidak hanya untuk OpenStack. Ada node cloud controller tunggal, yang juga bertindak sebagai pengontrol jaringan, dengan sisa perangkat keras server yang didedikasikan untuk komputasi node.

source: The source files are located in ``/usr/lib/python2.7/dist-packages/nova``.
de: Die Quelldateien befinden sich in ``/usr/lib/python2.7/dist-packages/nova``.
id: File sumber terletak di ``/usr/lib/python2.7/dist-packages/nova``.

source: The starting point is the core count of your cloud. By applying some ratios, you can gather information about:
de: Der Ausgangspunkt ist die Kernzahl Ihrer Cloud. Durch die Anwendung einiger Kennzahlen können Sie Informationen über:
id: Titik awalnya adalah jumlah core cloud Anda. Dengan menerapkan beberapa rasio, Anda dapat mengumpulkan informasi tentang:

source: The swift services
de: Die swift Dienste
id: Layanan swift

source: The take away from this is if you observe an OpenStack process that appears to "stop" for a while and then continue to process normally, you should check that periodic tasks aren't the problem. One way to do this is to disable the periodic tasks by setting their interval to zero. Additionally, you can configure how often these periodic tasks run—in some cases, it might make sense to run them at a different frequency from the default.
de: Wenn Sie einen OpenStack-Prozess beobachten, der für eine Weile "zu stoppen" scheint und dann normal weiterarbeitet, sollten Sie überprüfen, ob periodische Aufgaben nicht das Problem sind. Eine Möglichkeit, dies zu tun, besteht darin, die periodischen Aufgaben zu deaktivieren, indem Sie ihr Intervall auf Null setzen. Zusätzlich können Sie konfigurieren, wie oft diese periodischen Aufgaben in einigen Fällen ausgeführt werden, es kann sinnvoll sein, sie mit einer anderen Frequenz als der Standardfrequenz auszuführen.
id: Kelemahan dari ini adalah jika Anda mengamati proses OpenStack yang tampaknya "stop" untuk sementara waktu dan kemudian melanjutkan proses secara normal, Anda harus memeriksa bahwa tugas-tugas berkala bukanlah masalahnya. Salah satu cara untuk melakukan ini adalah menonaktifkan tugas berkala dengan mengatur intervalnya ke nol. Selain itu, Anda dapat mengonfigurasi seberapa sering tugas-tugas berkala ini dijalankan — dalam beberapa kasus, mungkin masuk akal untuk menjalankannya pada frekuensi yang berbeda dari standarnya.

source: The team includes:
de: Das Team umfasst:

source: The technology behind OpenStack consists of a series of interrelated projects delivering various components for a cloud infrastructure solution. Each service provides an open API so that all of these resources can be managed through a dashboard that gives administrators control while empowering users to provision resources through a web interface, a command-line client, or software development kits that support the API. Many OpenStack APIs are extensible, meaning you can keep compatibility with a core set of calls while providing access to more resources and innovating through API extensions. The OpenStack project is a global collaboration of developers and cloud computing technologists. The project produces an open standard cloud computing platform for both public and private clouds. By focusing on ease of implementation, massive scalability, a variety of rich features, and tremendous extensibility, the project aims to deliver a practical and reliable cloud solution for all types of organizations.
de: Die Technologie hinter OpenStack besteht aus einer Reihe von zusammenhängenden Projekten, die verschiedene Komponenten für eine Cloud-Infrastrukturlösung liefern. Jeder Dienst stellt eine offene API zur Verfügung, so dass alle diese Ressourcen über ein Dashboard verwaltet werden können, das Administratoren die Kontrolle gibt und gleichzeitig den Benutzern die Möglichkeit gibt, Ressourcen über eine Weboberfläche, einen Befehlszeilen-Client oder Softwareentwicklungskits, die die API unterstützen, bereitzustellen. Viele OpenStack-APIs sind erweiterbar, d.h. Sie können die Kompatibilität mit einem Kernsatz von Aufrufen beibehalten, gleichzeitig Zugriff auf mehr Ressourcen bieten und durch API-Erweiterungen innovativ sein. Das OpenStack-Projekt ist eine globale Zusammenarbeit von Entwicklern und Cloud Computing-Technologen. Das Projekt entwickelt eine Open Standard Cloud Computing Plattform für Public und Private Clouds. Durch die Fokussierung auf einfache Implementierung, massive Skalierbarkeit, eine Vielzahl von umfangreichen Funktionen und enorme Erweiterbarkeit zielt das Projekt darauf ab, eine praktische und zuverlässige Cloud-Lösung für alle Arten von Unternehmen bereitzustellen.

source: The third version of the Compute API was broadly discussed and worked on during the Havana and Icehouse release cycles. Current discussions indicate that the V2 API will remain for many releases, and the next iteration of the API will be denoted v2.1 and have similar properties to the existing v2.0, rather than an entirely new v3 API. This is a great time to evaluate all API and provide comments while the next generation APIs are being defined. A new working group was formed specifically to `improve OpenStack APIs <https://wiki.openstack.org/wiki/API_Working_Group>`_ and create design guidelines, which you are welcome to join.
de: Die dritte Version der Compute API wurde während der Release-Zyklen von Havanna und Icehouse ausführlich diskutiert und bearbeitet. Aktuelle Diskussionen deuten darauf hin, dass die V2-API für viele Releases bestehen bleiben wird, und die nächste Iteration der API wird v2.1 genannt und hat ähnliche Eigenschaften wie die bestehende v2.0 und nicht wie eine völlig neue v3-API. Dies ist ein guter Zeitpunkt, um alle APIs zu evaluieren und Kommentare abzugeben, während die APIs der nächsten Generation definiert werden. Eine neue Arbeitsgruppe wurde speziell gebildet, um die `OpenStack-APIs zu verbessern <https://wiki.openstack.org/wiki/API_Working_Group>`_ und Designrichtlinien zu erstellen, denen Sie gerne beitreten können.
id: Versi ketiga dari Compute API dibahas secara luas dan dikerjakan selama siklus rilis Havana dan Icehouse. Diskusi saat ini menunjukkan bahwa V2 API akan tetap untuk banyak rilis, dan iterasi API berikutnya akan dilambangkan v2.1 dan memiliki sifat yang mirip dengan v2.0 yang ada, daripada API v3 yang sama sekali baru. Ini adalah waktu yang tepat untuk mengevaluasi semua API dan memberikan komentar ketika API generasi berikutnya sedang didefinisikan. Kelompok kerja baru dibentuk secara khusus untuk `improve OpenStack APIs <https://wiki.openstack.org/wiki/API_Working_Group>` _ dan membuat pedoman desain, yang dapat Anda ikuti.

source: The tunnel bridge, ``br-tun``, contains the ``patch-int`` interface and ``gre-<N>`` interfaces for each peer it connects to via GRE, one for each compute and network node in your cluster:
de: Die Tunnelbrücke, ``br-tun```, enthält die ``patch-int`` Schnittstelle und ``gre-<N>`` Schnittstellen für jeden Peer, mit dem sie sich über GRE verbindet, eine für jeden Rechen- und Netzwerkknoten in Ihrem Cluster:
id: Bridge tunnel, ``br-tun``, berisi antarmuka ``patch-int`` dan antarmuka ``gre- <N> `` untuk setiap peer yang terhubung melalui GRE, satu untuk setiap komputasi dan node jaringan di kluster Anda:

source: The types of flavors in use
de: Die Arten von Varianten, die verwendet werden
id: Jenis flavor yang digunakan

source: The typical hardware recommended for use with OpenStack is the standard value-for-money offerings that most hardware vendors stock. It should be straightforward to divide your procurement into building blocks such as "compute," "object storage," and "cloud controller," and request as many of these as you need. Alternatively, any existing servers you have that meet performance requirements and virtualization technology are likely to support OpenStack.
de: Die typische Hardware, die für die Verwendung mit OpenStack empfohlen wird, ist das Standardangebot, das die meisten Hardwareanbieter führen. Es sollte einfach sein, Ihre Beschaffung in Bausteine wie "Compute", "Object Storage" und "Cloud Controller" aufzuteilen und beliebig viele davon abzurufen. Alternativ können alle vorhandenen Server, die den Leistungsanforderungen und der Virtualisierungstechnologie entsprechen, OpenStack unterstützen.
id: Perangkat keras khas yang direkomendasikan untuk digunakan dengan OpenStack adalah penawaran value-for-money standar yang disediakan oleh sebagian besar vendor perangkat keras. Harus mudah untuk membagi pengadaan Anda ke dalam blok bangunan seperti "compute," "object storage," dan "cloud controller," dan meminta sebanyak mungkin yang Anda butuhkan. Atau, setiap server yang Anda miliki yang memenuhi persyaratan kinerja dan teknologi virtualisasi cenderung mendukung OpenStack.

source: The typical way is to trace the UUID associated with an instance across the service logs.
de: Der typische Weg ist, die einer Instanz zugeordnete UUID über die Serviceprotokolle zu verfolgen.
id: Cara tipikal adalah melacak UUID yang terkait dengan instance di seluruh log layanan.

source: The value ``is_public`` defines the level of visibility for the share: whether other tenants can or cannot see the share. By default, the share is private. Now you can mount the created share like a remote file system and use it for your purposes.
de: Der Wert ``is_public`` definiert die Sichtbarkeit der Freigabe: ob andere Mandanten die Freigabe sehen können oder nicht. Standardmäßig ist die Freigabe privat. Jetzt können Sie die erstellte Freigabe wie ein entferntes Dateisystem einbinden und für Ihre Zwecke verwenden.

source: Then check if the network became created by requesting the networks list once again:
de: Überprüfen Sie dann, ob das Netzwerk erstellt wurde, indem Sie die Netzwerkliste erneut anfordern:

source: Then check if the share mounted successfully and according to the specified access rules:
de: Überprüfen Sie dann, ob die Freigabe erfolgreich und gemäß den angegebenen Zugriffsregeln eingebunden wurde:

source: Then it all made sense…
de: Dann machte alles Sinn...
id: Kemudian semuanya masuk akal ...

source: Then, if needed, update the name and description of the created snapshot:
de: Aktualisieren Sie dann bei Bedarf den Namen und die Beschreibung der erstellten Schattenkopie:

source: Then, if you use SSH to log into your instance and try ``ping openstack.org``, you should see something like:
de: Wenn Sie sich dann mit SSH in Ihre Instanz einloggen und ``ping openstack.org`` versuchen, sollten Sie so etwas wie:
id: Kemudian, jika Anda menggunakan SSH untuk masuk ke instance Anda dan mencoba ``ping openstack.org``, Anda akan melihat sesuatu seperti:

source: There are a large number of syslogs engines available, each have differing capabilities and configuration requirements.
de: Es gibt eine große Anzahl von Syslog-Engines, die jeweils unterschiedliche Fähigkeiten und Konfigurationsanforderungen haben.
id: Ada sejumlah besar mesin syslog yang tersedia, masing-masing memiliki kemampuan dan persyaratan konfigurasi yang berbeda.

source: There are a number of optional items that can be specified. You should read the rest of this section before trying to start an instance, but this is the base command that later details are layered upon.
de: Es gibt eine Reihe von optionalen Elementen, die angegeben werden können. Du solltest den Rest dieses Abschnitts lesen, bevor du versuchst, eine Instanz zu starten, aber das ist der Basisbefehl, auf dem spätere Details geschichtet sind.

source: There are also several :command:`*-manage` command-line tools. These are installed with the project's services on the cloud controller and do not need to be installed separately:
de: Es gibt auch mehrere :command:`*-manage` Kommandozeilenwerkzeuge. Diese werden mit den Diensten des Projekts auf dem Cloud-Controller installiert und müssen nicht separat installiert werden:
id: Ada juga beberapa :command:`*-manage` command-line tools. Ini diinstal dengan layanan proyek pada pengontrol cloud dan tidak perlu diinstal secara terpisah:

source: There are currently two categories of quotas for Object Storage:
de: Es gibt derzeit zwei Kategorien von Quoten für die Objektspeicherung:
id: Saat ini ada dua kategori kuota untuk Object Storage:

source: There are default and specific share types that allow you to filter or choose back-ends before you create a share. Functions and behaviour of share type is similar to Block Storage volume type (see `Share types <https://docs.openstack.org/manila/latest/admin/shared-file-systems-share-types.html>`__ in OpenStack Manila Administrator Guide).
de: Es gibt standardmäßige und spezifische Freigabearten, mit denen Sie Backends filtern oder auswählen können, bevor Sie eine Freigabe erstellen. Die Funktionen und das Verhalten des Share-Typs ähneln dem Blockspeicher Datenträgertyp (siehe `Share types <https://docs.openstack.org/manila/latest/admin/shared-file-systems-share-types.html>`__ im OpenStack Manila Administrator Guide).
id: Ada tipe berbagi default dan spesifik yang memungkinkan Anda untuk memfilter atau memilih back-end sebelum Anda membuat share. Fungsi dan perilaku tipe share mirip dengan tipe volume Block Storage (lihat `Share types <https://docs.openstack.org/manila/latest/admin/shared-file-systems-share-types.html>`__ dalam OpenStack Manila Administrator Guide).

source: There are four major layers in Logstash setup which are:
de: Es gibt vier Hauptebenen im Logstash-Setup, nämlich:
id: Ada empat lapisan utama dalam pengaturan Logstash yaitu:

source: There are other books on the `OpenStack documentation website <https://docs.openstack.org>`_ that can help you get the job done.
de: Es gibt noch weitere Bücher auf der Dokumentations-Website von `OpenStack <https://docs.openstack.org>`_, die Ihnen helfen können, die Arbeit zu erledigen.

source: There are other services worth considering that provide a bare metal instance instead of a cloud. In other cases, it is possible to replicate a second private cloud by integrating with a private Cloud-as-a-Service deployment. The organization does not buy the hardware, but also does not share with other tenants. It is also possible to use a provider that hosts a bare-metal public cloud instance for which the hardware is dedicated only to one customer, or a provider that offers private Cloud-as-a-Service.
de: Es gibt andere Dienste, die es wert sind, in Betracht gezogen zu werden, die eine Bare-Metal-Instanz anstelle einer Cloud bereitstellen. In anderen Fällen ist es möglich, eine zweite private Cloud zu replizieren, indem man sie in eine private Cloud-as-a-Service Bereitstellung integriert. Das Unternehmen kauft die Hardware nicht, teilt sich aber auch nicht mit anderen Mietern. Es ist auch möglich, einen Provider zu verwenden, der eine Bare-Metal-Public-Cloud-Instanz hostet, deren Hardware nur für einen Kunden bestimmt ist, oder einen Provider, der private Cloud-as-a-Service anbietet.
id: Ada layanan lain yang layak dipertimbangkan yang menyediakan contoh bare metal bukan cloud. Dalam kasus lain, dimungkinkan untuk mereplikasi cloud pribadi kedua dengan mengintegrasikannya dengan penyebaran Cloud-as-a-Service pribadi. Organisasi tidak membeli perangkat keras, tetapi juga tidak berbagi dengan penyewa lain. Dimungkinkan juga untuk menggunakan penyedia yang meng-host instance cloud publik bare-metal yang perangkatnya didedikasikan hanya untuk satu pelanggan, atau penyedia yang menawarkan Cloud-as-a-Service pribadi.

source: There are several good sources of information available that you can use to track your OpenStack development desires.
de: Es gibt mehrere gute Informationsquellen, die Sie verwenden können, um Ihre OpenStack-Entwicklungswünsche zu verfolgen.
id: Ada beberapa sumber informasi yang tersedia yang dapat Anda gunakan untuk melacak keinginan pengembangan OpenStack Anda.

source: There are several other useful operations you would perform when working with shares.
de: Es gibt noch einige andere nützliche Operationen, die Sie bei der Arbeit mit Freigaben durchführen würden.

source: There are three clouds currently running at CERN, totaling about 4,700 compute nodes, with approximately 120,000 cores. The CERN IT cloud aims to expand to 300,000 cores by 2015.
de: Am CERN laufen derzeit drei Clouds mit insgesamt etwa 4.700 Compute-Knoten und etwa 120.000 Kernen. Die CERN IT-Cloud soll bis 2015 auf 300.000 Kerne ausgebaut werden.
id: Ada tiga awan yang saat ini berjalan di CERN, dengan total sekitar 4.700 node komputasi, dengan sekitar 120.000 core. The CERN IT cloud bertujuan untuk memperluas ke 300.000 core pada tahun 2015.

source: There are two main types of instance-specific data: metadata and user data.
de: Es gibt zwei Haupttypen von instanzenspezifischen Daten: Metadaten und Benutzerdaten.

source: There are two types of monitoring: watching for problems and watching usage trends. The former ensures that all services are up and running, creating a functional cloud. The latter involves monitoring resource usage over time in order to make informed decisions about potential bottlenecks and upgrades.
de: Es gibt zwei Arten der Überwachung: die Überwachung auf Probleme und die Überwachung von Nutzungstrends. Erstere stellt sicher, dass alle Dienste einsatzbereit sind und bildet eine funktionale Cloud. Letzteres beinhaltet die Überwachung des Ressourcenverbrauchs im Laufe der Zeit, um fundierte Entscheidungen über mögliche Engpässe und Upgrades zu treffen.
id: Ada dua jenis pemantauan: mengawasi masalah dan mengamati tren penggunaan. Yang pertama memastikan bahwa semua layanan aktif dan berjalan, menciptakan cloud fungsional. Yang terakhir melibatkan pemantauan penggunaan sumber daya dari waktu ke waktu untuk membuat keputusan berdasarkan informasi tentang potensi kemacetan dan peningkatan.

source: There are two ways to ensure stability with this directory. The first is to make sure this directory is run on a RAID array. If a disk fails, the directory is available. The second way is to use a tool such as rsync to replicate the images to another server:
de: Es gibt zwei Möglichkeiten, die Stabilität mit diesem Verzeichnis zu gewährleisten. Das erste ist, sicherzustellen, dass dieses Verzeichnis auf einem RAID-Array ausgeführt wird. Wenn eine Festplatte ausfällt, ist das Verzeichnis verfügbar. Der zweite Weg ist die Verwendung eines Tools wie rsync, um die Abbilder auf einen anderen Server zu replizieren:
id: Ada dua cara untuk memastikan stabilitas dengan direktori ini. Yang pertama adalah memastikan direktori ini dijalankan pada array RAID. Jika disk gagal, direktori tersedia. Cara kedua adalah menggunakan alat seperti rsync untuk mereplikasi image ke server lain:
