Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: "Hey Alvaro, can you run a VLAN on top of a VLAN?"
de: "Hey Alvaro, kannst du ein VLAN auf einem VLAN betreiben?"

source: "If you did, you'd add an extra 4 bytes to the packet…"
de: "Wenn du das tätest, würdest du zusätzliche 4 Bytes zum Paket hinzufügen...."

source: "The Issue"
de: " Das Problem"

source: **Compute nodes**
de: **Compute-Knoten**

source: **Compute service (nova)**
de: **Compute Dienst (nova)**

source: **Create a port that can be reused**
de: **Einen Port erstellen, der wiederverwendet werden kann**

source: **Description**
de: **Beschreibung**

source: **Detach a port from an instance**
de: **Einen Port von einer Instanz trennen**

source: **Ensuring Snapshots of Linux Guests Are Consistent**
de: **Sicherstellen, dass Schattenkopien von Linux-Gästen konsistent sind**

source: **Ensuring Snapshots of Windows Guests Are Consistent**
de: **Sicherstellen, dass Schattenkopien von Windows-Gästen konsistent sind**

source: **Example of Complexity**
de: **Beispiel für Komplexität**

source: **Example**
de: **Beispiel**

source: **Identity service (keystone)**
de: **Identitätsdienst (keystone)**

source: **Networking service (neutron)**
de: Netzwerkdienst (Neutron)**Netzwerkdienst (Neutron)**

source: **Provision an instance**
de: **Eine Instanz bereitstellen**

source: **Retrieve an IP address when an instance is deleted before detaching a port**
de: **Abrufen einer IP-Adresse, wenn eine Instanz gelöscht wird, bevor ein Port abgetrennt wird**

source: **Setting with openstack command**
de: **Einstellung mit Openstack-Befehl**

source: **Shared services**
de: **Gemeinsame Dienste****

source: **Storage nodes**
de: **Speicherknoten**

source: **To capture packets from the patch-tun internal interface on integration bridge, br-int:**
de: **Um Pakete von der internen Patch-Tun-Schnittstelle auf der Integrationsbrücke zu erfassen, br-int:**

source: **To create the middleware and plug it in through Paste configuration:**
de: **Um die Middleware zu erstellen und über die Konfiguration Einfügen einzubinden:**

source: **To create the scheduler and plug it in through configuration**
de: **Erstellen Sie den Scheduler und schließen Sie ihn über die Konfiguration an**

source: **To discover which internal VLAN tag is in use for a GRE tunnel by using the ovs-ofctl command**
de: **Um herauszufinden, welches interne VLAN-Tag für einen GRE-Tunnel verwendet wird, verwenden Sie den Befehl ovs-ofctl**

source: **To discover which internal VLAN tag is in use for a given external VLAN by using the ovs-ofctl command**
de: **Um herauszufinden, welches interne VLAN-Tag für ein bestimmtes externes VLAN verwendet wird, verwenden Sie den Befehl ovs-ofctl**

source: **To perform a rollback**
de: **Um einen Rollback durchzuführen**

source: **To update Block Storage quotas for a tenant (project)**
de: **Aktualisierung der Blocklagerquoten für einen Mandanten (Projekt)**

source: **To update quota values for a tenant (project)**
de: **Aktualisierung der Quotenwerte für einen Mandanten (Projekt)**

source: **To view Block Storage quotas for a tenant (project)**
de: **Um Blocklagerquoten für einen Mandanten anzuzeigen (Projekt)**

source: **To view and update default Block Storage quota values**
de: Zum Anzeigen und Aktualisieren der standardmäßigen Blockspeicherquotenwerte**

source: **To view and update default quota values**
de: **Um die Standard-Quotenwerte anzuzeigen und zu aktualisieren**

source: **To view quota values for a tenant (project)**
de: **Um die Quotenwerte für einen Mandanten (Projekt) anzuzeigen **

source: **Use**
de: **Verwendung**

source: *Actions which delete things should not be enabled by default.*
de: *Aktionen, die Dinge löschen, sollten standardmäßig nicht aktiviert werden.*

source: 200 physical cores.
de: 200 physikalische Kerne.

source: :command:`openstack compute service list`
de: :command:`openstack compute service list` öffnen

source: :doc:`app-resources`
de: :doc:`app-ressourcen`

source: :ref:`table_segregation_methods` provides a comparison view of each segregation method currently provided by OpenStack Compute.
de: :ref:`table_segregation_methods` bietet eine Vergleichsansicht jeder Trennmethode, die derzeit von OpenStack Compute bereitgestellt wird.
id: :ref:`table_segregation_methods` memberikan tampilan perbandingan setiap metode pemisahan yang saat ini disediakan oleh OpenStack Compute.

source: :term:`Availability zones <availability zone>` and host aggregates, which merely divide a single Compute deployment.
de: :term:`Availability zones <availability zone>` und Host-Aggregate, die lediglich eine einzelne Compute Deployment teilen.
id: :term:`Availability zones <availability zone>` dan host agregat, yang hanya membagi satu penyebaran Compute.

source: <uuid of instance that was snapshotted>
de: <uuuid der Instanz, die als Schattenkopie aufgenommen wurde>

source: <uuid of original image of instance that was snapshotted>
de: <uuuid des Originalabbildes der Instanz, die als Schattenkopie aufgenommen wurde>>

source: A DHCP problem might be caused by a misbehaving dnsmasq process. First, debug by checking logs and then restart the dnsmasq processes only for that project (tenant). In VLAN mode, there is a dnsmasq process for each tenant. Once you have restarted targeted dnsmasq processes, the simplest way to rule out dnsmasq causes is to kill all of the dnsmasq processes on the machine and restart ``nova-network``. As a last resort, do this as root:
de: Ein DHCP-Problem kann durch einen fehlerhaften dnsmasq-Prozess verursacht werden. Zuerst debuggen, indem Sie Protokolle überprüfen und dann die dnsmasq-Prozesse nur für dieses Projekt (Mandant) neu starten. Im VLAN-Modus gibt es für jeden Mandanten einen dnsmasq-Prozess. Sobald Sie gezielte dnsmasq-Prozesse neu gestartet haben, ist der einfachste Weg, die Ursachen von dnsmasq auszuschließen, alle dnsmasq-Prozesse auf der Maschine zu beenden und das ``nova-network`` neu zu starten. Als letztes Mittel solltest du dies als root tun:
id: Masalah DHCP mungkin disebabkan oleh proses dnsmasq yang salah. Pertama, debug dengan memeriksa log dan kemudian restart proses dnsmasq hanya untuk proyek itu (tenant). Dalam mode VLAN, ada proses dnsmasq untuk setiap tenant. Setelah Anda me-restart proses dnsmasq yang ditargetkan, cara paling sederhana untuk mengesampingkan penyebab dnsmasq adalah dengan mematikan semua proses dnsmasq pada mesin dan me-restart ``nova-network``. Sebagai upaya terakhir, lakukan ini sebagai root:

source: A NetApp appliance is used in each region for both block storage and instance storage. There are future plans to move the instances off the NetApp appliance and onto a distributed file system such as :term:`Ceph` or GlusterFS.
de: In jeder Region wird eine NetApp Appliance sowohl für Block Storage als auch für Instanz Storage verwendet. Es ist geplant, die Instanzen von der NetApp Appliance auf ein verteiltes Dateisystem wie :term:`Ceph` oder GlusterFS zu verschieben.
id: Alat NetApp digunakan di setiap wilayah untuk penyimpanan blok dan penyimpanan instance. Ada rencana di masa depan untuk memindahkan instance dari alat NetApp dan ke sistem file terdistribusi seperti :term: `Ceph` atau GlusterFS.

source: A basic type of alert monitoring is to simply check and see whether a required process is running. For example, ensure that the ``nova-api`` service is running on the cloud controller:
de: Eine grundlegende Art der Alarmüberwachung besteht darin, einfach zu überprüfen, ob ein erforderlicher Prozess läuft. Stellen Sie beispielsweise sicher, dass der Dienst ``nova-api`` auf dem Cloud-Controller läuft:
id: Jenis dasar pemantauan peringatan adalah dengan hanya memeriksa dan melihat apakah proses yang diperlukan sedang berjalan. Sebagai contoh, pastikan bahwa layanan ``nova-api`` berjalan pada pengontrol cloud:

source: A boolean to indicate whether the volume should be deleted when the instance is terminated. True can be specified as ``True`` or ``1``. False can be specified as ``False`` or ``0``.
de: Ein Boolean, um anzugeben, ob der Datenträger beim Beenden der Instanz gelöscht werden soll. True kann als ``True`` oder ``1`` angegeben werden. False kann als ``False`` oder ``0`` angegeben werden.

source: A brief overview of how to send REST API requests to endpoints for OpenStack services
de: Ein kurzer Überblick darüber, wie man REST-API-Anfragen an Endpunkte für OpenStack-Dienste sendet

source: A cloud controller node runs several different services. You can install services that communicate only using the message queue internally— ``nova-scheduler`` and ``nova-console`` on a new server for expansion. However, other integral parts require more care.
de: Ein Cloud-Controller-Knoten führt mehrere verschiedene Dienste aus. Sie können Dienste installieren, die nur über die Nachrichtenwarteschlange intern kommunizieren - ``nova-scheduler`` und ``nova-console`` auf einem neuen Server zur Erweiterung. Andere integrale Teile erfordern jedoch mehr Sorgfalt.
id: Node pengontrol cloud menjalankan beberapa layanan berbeda. Anda dapat menginstal layanan yang berkomunikasi hanya menggunakan antrian pesan secara internal— ``nova-scheduler`` dan `` nova-console`` pada server baru untuk ekspansi. Namun, bagian integral lainnya membutuhkan perawatan lebih.

source: A cloud environment that is scaled to a certain size will require the file descriptor limits to be adjusted.
de: Eine Cloud-Umgebung, die auf eine bestimmte Größe skaliert ist, erfordert eine Anpassung der Grenzen des Dateideskriptors.
id: Lingkungan cloud yang diskalakan ke ukuran tertentu akan membutuhkan batas deskriptor file untuk disesuaikan.

source: A cloud with multiple sites where you can schedule VMs "anywhere" or on a particular site.
de: Eine Cloud mit mehreren Standorten, in der Sie VMs "überall" oder auf einer bestimmten Website planen können.
id: Cloud dengan banyak situs tempat Anda dapat menjadwalkan VM "anywhere" atau di situs tertentu.

source: A cloud with multiple sites, where you schedule VMs to a particular site and you want a shared infrastructure.
de: Eine Cloud mit mehreren Standorten, in der Sie VMs für einen bestimmten Standort planen und eine gemeinsame Infrastruktur benötigen.
id: Cloud dengan banyak situs, tempat Anda menjadwalkan VM ke situs tertentu dan Anda menginginkan infrastruktur bersama.

source: A collection of foreign keys are available to find relations to the instance. The most useful of these — ``user_id`` and ``project_id`` are the UUIDs of the user who launched the instance and the project it was launched in.
de: Es steht eine Sammlung von Fremdschlüsseln zur Verfügung, um Beziehungen zur Instanz zu finden. Die nützlichsten von diesen - ``user_id`` und ``project_id`` sind die UUIDs des Benutzers, der die Instanz gestartet hat und des Projekts, in dem sie gestartet wurde.

source: A common new-user issue with OpenStack is failing to set an appropriate security group when launching an instance. As a result, the user is unable to contact the instance on the network.
de: Ein häufiges Problem mit OpenStack für neue Benutzer kann beim Starten einer Instanz keine geeignete Sicherheitsgruppe festlegen. Infolgedessen kann der Benutzer die Instanz im Netzwerk nicht kontaktieren.
id: Masalah umum pengguna baru dengan OpenStack gagal untuk mengatur grup keamanan yang tepat ketika meluncurkan sebuah instance. Akibatnya, pengguna tidak dapat menghubungi instance di jaringan.

source: A common scenario is to take down production management services in preparation for an upgrade, completed part of the upgrade process, and discovered one or more problems not encountered during testing. As a consequence, you must roll back your environment to the original "known good" state. You also made sure that you did not make any state changes after attempting the upgrade process; no new instances, networks, storage volumes, and so on. Any of these new resources will be in a frozen state after the databases are restored from backup.
de: Ein häufiges Szenario ist es, die Produktionsverwaltungsdienste zur Vorbereitung auf ein Upgrade abzuschalten, einen Teil des Upgrade-Prozesses abzuschließen und ein oder mehrere Probleme zu entdecken, die während des Tests nicht aufgetreten sind. Infolgedessen müssen Sie Ihre Umgebung in den ursprünglichen "bekannt guten" Zustand zurücksetzen. Sie haben auch sichergestellt, dass Sie nach dem Versuch des Upgrade-Prozesses keine Zustandsänderungen vorgenommen haben; keine neuen Instanzen, Netzwerke, Speicherdatenträger usw. Jede dieser neuen Ressourcen befindet sich in einem eingefrorenen Zustand, nachdem die Datenbanken aus dem Backup wiederhergestellt wurden.
id: Skenario umum adalah menghapus layanan manajemen produksi dalam persiapan untuk upgrade, menyelesaikan bagian dari proses upgrade, dan menemukan satu atau lebih masalah yang tidak ditemukan selama pengujian. Sebagai akibatnya, Anda harus memutar kembali (roll back) lingkungan Anda ke keadaan "known good" yang asli. Anda juga memastikan bahwa Anda tidak membuat perubahan keadaan setelah mencoba proses upgrade; tidak ada instance baru, jaringan, volume penyimpanan, dan sebagainya. Sumber daya baru ini akan dalam keadaan beku setelah database dipulihkan dari cadangan.

source: A common use of host aggregates is to provide information for use with the ``nova-scheduler``. For example, you might use a host aggregate to group a set of hosts that share specific flavors or images.
de: Eine gängige Verwendung von Host-Aggregaten ist die Bereitstellung von Informationen für die Verwendung mit dem ``nova-scheduler``. Sie können beispielsweise ein Host-Aggregat verwenden, um eine Reihe von Hosts zu gruppieren, die bestimmte Varianten oder Bilder gemeinsam nutzen.
id: Penggunaan agregat host yang umum adalah untuk memberikan informasi untuk digunakan dengan ``nova-scheduler``. Misalnya, Anda dapat menggunakan agregat host untuk mengelompokkan serangkaian host yang berbagi flavor atau image tertentu.

source: A common way of dealing with the recovery from a full system failure, such as a power outage of a data center, is to assign each service a priority, and restore in order. :ref:`table_example_priority` shows an example.
de: Eine gängige Methode, um die Wiederherstellung nach einem vollständigen Systemausfall, wie beispielsweise einem Stromausfall eines Rechenzentrums, zu bewältigen, besteht darin, jedem Dienst eine Priorität zuzuweisen und ihn in der Reihenfolge wiederherzustellen. :ref:`table_example_priority` zeigt ein Beispiel.
id: Cara umum menangani pemulihan dari kegagalan sistem penuh, seperti pemadaman listrik pusat data, adalah menetapkan setiap layanan sebagai prioritas, dan memulihkannya secara berurutan. :ref: `table_example_priority` menampilkan contoh.

source: A compute node
de: Compute Knoten
id: Node komputasi

source: A descriptive name, such as xx.size\_name, is conventional but not required, though some third-party tools may rely on it.
de: Ein beschreibender Name, wie z.B. xx.size\_name, ist konventionell, aber nicht erforderlich, obwohl einige Tools von Drittanbietern darauf angewiesen sein können.
id: Nama deskriptif, seperti xx.size\_name, adalah konvensional tetapi tidak diperlukan, meskipun beberapa alat pihak ketiga mungkin bergantung padanya.

source: A device name where the volume is attached in the system at ``/dev/dev_name``
de: Ein Gerätename, bei dem der Datenträger im System unter ``/dev/dev/dev_name`` angehängt ist

source: A different API endpoint for every region. Each region has a full nova installation.
de: Ein unterschiedlicher API-Endpunkt für jede Region. Jede Region verfügt über eine vollständige nova-Installation.
id: Endpoint API yang berbeda untuk setiap wilayah. Setiap wilayah memiliki instalasi nova lengkap.

source: A feature was introduced in Essex to periodically check and see if there were any ``_base`` files not in use. If there were, OpenStack Compute would delete them. This idea sounds innocent enough and has some good qualities to it. But how did this feature end up turned on? It was disabled by default in Essex. As it should be. It was `decided to be turned on in Folsom <https://bugs.launchpad.net/nova/+bug/1029674>`_. I cannot emphasize enough that:
de: In Essex wurde eine Funktion eingeführt, um regelmäßig zu überprüfen, ob es ``_base`` Dateien gibt, die nicht verwendet werden. Wenn ja, würde OpenStack Compute sie löschen. Diese Idee klingt unschuldig genug und hat einige gute Eigenschaften. Aber wie kam es dazu, dass dieses Feature aktiviert wurde? Es wurde in Essex standardmäßig deaktiviert. So wie es sein sollte. Es wurde `beschlossen, in Folsom eingeschaltet zu werden <https://bugs.launchpad.net/nova/+bug/1029674>`_. Ich kann das nicht genug betonen:
id: Fitur diperkenalkan di Essex untuk secara berkala memeriksa dan melihat apakah ada ``_base`` file yang tidak digunakan. Jika ada, OpenStack Compute akan menghapusnya. Gagasan ini kedengarannya cukup polos dan memiliki kualitas yang bagus. Tetapi bagaimana fitur ini akhirnya dihidupkan? Itu dinonaktifkan secara default di Essex. Seperti seharusnya. Dulu `decided to be turned on in Folsom <https://bugs.launchpad.net/nova/+bug/1029674>`_. Saya tidak bisa cukup menekankan bahwa:

source: A few nights later, it happened again.
de: Ein paar Nächte später geschah es wieder.
id: Beberapa malam kemudian, itu terjadi lagi.

source: A final example is if a user is hammering cloud resources repeatedly. Contact the user and learn what he is trying to do. Maybe he doesn't understand that what he's doing is inappropriate, or maybe there is an issue with the resource he is trying to access that is causing his requests to queue or lag.
de: Ein letztes Beispiel ist, wenn ein Benutzer wiederholt auf Cloud-Ressourcen hämmert. Kontaktieren Sie den Benutzer und erfahren Sie, was er versucht zu tun. Vielleicht versteht er nicht, dass das, was er tut, unangebracht ist, oder es gibt ein Problem mit der Ressource, auf die er zuzugreifen versucht, das seine Anfragen in die Warteschlange stellt oder verzögert.

source: A full set of options can be found using:
de: Ein kompletter Satz von Optionen kann über:
id: Set lengkap opsi dapat ditemukan menggunakan:

source: A list of terms used in this book is included, which is a subset of the larger OpenStack glossary available online.
de: Eine Liste der in diesem Buch verwendeten Begriffe ist enthalten, die eine Teilmenge des größeren OpenStack-Glossars ist, das online verfügbar ist.

source: A long requested service, to provide the ability to manipulate DNS entries associated with OpenStack resources has gathered a following. The designate project was also released.
de: Ein seit langem angeforderter Dienst, der die Möglichkeit bietet, DNS-Einträge zu manipulieren, die mit OpenStack-Ressourcen verknüpft sind, hat folgendes gesammelt. Das Designate-Projekt wurde ebenfalls freigegeben.
id: Layanan yang lama diminta, untuk menyediakan kemampuan untuk memanipulasi entri DNS yang terkait dengan sumber daya OpenStack telah mengumpulkan hal berikut. Proyek yang ditunjuk juga dirilis.

source: A major quality push has occurred across drivers and plug-ins in Block Storage, Compute, and Networking. Particularly, developers of Compute and Networking drivers that require proprietary or hardware products are now required to provide an automated external testing system for use during the development process.
de: Ein wichtiger Qualitätsschub hat sich bei Treibern und Plugins in den Bereichen Block Storage, Compute und Networking ergeben. Insbesondere Entwickler von Compute- und Netzwerktreibern, die proprietäre oder Hardwareprodukte benötigen, müssen nun ein automatisiertes externes Testsystem für den Einsatz im Entwicklungsprozess bereitstellen.
id: Peningkatan kualitas utama telah terjadi di seluruh driver dan plug-in di Block Storage, Compute, dan Networking. Khususnya, pengembang driver Compute dan Networking yang memerlukan produk-produk perangkat keras atau kepemilikan sekarang diminta untuk menyediakan sistem pengujian eksternal otomatis untuk digunakan selama proses pengembangan.

source: A much-requested answer to big data problems, a dedicated team has been making solid progress on a Hadoop-as-a-Service project.
de: Als begehrte Antwort auf große Datenprobleme hat ein engagiertes Team bei einem Hadoop-as-a-Service Projekt gute Fortschritte gemacht.
id: Jawaban yang banyak diminta untuk masalah big data, tim berdedikasi telah membuat kemajuan yang solid pada proyek Hadoop-as-a-Service.

source: A note about DAIR's architecture: ``/var/lib/nova/instances`` is a shared NFS mount. This means that all compute nodes have access to it, which includes the ``_base`` directory. Another centralized area is ``/var/log/rsyslog`` on the cloud controller. This directory collects all OpenStack logs from all compute nodes. I wondered if there were any entries for the file that :command:`virsh` is reporting:
de: Ein Hinweis zur Architektur von DAIR: ``/var/lib/nova/instances`` ist ein gemeinsames NFS-Mount. Das bedeutet, dass alle Compute-Knoten Zugriff darauf haben, was das Verzeichnis ``_base`` beinhaltet. Ein weiterer zentraler Bereich ist ``/var/log/log/rsyslog`` auf dem Cloud-Controller. Dieses Verzeichnis sammelt alle OpenStack-Protokolle von allen Compute-Knoten. Ich fragte mich, ob es irgendwelche Einträge für die Datei gibt, die :command:`virsh` berichtet:
id: Catatan tentang arsitektur DAIR: ``/var/lib/nova/instances`` adalah mount NFS bersama. Ini berarti bahwa semua node komputasi memiliki akses ke sana, yang mencakup direktori ``_base``. Area terpusat lainnya adalah ``/var/log/rsyslog`` pada pengontrol cloud. Direktori ini mengumpulkan semua log OpenStack dari semua node komputasi. Saya bertanya-tanya apakah ada entri untuk file yang :command:`virsh` melaporkan:

source: A number of operating systems use rsyslog as the default logging service. Since it is natively able to send logs to a remote location, you do not have to install anything extra to enable this feature, just modify the configuration file. In doing this, consider running your logging over a management network or using an encrypted VPN to avoid interception.
de: Eine Reihe von Betriebssystemen verwenden rsyslog als Standard-Protokollierungsdienst. Da es nativ in der Lage ist, Protokolle an einen entfernten Ort zu senden, müssen Sie nichts extra installieren, um diese Funktion zu aktivieren, ändern Sie einfach die Konfigurationsdatei. Erwägen Sie dabei, Ihre Protokollierung über ein Managementnetzwerk oder über ein verschlüsseltes VPN durchzuführen, um ein Abfangen zu vermeiden.
id: Sejumlah sistem operasi menggunakan rsyslog sebagai layanan logging standar. Karena secara asli dapat mengirim log ke lokasi yang jauh, Anda tidak perlu menginstal apa pun tambahan untuk mengaktifkan fitur ini, cukup modifikasi file konfigurasi. Dalam melakukan ini, pertimbangkan untuk menjalankan pendataan Anda melalui jaringan manajemen atau menggunakan VPN terenkripsi untuk menghindari intersepsi.

source: A number of time-related fields are useful for tracking when state changes happened on an instance:
de: Eine Reihe von zeitbezogenen Feldern sind nützlich, um zu verfolgen, wann Zustandsänderungen an einer Instanz stattgefunden haben:

source: A quick Google search turned up this: `DHCP lease errors in VLAN mode <https://lists.launchpad.net/openstack/msg11696.html>`_ which further supported our DHCP theory.
de: Eine schnelle Google-Suche ergab dies: `DHCP-Leasingfehler im VLAN-Modus <https://lists.launchpad.net/openstack/msg11696.html>`_, die unsere DHCP-Theorie weiter unterstützten.
id: Pencarian Google cepat muncul ini: `DHCP lease errors in VLAN mode <https://lists.launchpad.net/openstack/msg11696.html>`_ yang selanjutnya mendukung teori DHCP kami.
