Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: Typical use is to only create administrative users in a single project, by convention the admin project, which is created by default during cloud setup. If your administrative users also use the cloud to launch and manage instances, it is strongly recommended that you use separate user accounts for administrative access and normal operations and that they be in distinct projects.
de: Typischerweise werden nur administrative Benutzer in einem einzigen Projekt erstellt, wobei das Admin-Projekt, das standardmäßig beim Cloud-Setup erstellt wird, als Konvention verwendet wird. Wenn Ihre administrativen Benutzer auch die Cloud zum Starten und Verwalten von Instanzen verwenden, wird dringend empfohlen, separate Benutzerkonten für den administrativen Zugriff und den normalen Betrieb zu verwenden und sich in verschiedenen Projekten zu befinden.

source: Typically reduce the threat level by informing potential attackers that there will be adverse consequences for them if they proceed.
de: Reduzieren Sie in der Regel das Bedrohungsniveau, indem Sie potenzielle Angreifer darüber informieren, dass es für sie nachteilige Folgen haben wird, wenn sie fortfahren.
id: Biasanya mengurangi tingkat ancaman dengan memberi tahu penyerang potensial bahwa akan ada konsekuensi yang merugikan bagi mereka jika mereka melanjutkan.

source: Typically, default values are changed because a tenant requires more than the OpenStack default of 10 volumes per tenant, or more than the OpenStack default of 1 TB of disk space on a compute node.
de: Normalerweise werden die Standardwerte geändert, da ein Mandnat mehr als die OpenStack-Standardeinstellung von 10 Datenträger pro Mandant oder mehr als die OpenStack-Standardeinstellung von 1 TB Festplattenspeicher auf einem Compute-Knoten benötigt.
id: Biasanya, nilai standar diubah karena penyewa membutuhkan lebih dari standar OpenStack 10 volume per penyewa, atau lebih dari standar OpenStack 1 TB ruang disk pada node komputasi.

source: Ubuntu 12.04 installs RabbitMQ version 2.7.1, which uses port 55672. RabbitMQ versions 3.0 and above use port 15672 instead. You can check which version of RabbitMQ you have running on your local Ubuntu machine by doing:
de: Ubuntu 12.04 installiert RabbitMQ Version 2.7.1, die Port 55672 verwendet. RabbitMQ Versionen 3.0 und höher verwenden stattdessen Port 15672. Sie können überprüfen, welche Version von RabbitMQ Sie auf Ihrem lokalen Ubuntu-Rechner ausgeführt haben, indem Sie dies tun:
id: Ubuntu 12.04 menginstal RabbitMQ versi 2.7.1, yang menggunakan port 55672. Sebaliknya, RabbitMQ versi 3.0 dan di atasnya menggunakan port 15672. Anda dapat memeriksa versi RabbitMQ mana yang telah Anda jalankan di mesin Ubuntu lokal Anda dengan melakukan:

source: Under Identity tab, click :guilabel:`Projects`.
de: Klicken Sie auf der Registerkarte Identität auf :guilabel:`Projekte`.
id: Di bawah tab Identity, klik :guilabel:`Projects`.

source: Underlying the use of the command-line tools is the OpenStack API, which is a RESTful API that runs over HTTP. There may be cases where you want to interact with the API directly or need to use it because of a suspected bug in one of the CLI tools. The best way to do this is to use a combination of `cURL <https://curl.haxx.se/>`_ and another tool, such as `jq <http://stedolan.github.io/jq/>`_, to parse the JSON from the responses.
de: Der Verwendung der Befehlszeilen-Tools liegt die OpenStack-API zugrunde, eine RESTful-API, die über HTTP läuft. Es kann Fälle geben, in denen Sie direkt mit der API interagieren möchten oder sie aufgrund eines vermuteten Fehlers in einem der CLI-Tools verwenden müssen. Der beste Weg, dies zu tun, ist, eine Kombination aus `cURL <https://curl.haxx.se/>`_ und einem anderen Tool, wie `jq <http://stedolan.github.io/jq/>`_, zu verwenden, um das JSON aus den Antworten zu analysieren.
id: Yang mendasari penggunaan alat command-line adalah OpenStack API, yang merupakan RESTful API yang berjalan di atas HTTP. Mungkin ada kasus di mana Anda ingin berinteraksi dengan API secara langsung atau perlu menggunakannya karena bug yang dicurigai di salah satu alat CLI. Cara terbaik untuk melakukan ini adalah dengan menggunakan kombinasi `cURL <https://curl.haxx.se/>`_ dan alat lain, seperti `jq <http://stedolan.github.io/jq/>`_, untuk mengurai JSON dari tanggapan.

source: Unfortunately, sometimes the error is not apparent from the log files. In this case, switch tactics and use a different command; maybe run the service directly on the command line. For example, if the ``glance-api`` service refuses to start and stay running, try launching the daemon from the command line:
de: Leider ist der Fehler manchmal nicht aus den Protokolldateien ersichtlich. In diesem Fall wechseln Sie die Taktik und verwenden Sie einen anderen Befehl; vielleicht führen Sie den Dienst direkt auf der Befehlszeile aus. Wenn sich beispielsweise der Dienst ``glance-api`` weigert, zu starten und am Laufen zu bleiben, versuchen Sie, den Daemon über die Befehlszeile zu starten:
id: Sayangnya, terkadang kesalahan tidak terlihat dari file log. Dalam hal ini, alihkan taktik dan gunakan perintah yang berbeda; mungkin menjalankan layanan langsung pada command line. Misalnya, jika layanan ``glance-api`` menolak untuk memulai dan tetap berjalan, coba luncurkan daemon dari command line:

source: Unfortunately, this command does not tell you various details about the running instances, such as what compute node the instance is running on, what flavor the instance is, and so on. You can use the following command to view details about individual instances:
de: Leider sagt Ihnen dieser Befehl keine verschiedenen Details über die laufenden Instanzen, wie z.B. auf welchem Compute-Knoten die Instanz läuft, welche Variante die Instanz hat und so weiter. Mit dem folgenden Befehl können Sie Details zu einzelnen Instanzen anzeigen:
id: Sayangnya, perintah ini tidak memberi tahu Anda berbagai perincian tentang instance yang sedang berjalan, seperti apa yang komputasi node instance yang sedang berjalan, apa flavor instance itu, dan sebagainya. Anda dapat menggunakan perintah berikut untuk melihat detail tentang setiap kejadian:

source: Unfortunately, this story has an open ending... we're still looking into why the CentOS image was sending out spanning tree packets. Further, we're researching a proper way on how to mitigate this from happening. It's a bigger issue than one might think. While it's extremely important for switches to prevent spanning tree loops, it's very problematic to have an entire compute node be cut from the network when this happens. If a compute node is hosting 100 instances and one of them sends a spanning tree packet, that instance has effectively DDOS'd the other 99 instances.
de: Leider hat diese Geschichte ein offenes Ende.... wir untersuchen immer noch, warum das CentOS-Abbild Spanning-Tree-Pakete verschickt hat. Darüber hinaus erforschen wir einen geeigneten Weg, wie wir das verhindern können. Es ist ein größeres Problem, als man meinen könnte. Während es für Switches äußerst wichtig ist, Spanning-Tree-Schleifen zu verhindern, ist es sehr problematisch, einen ganzen Compute-Knoten aus dem Netzwerk zu entfernen, wenn dies geschieht. Wenn ein Compute-Knoten 100 Instanzen hostet und eine von ihnen ein Spanning-Tree Paket sendet, hat diese Instanz die anderen 99 Instanzen effektiv DDOS'd .
id: Sayangnya, cerita ini memiliki akhiran yang terbuka ... kita masih mencari tahu mengapa image CentOS mengirim paket spanning tree. Lebih lanjut, kami sedang meneliti cara yang tepat tentang bagaimana mengurangi hal ini terjadi. Ini masalah yang lebih besar dari yang mungkin dipikirkan. Meskipun sangat penting bagi switch untuk mencegah spanning tree loop, sangat problematis untuk membuat seluruh node komputasi dipotong dari jaringan saat ini terjadi. Jika sebuah node komputasi menampung 100 instance dan salah satunya mengirimkan paket spanning tree, instance tersebut secara efektif telah melakukan DDOS terhadap 99 instance lainnya.

source: Uninstalling
de: Deinstallation
id: Uninstalling (menghapus instalasi)

source: Unique ID (integer or UUID) for the flavor.
de: Eindeutige ID (Integer oder UUID) für die Variante.
id: ID unik (integer atau UUID) untuk flavor.

source: Unlike having a single API endpoint, regions have a separate API endpoint per installation, allowing for a more discrete separation. Users wanting to run instances across sites have to explicitly select a region. However, the additional complexity of a running a new service is not required.
de: Im Gegensatz zu einem einzelnen API-Endpunkt haben Regionen einen separaten API-Endpunkt pro Installation, was eine diskretere Trennung ermöglicht. Benutzer, die Instanzen über Standorte hinweg ausführen möchten, müssen explizit eine Region auswählen. Die zusätzliche Komplexität der Ausführung eines neuen Dienstes ist jedoch nicht erforderlich.
id: Tidak seperti memiliki satu endpoint API, kawasan memiliki endpoint API terpisah per pemasangan, memungkinkan pemisahan yang lebih terpisah. Pengguna yang ingin menjalankan instance di situs harus secara eksplisit memilih suatu wilayah. Namun, kompleksitas tambahan menjalankan layanan baru tidak diperlukan.

source: Unlike the CLI tools mentioned above, the :command:`*-manage` tools must be run from the cloud controller, as root, because they need read access to the config files such as ``/etc/nova/nova.conf`` and to make queries directly against the database rather than against the OpenStack :term:`API endpoints <API endpoint>`.
de: Im Gegensatz zu den oben genannten CLI-Tools müssen die Tools :command:`*-manage` vom Cloud-Controller als root ausgeführt werden, da sie Lesezugriff auf die Konfigurationsdateien wie ``/etc/nova/nova.conf`` benötigen und direkt gegen die Datenbank und nicht gegen den OpenStack :term:`API-Endpunkte <API endpoint>` abfragen.
id: Tidak seperti alat CLI yang disebutkan di atas, :command:`*-manage` tools harus dijalankan dari pengendali cloud, sebagai root, karena mereka membutuhkan akses baca ke file konfigurasi seperti ``/etc/nova/nova.conf`` dan untuk membuat pertanyaan langsung terhadap basis data dan bukan terhadap OpenStack :term:`API endpoints <API endpoint>`.

source: Unmount the device after inspecting.
de: Demontieren Sie das Gerät nach der Prüfung.
id: Lepaskan (unmount) perangkat setelah memeriksa.

source: Update Share
de: Aktualisieren der Freigabe

source: Update a default value for a new tenant, as follows:
de: Aktualisieren Sie einen Vorschlagswert für einen neuen Mandanten wie folgt:
id: Perbarui nilai default untuk tenant baru, sebagai berikut:

source: Update a particular quota value, as follows:
de: Aktualisieren Sie einen bestimmten Quotenwert wie folgt:
id: Perbarui nilai kuota tertentu, sebagai berikut:

source: Update all ``.ini`` files to match passwords and pipelines as required for the OpenStack release in your environment.
de: Aktualisieren Sie alle ``.ini`` Dateien, um Passwörter und Pipelines entsprechend der OpenStack-Version in Ihrer Umgebung anzupassen.
id: Update semua file ``.ini`` untuk mencocokkan kata sandi dan pipeline seperti yang diperlukan untuk rilis OpenStack di lingkungan Anda.

source: Update services
de: Aktualisierungsdienste
id: Update layanan

source: Update the new port with the IPv4 address:
de: Aktualisieren Sie den neuen Port mit der IPv4-Adresse:
id: Perbarui port baru dengan alamat IPv4:

source: Update the repository database.
de: Aktualisieren Sie die Repository-Datenbank.
id: Update basis data repositori.

source: Upgrade Levels
de: Upgrade-Level
id: Tingkat Upgrade

source: Upgrade OpenStack.
de: Aktualisieren Sie OpenStack.
id: Tingkatkan OpenStack.

source: Upgrade levels are a feature added to OpenStack Compute since the Grizzly release to provide version locking on the RPC (Message Queue) communications between the various Compute services.
de: Upgrade-Level sind eine Funktion, die OpenStack Compute seit der Grizzly-Version hinzugefügt wurde, um eine Versionssperre für die RPC-Kommunikation (Message Queue) zwischen den verschiedenen Compute-Diensten zu ermöglichen.
id: Tingkat upgrade adalah fitur yang ditambahkan ke OpenStack Compute sejak rilis Grizzly untuk menyediakan penguncian versi pada komunikasi RPC (Message Queue) antara berbagai layanan Compute.

source: Upgrade packages on each node
de: Upgrade-Pakete auf jedem Knoten
id: Upgrade paket pada setiap node

source: Upgrade planning
de: Upgrade-Planung
id: Upgrade perencanaan

source: Upgrade process
de: Upgrade-Prozess
id: Proses Upgrade

source: Upload Certificate in DER format to Castellan
de: Zertifikat im DER-Format in Castellan hochladen
id: Unggah Sertifikat dalam format DER ke Castellan

source: Upload Image to Image service, with Signature Metadata
de: Hochladen von Abbildern zum Abbild-Dienst mit Signatur-Metadaten
id: Unggah Image ke layanan Image, dengan Signature Metadata

source: Use Cases
de: Anwendungsfälle
id: Use Case (kasus penggunaan)

source: Use ``openstack-nova-network`` on RHEL/CentOS/Fedora but ``nova-network`` on Ubuntu/Debian.
de: Verwenden Sie ``openstack-nova-network`` auf RHEL/CentOS/Fedora, aber ``nova-network`` auf Ubuntu/Debian.
id: Gunakan ``openstack-nova-network`` di RHEL / CentOS / Fedora tetapi ``nova-network`` di Ubuntu / Debian.

source: Use a public cloud
de: Eine Public Cloud nutzen
id: Gunakan cloud publik

source: Use ping to quickly find where a failure exists in the network path. In an instance, first see whether you can ping an external host, such as google.com. If you can, then there shouldn't be a network problem at all.
de: Verwenden Sie ping, um schnell herauszufinden, wo ein Fehler im Netzwerkpfad vorliegt. Überprüfen Sie in einer Instanz zunächst, ob Sie einen externen Host, wie z.B. google.com, pingen können. Wenn es geht, dann sollte es überhaupt kein Netzwerkproblem geben.
id: Gunakan ping untuk menemukan dengan cepat di mana ada kegagalan di jalur jaringan. Dalam sebuah instance, pertama-tama lihat apakah Anda dapat melakukan ping host eksternal, seperti google.com. Jika Anda bisa, maka seharusnya tidak ada masalah jaringan sama sekali.

source: Use private key to create a signature of the image
de: Verwenden Sie den privaten Schlüssel, um eine Signatur des Abbildes zu erstellen
id: Gunakan private key untuk membuat signature of image

source: Use security services
de: Sicherheitsdienste nutzen
id: Gunakan layanan keamanan

source: Use the :command:`apt-get install` command to install specific versions of each package by specifying ``<package-name>=<version>``. The script in the previous step conveniently created a list of ``package=version`` pairs for you:
de: Verwenden Sie den Befehl :command:`apt-get install`, um bestimmte Versionen jedes Pakets zu installieren, indem Sie ``<package-name>=<version>`` angeben. Das Skript im vorherigen Schritt hat bequem eine Liste von ``Paket=Version``Paaren für Sie erstellt:
id: Gunakan perintah :command:`apt-get install` untuk menginstal versi spesifik dari setiap paket dengan menentukan ``<package-name>=<version>``. Script pada langkah sebelumnya dengan mudah membuat daftar pasangan ``package=version`` untuk Anda:

source: Use the port when creating an instance:
de: Verwenden Sie den Port beim Erstellen einer Instanz:
id: Gunakan port saat membuat instance:

source: Use this command to register an existing key with OpenStack:
de: Verwenden Sie diesen Befehl, um einen vorhandenen Schlüssel bei OpenStack zu registrieren:

source: Use this example priority list to ensure that user-affected services are restored as soon as possible, but not before a stable environment is in place. Of course, despite being listed as a single-line item, each step requires significant work. For example, just after starting the database, you should check its integrity, or, after starting the nova services, you should verify that the hypervisor matches the database and fix any mismatches.
de: Verwenden Sie diese exemplarische Prioritätenliste, um sicherzustellen, dass die vom Benutzer betroffenen Dienste so schnell wie möglich wiederhergestellt werden, jedoch nicht bevor eine stabile Umgebung vorhanden ist. Natürlich erfordert jeder Schritt, obwohl er als Einzelposten aufgeführt ist, einen erheblichen Arbeitsaufwand. Beispielsweise sollten Sie kurz nach dem Start der Datenbank ihre Integrität überprüfen, oder nach dem Start der nova-Dienste sollten Sie überprüfen, ob der Hypervisor mit der Datenbank übereinstimmt und eventuelle Unstimmigkeiten beheben.
id: Gunakan contoh daftar prioritas ini untuk memastikan bahwa layanan yang dipengaruhi pengguna dipulihkan sesegera mungkin, tetapi tidak sebelum lingkungan yang stabil ada. Tentu saja, meskipun terdaftar sebagai item baris tunggal, setiap langkah membutuhkan pekerjaan yang signifikan. Misalnya, tepat setelah memulai database, Anda harus memeriksa integritasnya, atau, setelah memulai layanan nova, Anda harus memverifikasi bahwa hypervisor cocok dengan database dan memperbaiki ketidakcocokan.

source: Use your own cloud
de: Verwenden Sie Ihre eigene Cloud
id: Gunakan cloud Anda sendiri

source: User Management
de: Nutzerverwaltung

source: User authentication requests include sensitive information including usernames, passwords, and authentication tokens. It is strongly recommended to place API services behind hardware that performs SSL termination.
de: Benutzerauthentifizierungsanfragen enthalten sensible Informationen wie Benutzernamen, Passwörter und Authentifizierungstoken. Es wird dringend empfohlen, API-Dienste hinter Hardware zu platzieren, die eine SSL-Terminierung durchführt.
id: Permintaan otentikasi pengguna mencakup informasi sensitif termasuk nama pengguna, kata sandi, dan token otentikasi. Sangat disarankan untuk menempatkan layanan API di belakang perangkat keras yang melakukan penghentian SSL.

source: User can see his rate limits and absolute limits by running commands :command:`manila rate-limits` and :command:`manila absolute-limits` respectively. For more details on limits and quotas see `Quotas and limits <https://docs.openstack.org/admin-guide/shared-file-systems-quotas.html>`__ of "Share management" section of OpenStack Administrator Guide document.
de: Der Benutzer kann seine Ratenbegrenzungen und absoluten Begrenzungen sehen, indem er die Befehle :command:`manila rate-limits` und :command:`manila absolute-limits` ausführt. Weitere Details zu Limits und Quoten finden Sie unter `Quoten und Limits <https://docs.openstack.org/admin-guide/shared-file-systems-quotas.html>`__ im Abschnitt "Share Management" des OpenStack Administrator Guide Dokuments.

source: User quotas
de: Benutzerkontingente
id: Kuota pengguna

source: User virtual machines
de: Virtuelle Maschinen verwenden
id: Mesin virtual pengguna

source: User-Facing Operations
de: Benutzerorientierte Operationen
id: Operasi Menghadapi Pengguna

source: Username
de: Benutzername

source: Username and email address are self-explanatory, though your site may have local conventions you should observe. The primary project is simply the first project the user is associated with and must exist prior to creating the user. Role is almost always going to be "member." Out of the box, OpenStack comes with two roles defined:
de: Benutzername und E-Mail-Adresse sind selbsterklärend, obwohl Ihre Website möglicherweise lokale Konventionen hat, die Sie beachten sollten. Das primäre Projekt ist einfach das erste Projekt, dem der Benutzer zugeordnet ist und das vor der Erstellung des Benutzers existieren muss. Die Rolle wird fast immer "Mitglied" sein. OpenStack wird standardmäßig mit zwei definierten Rollen ausgeliefert:

source: Users Who Disrupt Other Users
de: Benutzer, die andere Benutzer unterbrechen

source: Users and Projects
de: Benutzer und Projekte
id: Pengguna dan Proyek

source: Users and groups are managed through Active Directory and imported into the Identity service using LDAP. CLIs are available for nova and Euca2ools to do this.
de: Benutzer und Gruppen werden über Active Directory verwaltet und über LDAP in den Identity-Service importiert. Dazu stehen CLIs für nova und Euca2ools zur Verfügung.
id: Pengguna dan grup dikelola melalui Active Directory dan diimpor ke layanan Identity menggunakan LDAP. CLI tersedia untuk nova dan Euca2ools untuk melakukan ini.

source: Users being able to retrieve console logs from running instances is a boon for support—many times they can figure out what's going on inside their instance and fix what's going on without bothering you. Unfortunately, sometimes overzealous logging of failures can cause problems of its own.
de: Benutzer, die in der Lage sind, Konsolenprotokolle von laufenden Instanzen abzurufen, sind ein Segen für den Support - viele Male können sie herausfinden, was in ihrer Instanz vor sich geht und beheben, was vor sich geht, ohne Sie zu stören. Leider kann die manchmal übereifrige Protokollierung von Fehlern zu eigenen Problemen führen.
id: Pengguna yang dapat mengambil log konsol dari menjalankan instance adalah anugerah untuk dukungan — sering kali mereka dapat mengetahui apa yang terjadi di dalam instance mereka dan memperbaiki apa yang terjadi tanpa mengganggu Anda. Sayangnya, terkadang logging kegagalan yang terlalu banyak dapat menyebabkan masalah tersendiri.

source: Users must be associated with at least one project, though they may belong to many. Therefore, you should add at least one project before adding users.
de: Benutzer müssen mindestens einem Projekt zugeordnet sein, obwohl sie zu vielen gehören können. Daher sollten Sie mindestens ein Projekt hinzufügen, bevor Sie Benutzer hinzufügen.
id: Pengguna harus dikaitkan dengan setidaknya satu proyek, meskipun mereka mungkin milik banyak. Karena itu, Anda harus menambahkan setidaknya satu proyek sebelum menambahkan pengguna.

source: Users on your cloud can disrupt other users, sometimes intentionally and maliciously and other times by accident. Understanding the situation allows you to make a better decision on how to handle the disruption.
de: Benutzer in Ihrer Cloud können andere Benutzer stören, manchmal absichtlich und böswillig, manchmal aus Versehen. Das Verständnis der Situation ermöglicht es Ihnen, eine bessere Entscheidung darüber zu treffen, wie Sie mit der Störung umgehen.

source: Using :command:`openstack server show` as an admin user will show the compute node the instance was scheduled on as ``hostId``. If the instance failed during scheduling, this field is blank.
de: Wenn Sie :command:`openstack server show` als Admin-Benutzer verwenden, wird der Compute-Knoten, auf dem die Instanz geplant wurde, als ``hostId`` angezeigt. Wenn die Instanz bei der Einplanung fehlgeschlagen ist, ist dieses Feld leer.

source: Using Image API v1 requires '-w 0' above, since multiline image properties are not supported.
de: Die Verwendung der Image API v1 erfordert oben '-w 0', da mehrzeilige Abbildeigenschaften nicht unterstützt werden.
id: Menggunakan Image API v1 memerlukan '-w 0' di atas, karena properti image multiline tidak didukung.

source: Using Instance-Specific Data
de: Verwendung instanzspezifischer Daten

source: Using OpenStack
de: Verwendung von OpenStack

source: Using OpenStack Compute cells, the NeCTAR Research Cloud spans eight sites with approximately 4,000 cores per site.
de: Mit OpenStack Compute-Zellen umfasst die NeCTAR Research Cloud acht Standorte mit ca. 4.000 Kernen pro Standort.
id: Menggunakan sel OpenStack Compute, NeCTAR Research Cloud mencakup delapan situs dengan sekitar 4.000 core per situs.
