Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: Failures of hardware are common in large-scale deployments such as an infrastructure cloud. Consider your processes and balance time saving against availability. For example, an Object Storage cluster can easily live with dead disks in it for some period of time if it has sufficient capacity. Or, if your compute installation is not full, you could consider live migrating instances off a host with a RAM failure until you have time to deal with the problem.
de: Ausfälle von Hardware sind in großen Implementierungen wie einer Infrastruktur-Cloud häufig. Berücksichtigen Sie Ihre Prozesse und gleichen Sie Zeitersparnis und Verfügbarkeit aus. So kann beispielsweise ein Object Storage Cluster bei ausreichender Kapazität leicht mit leeren Festplatten über einen längeren Zeitraum leben. Oder, wenn Ihre Compute-Installation nicht voll ist, können Sie die Live-Migration von Instanzen von einem Host mit einem RAM-Fehler in Betracht ziehen, bis Sie Zeit haben, sich mit dem Problem zu befassen.
id: Kegagalan perangkat keras umum terjadi dalam penyebaran berskala besar seperti cloud infrastruktur. Pertimbangkan proses Anda dan seimbangkan penghematan waktu dengan ketersediaan. Sebagai contoh, sebuah cluster Object Storage dapat dengan mudah hidup dengan disk mati di dalamnya untuk beberapa periode waktu jika memiliki kapasitas yang cukup. Atau, jika instalasi komputasi Anda tidak penuh, Anda dapat mempertimbangkan memigrasi instance langsung dari host dengan kegagalan RAM hingga Anda punya waktu untuk mengatasi masalah tersebut.

source: Family Educational Rights and Privacy Act (FERPA)
de: Gesetz über die Rechte der Familienbildung und den Datenschutz (FERPA)

source: Feature requests typically start their life in Etherpad, a collaborative editing tool, which is used to take coordinating notes at a design summit session specific to the feature. This then leads to the creation of a blueprint on the Launchpad site for the particular project, which is used to describe the feature more formally. Blueprints are then approved by project team members, and development can begin.
de: Feature-Anfragen beginnen in der Regel ihr Leben in Etherpad, einem kollaborativen Bearbeitungswerkzeug, mit dem Koordinierungsnotizen bei einer funktionsbezogenen Design-Gipfel-Sitzung gemacht werden. Dies führt dann zur Erstellung eines Blueprints auf der Launchpad-Seite für das jeweilige Projekt, mit dem das Feature formeller beschrieben wird. Die Blueprints werden dann von den Mitgliedern des Projektteams genehmigt, und die Entwicklung kann beginnen.
id: Permintaan fitur biasanya memulai kehidupannya di Etherpad, alat pengeditan kolaboratif, yang digunakan untuk membuat catatan koordinasi pada sesi puncak desain khusus untuk fitur tersebut. Ini kemudian mengarah pada pembuatan cetak biru di situs Launchpad untuk proyek tertentu, yang digunakan untuk menggambarkan fitur lebih formal. Cetak biru kemudian disetujui oleh anggota tim proyek, dan pengembangan dapat dimulai.

source: Felix Lee of Academia Sinica Grid Computing Centre in Taiwan contributed this story.
de: Felix Lee vom Academia Sinica Grid Computing Centre in Taiwan hat diese Geschichte geschrieben.
id: Felix Lee dari Academia Sinica Grid Computing Center di Taiwan menyumbangkan cerita ini.

source: Field-based rules
de: Feldbasierte Regeln

source: Figure. Neutron network paths
de: Abbildung. Neutronnetzwerkpfade
id: Figur. Jalur jaringan neutron

source: Figure. Traffic route for ping packet
de: Abbildung. Traffic-Route für Ping-Pakete
id: Angka. Rute lalu lintas untuk paket ping

source: File System Backups
de: Dateisystem-Backups
id: Cadangan Sistem File

source: File descriptor limits when scaling a cloud environment
de: Dateideskriptorbeschränkungen bei der Skalierung einer Cloud-Umgebung
id: Batas deskriptor file saat menskala lingkungan cloud

source: File injection
de: Datei-Injektion

source: File system to store files and directories, where all the data lives, including the root partition that starts and runs the system.
de: Dateisystem zum Speichern von Dateien und Verzeichnissen, in denen sich alle Daten befinden, einschließlich der Root-Partition, die das System startet und ausführt.
id: Sistem file untuk menyimpan file dan direktori, tempat semua data hidup, termasuk partisi root yang memulai dan menjalankan sistem.

source: Final steps
de: Letzte Schritte
id: Langkah terakhir

source: Finally, Alvaro noticed something. When a packet from the outside hits the cloud controller, it should not be configured with a VLAN. We verified this as true. When the packet went from the cloud controller to the compute node, it should only have a VLAN if it was destined for an instance. This was still true. When the ping reply was sent from the instance, it should be in a VLAN. True. When it came back to the cloud controller and on its way out to the Internet, it should no longer have a VLAN. False. Uh oh. It looked as though the VLAN part of the packet was not being removed.
de: Schließlich bemerkte Alvaro etwas. Wenn ein Paket von außen auf den Cloud-Controller trifft, sollte es nicht mit einem VLAN konfiguriert werden. Wir haben dies als wahr bestätigt. Wenn das Paket vom Cloud-Controller zum Compute-Knoten ging, sollte es nur dann ein VLAN haben, wenn es für eine Instanz bestimmt war. Das war immer noch so. Wenn die Ping-Antwort von der Instanz gesendet wurde, sollte sie sich in einem VLAN befinden. Stimmt. Wenn es zurück zum Cloud-Controller und auf dem Weg ins Internet kam, sollte es kein VLAN mehr haben. Falsch. Uh oh oh. Es sah so aus, als ob der VLAN-Teil des Pakets nicht entfernt wurde.
id: Akhirnya, Alvaro memperhatikan sesuatu. Ketika sebuah paket dari luar mengenai pengendali cloud, itu tidak harus dikonfigurasikan dengan VLAN. Kami memverifikasi ini sebagai benar. Ketika paket pergi dari cloud controller ke compute node, seharusnya hanya memiliki VLAN jika ditakdirkan untuk instance. Ini masih benar. Ketika balasan ping dikirim dari instance, itu harus dalam VLAN. Benar. Ketika kembali ke pengontrol cloud dan dalam perjalanan keluar ke Internet, seharusnya tidak lagi memiliki VLAN. Salah. Uh oh. Tampaknya bagian VLAN dari paket itu tidak dihapus.

source: Finally, I checked StackTach and reviewed the user's events. They had created and deleted several snapshots—most likely experimenting. Although the timestamps didn't match up, my conclusion was that they launched their instance and then deleted the snapshot and it was somehow removed from ``/var/lib/nova/instances/_base``. None of that made sense, but it was the best I could come up with.
de: Schließlich habe ich StackTach überprüft und die Ereignisse des Benutzers überprüft. Sie hatten mehrere Schattenkopien erstellt und gelöscht - höchstwahrscheinlich experimentierend. Obwohl die Zeitstempel nicht übereinstimmten, war meine Schlussfolgerung, dass sie ihre Instanz gestartet und dann die Schattenkopie gelöscht haben und er irgendwie aus ``/var/lib/nova/instances/_base`` entfernt wurde. Nichts davon machte Sinn, aber es war das Beste, was mir einfiel.
id: Akhirnya, saya memeriksa StackTach dan meninjau acara pengguna. Mereka telah membuat dan menghapus beberapa foto — kemungkinan besar bereksperimen. Meskipun timestamp tidak cocok, kesimpulan saya adalah bahwa mereka meluncurkan instance mereka dan kemudian menghapus snapshot dan entah bagaimana dihapus dari ``/var/lib/nova/instances/_base``. Tidak ada yang masuk akal, tapi itu yang terbaik yang bisa saya lakukan.

source: Finally, mount the disk:
de: Zum Schluss hängen Sie die Platte wieder ein:
id: Akhirnya, pasang disk:

source: Finally, reattach volumes using the same method described in the section :ref:`volumes`.
de: Schließlich können Sie Volumes mit der gleichen Methode neu anhängen, die im Abschnitt :ref:`volumes` beschrieben ist.
id: Terakhir, pasang kembali volume menggunakan metode yang sama seperti yang dijelaskan di bagian :ref:`volume`.

source: Finally, to create a share that uses this share network, get to Create Share use case described earlier in this chapter.
de: Um schließlich eine Freigabe zu erstellen, die dieses Freigabennetzwerk verwendet, lesen Sie den zuvor in diesem Kapitel beschriebenen Anwendungsfall Freigabe erstellen.

source: Find the ID for each instance by listing the server IDs using the following command:
de: Finden Sie die ID für jede Instanz, indem Sie die Server-IDs mit dem folgenden Befehl auflisten:
id: Temukan ID untuk setiap instance dengan mendaftar ID server menggunakan perintah berikut:

source: Find the ``[filter:ratelimit]`` section in ``/etc/swift/proxy-server.conf``, and copy in the following configuration section after it:
de: Suchen Sie den Abschnitt ``[filter:ratelimit]`` in ``/etc/swift/proxy-server.conf``, und kopieren Sie ihn danach in den folgenden Konfigurationsabschnitt:
id: Temukan bagian ``[filter: ratelimit] `` di ``/etc/swift/proxy-server.conf``, dan salin di bagian konfigurasi berikut setelahnya:

source: Find the ``[pipeline:main]`` section in ``/etc/swift/proxy-server.conf``, and add ``ip_whitelist`` after ratelimit to the list like so. When you're done, save and close the file:
de: Suchen Sie den Abschnitt ``[pipeline:main]`` in ``/etc/swift/proxy-server.conf``, und fügen Sie ``ip_whitelist`` nach Tarifbeschränkung der Liste so hinzu. Wenn Sie fertig sind, speichern und schließen Sie die Datei:
id: Temukan bagian ``[pipeline: main] `` di ``/etc/swift/proxy-server.conf``, dan tambahkan ``ip_whitelist`` setelah ratelimit ke daftar seperti itu. Setelah selesai, simpan dan tutup file:

source: Find the ``provider:segmentation_id`` of the network you're interested in. This is the same field used for the VLAN ID in VLAN-based networks:
de: Suchen Sie den ``provider:segmentation_id`` des Netzwerks, für das Sie sich interessieren. Dies ist das gleiche Feld, das für die VLAN-ID in VLAN-basierten Netzwerken verwendet wird:
id: Temukan ``provider: segmentation_id`` dari jaringan yang Anda minati. Ini adalah bidang yang sama dengan yang digunakan untuk ID VLAN di jaringan berbasis VLAN:

source: Find the ``scheduler_driver`` config and change it like so:
de: Suchen Sie die Konfiguration ``scheduler_driver`` und ändern Sie sie so:
id: Temukan konfigurasi ``scheduler_driver`` dan ubah seperti ini:

source: Find the external VLAN tag of the network you're interested in. This is the ``provider:segmentation_id`` as returned by the networking service:
de: Suchen Sie das externe VLAN-Tag des Netzwerks, für das Sie sich interessieren. Dies ist die ``Provider:segmentation_id``, die vom Netzwerkdienst zurückgegeben wird:
id: Temukan tag VLAN eksternal dari jaringan yang Anda minati. Ini adalah ``provider:segmentation_id`` yang dikembalikan oleh layanan jaringan:

source: Find the port corresponding to the instance. For example:
de: Suchen Sie den Port, der der Instanz entspricht. Zum Beispiel:
id: Temukan port yang sesuai dengan instance. Sebagai contoh:

source: Finding a Failure in the Path
de: Finden eines Fehlers im Pfad
id: Menemukan Kegagalan di Path

source: First, find the UUID of the instance in question:
de: Suchen Sie zunächst die UUID der betreffenden Instanz:
id: Pertama, temukan UUID dari instance yang dimaksud:

source: First, unmount the disk:
de: Als Erstes, hängen Sie die Platte aus:
id: Pertama, lepaskan disk:

source: First, you can discover what servers belong to your OpenStack cloud by running:
de: Zunächst können Sie feststellen, welche Server zu Ihrer OpenStack-Cloud gehören, indem Sie sie ausführen:
id: Pertama, Anda dapat menemukan server apa yang menjadi milik OpenStack cloud Anda dengan menjalankan:

source: Fixed IPs
de: Feste IPs
id: IP tetap

source: Flavors
de: Varianten

source: Flavors define a number of parameters, resulting in the user having a choice of what type of virtual machine to run—just like they would have if they were purchasing a physical server. :ref:`table_flavor_params` lists the elements that can be set. Note in particular ``extra_specs``, which can be used to define free-form characteristics, giving a lot of flexibility beyond just the size of RAM, CPU, and Disk.
de: Varianten definieren eine Reihe von Parametern, so dass der Benutzer die Wahl hat, welchen Typ von virtueller Maschine er ausführen möchte - genau wie beim Kauf eines physischen Servers. :ref:`table_flavor_params` listet die Elemente auf, die gesetzt werden können. Beachten Sie insbesondere ``extra_specs``, mit dem Sie Freiformmerkmale definieren können, die eine große Flexibilität über die Größe von RAM, CPU und Festplatte hinaus bieten.
id: Flavour menentukan sejumlah parameter, sehingga pengguna memiliki pilihan jenis mesin virtual apa yang akan dijalankan — seperti yang akan mereka miliki jika mereka membeli server fisik. :ref: `table_flavor_params` mencantumkan elemen yang dapat diatur. Catatan khususnya ``extra_specs``, yang dapat digunakan untuk mendefinisikan karakteristik bentuk bebas, memberikan banyak fleksibilitas di luar ukuran RAM, CPU, dan Disk.

source: For Compute, instance metadata is a collection of key-value pairs associated with an instance. Compute reads and writes to these key-value pairs any time during the instance lifetime, from inside and outside the instance, when the end user uses the Compute API to do so. However, you cannot query the instance-associated key-value pairs with the metadata service that is compatible with the Amazon EC2 metadata service.
de: Für Compute sind Instanz-Metadaten eine Sammlung von Schlüssel-Wert-Paaren, die einer Instanz zugeordnet sind. Compute liest und schreibt in diese Schlüssel-Wert-Paare zu jeder Zeit während der Lebensdauer der Instanz, sowohl innerhalb als auch außerhalb der Instanz, wenn der Endbenutzer die Compute-API dazu verwendet. Sie können jedoch die instanzassoziierten Schlüssel-Wert-Paare nicht mit dem Metadatendienst abfragen, der mit dem Amazon EC2 Metadatendienst kompatibel ist.

source: For Object Storage, each region has a swift environment.
de: Für die Objektspeicherung verfügt jede Region über eine schnelle Umgebung.
id: Untuk Object Storage, setiap wilayah memiliki lingkungan yang cepat.

source: For a discussion of metric tracking, including how to extract metrics from your cloud, see the `OpenStack Operations Guide <https://docs.openstack.org/operations-guide/ops-logging-monitoring.html>`_.
de: Eine Erläuterung des metrischen Tracking, einschließlich der Frage, wie Sie Metriken aus Ihrer Cloud extrahieren können, finden Sie im `OpenStack Operations Guide <https://docs.openstack.org/operations-guide/ops-logging-monitoring.html>`_.
id: Untuk diskusi tentang pelacakan metrik, termasuk cara mengekstrak metrik dari cloud Anda, lihat `OpenStack Operations Guide <https://docs.openstack.org/operations-guide/ops-logging-monitoring.html>`_.

source: For an example of instance metadata, users can generate and register SSH keys using the :command:`openstack keypair create` command:
de: Als Beispiel für Instanzmetadaten können Benutzer SSH-Schlüssel mit dem Befehl :command:`openstack keypair create` erzeugen und registrieren:

source: For compute nodes, ``nova-scheduler`` will manage differences in sizing with core count and RAM. However, you should consider that the user experience changes with differing CPU speeds. When adding object storage nodes, a :term:`weight` should be specified that reflects the :term:`capability` of the node.
de: Für Compute-Knoten verwaltet ``nova-scheduler`` Unterschiede in der Größe mit der Kernanzahl und dem RAM. Sie sollten jedoch berücksichtigen, dass sich die Benutzererfahrung mit unterschiedlichen CPU-Geschwindigkeiten ändert. Beim Hinzufügen von Objektspeicherknoten sollte ein :Term:`Gewicht` angegeben werden, der den :term:`Fähigkeit` des Knotens widerspiegelt.
id: Untuk komputasi node, ``nova-scheduler`` akan mengatur perbedaan ukuran dengan core count dan RAM. Namun, Anda harus mempertimbangkan bahwa pengalaman pengguna berubah dengan kecepatan CPU yang berbeda. Saat menambahkan node penyimpanan objek, :term: `weight` harus ditentukan yang mencerminkan :term:` capability ` node.

source: For details, see subsection `Security Services <https://docs.openstack.org/admin-guide/shared-file-systems-security-services.html>`__ of “Shared File Systems” section of OpenStack Administrator Guide document.
de: Weitere Informationen finden Sie im Unterabschnitt `Sicherheitsdienste <https://docs.openstack.org/admin-guide/shared-file-systems-security-services.html>`__ im Abschnitt "Shared File Systems" des OpenStack-Administratorhandbuchs.

source: For each compute node your environment, view the ``/etc/init.d`` directory and check if it contains nova*, cinder*, neutron*, or glance*, Also check RabbitMQ message queues that are growing without being consumed which will indicate which OpenStack services are affected. Restart the affected OpenStack services.
de: Betrachten Sie für jeden Compute-Knoten Ihrer Umgebung das Verzeichnis ``/etc/init.d`` und überprüfen Sie, ob es nova*, cinder*, neutron* oder glance* enthält, und überprüfen Sie auch die RabbitMQ-Nachrichtenwarteschlangen, die wachsen, ohne verbraucht zu werden, was anzeigt, welche OpenStack-Dienste betroffen sind. Starten Sie die betroffenen OpenStack-Dienste neu.
id: Untuk setiap node komputasi lingkungan Anda, lihat direktori ``/etc/init.d`` dan periksa apakah mengandung nova*, cinder*, neutron*, or glance*, Juga periksa antrian pesan RabbitMQ yang tumbuh tanpa dikonsumsi yang akan menunjukkan layanan OpenStack mana yang terpengaruh. Mulai ulang layanan OpenStack yang terpengaruh.

source: For each controller node in your environment, view the ``/etc/init.d`` directory to check it contains nova*, cinder*, neutron*, or glance*. Also check RabbitMQ message queues that are growing without being consumed which will indicate which OpenStack service is affected. Restart the affected OpenStack service.
de: Betrachten Sie für jeden Controller-Knoten in Ihrer Umgebung das Verzeichnis ``/etc/init.d```, um sicherzustellen, dass es nova*, cinder*, neutron* oder glance* enthält. Überprüfen Sie auch die RabbitMQ-Nachrichtenwarteschlangen, die wachsen, ohne verbraucht zu werden, was anzeigt, welcher OpenStack-Dienst betroffen ist. Starten Sie den betroffenen OpenStack-Dienst neu.
id: Untuk setiap node pengontrol di lingkungan Anda, lihat direktori ``/etc/init.d`` untuk memeriksanya berisi nova*, cinder*, neutron*, atau glance*. Juga periksa antrian pesan RabbitMQ yang tumbuh tanpa dikonsumsi yang akan menunjukkan layanan OpenStack mana yang terpengaruh. Mulai ulang layanan OpenStack yang terpengaruh.

source: For environments using the OpenStack Networking service (neutron), verify the release version of the database. For example:
de: In Umgebungen, die den OpenStack Networking-Dienst (Neutron) verwenden, überprüfen Sie die Release-Version der Datenbank. Zum Beispiel:
id: Untuk lingkungan yang menggunakan layanan OpenStack Networking (neutron), verifikasi versi rilis dari database. Sebagai contoh:

source: For example
de: Beispiel

source: For example, a group of users have instances that are utilizing a large amount of compute resources for very compute-intensive tasks. This is driving the load up on compute nodes and affecting other users. In this situation, review your user use cases. You may find that high compute scenarios are common, and should then plan for proper segregation in your cloud, such as host aggregation or regions.
de: Beispielsweise hat eine Gruppe von Benutzern Instanzen, die eine große Menge an Rechenressourcen für sehr rechenintensive Aufgaben nutzen. Dies führt zu einer höheren Auslastung der Compute-Knoten und betrifft andere Benutzer. Überprüfen Sie in dieser Situation Ihre Benutzer-Anwendungsfälle. Sie werden feststellen, dass Szenarien mit hohem Rechenaufwand häufig auftreten und sollten dann eine angemessene Trennung in Ihrer Cloud planen, wie z.B. Host-Aggregation oder Regionen.

source: For example, let's say you have a special ``authorized_keys`` file named special_authorized_keysfile that for some reason you want to put on the instance instead of using the regular SSH key injection. In this case, you can use the following command:
de: Nehmen wir zum Beispiel an, Sie haben eine spezielle ``authorized_keys`` Datei namens special_authorized_keysfile, die Sie aus irgendeinem Grund auf die Instanz setzen möchten, anstatt die normale SSH-Schlüsselinjektion zu verwenden. In diesem Fall können Sie den folgenden Befehl verwenden:

source: For example, run the following command:
de: Führen Sie beispielsweise den folgenden Befehl aus:
id: Misalnya, jalankan perintah berikut:

source: For example, to place a 5 GB quota on an account:
de: Zum Beispiel, um eine 5 GB Quote auf einem Konto zu platzieren:
id: Misalnya, untuk menempatkan kuota 5 GB pada akun:

source: For example, to restrict a project's image storage to 5 GB, do this:
de: Um beispielsweise den Abbildspeicher eines Projekts auf 5 GB zu beschränken, gehen Sie wie folgt vor:
id: Misalnya, untuk membatasi penyimpanan image proyek hingga 5 GB, lakukan ini:

source: For example, you usually cannot configure NICs for VLANs when PXE booting. Additionally, you usually cannot PXE boot with bonded NICs. If you run into this scenario, consider using a simple 1 GB switch in a private network on which only your cloud communicates.
de: Beispielsweise können Sie normalerweise keine NICs für VLANs beim PXE-Boot konfigurieren. Außerdem können Sie normalerweise nicht PXE-Boot mit gebundenen NICs durchführen. Wenn Sie in dieses Szenario geraten, sollten Sie einen einfachen 1 GB-Switch in einem privaten Netzwerk verwenden, in dem nur Ihre Cloud kommuniziert.
id: Misalnya, Anda biasanya tidak dapat mengonfigurasi NIC untuk VLAN saat PXE boot. Selain itu, Anda biasanya tidak dapat melakukan PXE boot dengan NIC terikat. Jika Anda mengalami skenario ini, pertimbangkan untuk menggunakan switch 1 GB sederhana di jaringan pribadi tempat cloud Anda berkomunikasi.

source: For example:
de: Zum Beispiel:
id: Sebagai contoh:
