Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: This does not save your password in plain text, which is a good thing. But when you source or run the script, it prompts you for your password and then stores your response in the environment variable ``OS_PASSWORD``. It is important to note that this does require interactivity. It is possible to store a value directly in the script if you require a noninteractive operation, but you then need to be extremely cautious with the security and permissions of this file.
de: Dadurch wird dein Passwort nicht im Klartext gespeichert, was eine gute Sache ist. Aber wenn Sie das Skript erstellen oder ausführen, fragt es Sie nach Ihrem Passwort und speichert Ihre Antwort dann in der Umgebungsvariablen ``OS_PASSWORD``. Es ist wichtig zu beachten, dass dies Interaktivität erfordert. Es ist möglich, einen Wert direkt im Skript zu speichern, wenn Sie eine nicht interaktive Operation benötigen, aber Sie müssen dann äußerst vorsichtig mit der Sicherheit und den Berechtigungen dieser Datei sein.
id: Ini tidak menyimpan kata sandi Anda dalam teks biasa, yang merupakan hal yang baik. Tetapi ketika Anda bersumber atau menjalankan skrip, itu meminta Anda untuk kata sandi Anda dan kemudian menyimpan respons Anda dalam variabel lingkungan ``OS_PASSWORD``. Penting untuk dicatat bahwa ini memang membutuhkan interaktivitas. Dimungkinkan untuk menyimpan nilai secara langsung dalam skrip jika Anda memerlukan operasi non-aktif, tetapi Anda kemudian harus sangat berhati-hati dengan keamanan dan izin file ini.

source: This enables you to arrange OpenStack compute hosts into logical groups and provides a form of physical isolation and redundancy from other availability zones, such as by using a separate power supply or network equipment.
de: Dies ermöglicht es Ihnen, OpenStack-Compute-Hosts in logische Gruppen einzuteilen und bietet eine Form der physischen Isolierung und Redundanz von anderen Verfügbarkeitszonen, z.B. durch die Verwendung einer separaten Stromversorgung oder Netzwerkgeräte.
id: Ini memungkinkan Anda untuk mengatur host komputasi OpenStack ke dalam grup logis dan menyediakan bentuk isolasi fisik dan redundansi dari zona ketersediaan lainnya, seperti dengan menggunakan catu daya atau peralatan jaringan yang terpisah.

source: This enables you to partition OpenStack Compute deployments into logical groups for load balancing and instance distribution. You can use host aggregates to further partition an availability zone. For example, you might use host aggregates to partition an availability zone into groups of hosts that either share common resources, such as storage and network, or have a special property, such as trusted computing hardware.
de: Auf diese Weise können Sie OpenStack Compute-Bereitstellungen in logische Gruppen für Lastausgleich und Instanzverteilung unterteilen. Sie können Host-Aggregate verwenden, um eine Verfügbarkeitszone weiter zu partitionieren. So können Sie beispielsweise Host-Aggregate verwenden, um eine Verfügbarkeitszone in Gruppen von Hosts zu partitionieren, die entweder gemeinsame Ressourcen wie Speicher und Netzwerk gemeinsam nutzen oder eine spezielle Eigenschaft haben, wie beispielsweise vertrauenswürdige Computerhardware.
id: Ini memungkinkan Anda untuk mempartisi penyebaran OpenStack Compute ke dalam grup logis untuk penyeimbangan beban dan distribusi instance. Anda dapat menggunakan agregat host untuk lebih lanjut mempartisi zona ketersediaan. Misalnya, Anda dapat menggunakan agregat host untuk mempartisi zona ketersediaan ke dalam grup host yang berbagi sumber daya bersama, seperti penyimpanan dan jaringan, atau memiliki properti khusus, seperti perangkat keras komputasi tepercaya.

source: This example assumes that ``/dev/sdb`` has failed.
de: In diesem Beispiel wird davon ausgegangen, dass ``/dev/sdb`` ausgefallen ist.
id: Contoh ini mengasumsikan bahwa ``/dev/sdb`` telah gagal.

source: This example configuration handles the nova service only. It first configures rsyslog to act as a server that runs on port 514. Next, it creates a series of logging templates. Logging templates control where received logs are stored. Using the last example, a nova log from c01.example.com goes to the following locations:
de: Diese Beispielkonfiguration behandelt nur den nova-Dienst. Zuerst wird rsyslog konfiguriert, um als Server zu fungieren, der auf Port 514 läuft. Als nächstes erstellt es eine Reihe von Protokollvorlagen. Protokollvorlagen steuern, wo empfangene Protokolle gespeichert werden. Anhand des letzten Beispiels geht ein nova-Protokoll von c01.example.com an die folgenden Stellen:
id: Contoh konfigurasi ini hanya menangani layanan nova. Pertama-tama mengkonfigurasi rsyslog untuk bertindak sebagai server yang berjalan pada port 514. Selanjutnya, ia menciptakan serangkaian templat logging. Templat logging mengontrol di mana log yang diterima disimpan. Menggunakan contoh terakhir, log nova dari c01.example.com pergi ke lokasi berikut:

source: This example creates a security group that allows web traffic anywhere on the Internet. We'll call this group ``global_http``, which is clear and reasonably concise, encapsulating what is allowed and from where. From the command line, do:
de: Dieses Beispiel erstellt eine Sicherheitsgruppe, die Webverkehr überall im Internet zulässt. Wir nennen diese Gruppe ``global_http``, die klar und einigermaßen prägnant ist und kapselt, was erlaubt ist und von wo aus. Von der Kommandozeile aus, tun Sie es:
id: Contoh ini membuat grup keamanan yang memungkinkan lalu lintas web di mana saja di Internet. Kami akan menyebut grup ini ``global_http``, yang jelas dan cukup ringkas, merangkum apa yang diizinkan dan dari mana. Dari command line, lakukan:

source: This example is for illustrative purposes only. It should not be used as a container IP whitelist solution without further development and extensive security testing.
de: Dieses Beispiel dient nur zur Veranschaulichung. Es sollte nicht als Container-IP-Whitelist-Lösung ohne Weiterentwicklung und umfangreiche Sicherheitstests verwendet werden.
id: Contoh ini hanya untuk tujuan ilustrasi. Seharusnya tidak digunakan sebagai solusi daftar putih IP kontainer tanpa pengembangan lebih lanjut dan pengujian keamanan yang luas.

source: This example is for illustrative purposes only. It should not be used as a scheduler for Compute without further development and testing.
de: Dieses Beispiel dient nur zur Veranschaulichung. Es sollte nicht als Scheduler für Compute ohne weitere Entwicklung und Tests verwendet werden.
id: Contoh ini hanya untuk tujuan ilustrasi. Seharusnya tidak digunakan sebagai scheduler untuk Compute tanpa pengembangan dan pengujian lebih lanjut.

source: This example shows the HTTP requests from the client and the responses from the endpoints, which can be helpful in creating custom tools written to the OpenStack API.
de: Dieses Beispiel zeigt die HTTP-Anfragen des Clients und die Antworten der Endpunkte, was bei der Erstellung benutzerdefinierter Tools, die in die OpenStack-API geschrieben wurden, hilfreich sein kann.
id: Contoh ini menunjukkan permintaan HTTP dari klien dan respons dari endpoint, yang dapat membantu dalam membuat alat khusus yang ditulis ke OpenStack API.

source: This external bridge also includes a physical network interface, ``eth2`` in this example, which finally lands the packet on the external network destined for an external router or destination.
de: Diese externe Brücke beinhaltet auch eine physikalische Netzwerkschnittstelle, in diesem Beispiel ``eth2``, die das Paket schließlich auf dem externen Netzwerk landet, das für einen externen Router oder ein externes Ziel bestimmt ist.
id: Jembatan eksternal ini juga menyertakan antarmuka jaringan fisik, ``eth2`` dalam contoh ini, yang akhirnya mendaratkan paket pada jaringan eksternal yang ditujukan untuk router atau tujuan eksternal.

source: This formatting is used to support translation of logging messages into different languages using the `gettext <https://docs.python.org/2/library/gettext.html>`_ internationalization library. You don't need to do this for your own custom log messages. However, if you want to contribute the code back to the OpenStack project that includes logging statements, you must surround your log messages with underscores and parentheses.
de: Diese Formatierung wird verwendet, um die Übersetzung von Logging-Meldungen in verschiedene Sprachen mit Hilfe der `gettext <https://docs.python.org/2/library/gettext.html>`_ Internationalization Library zu unterstützen. Sie müssen dies nicht für Ihre eigenen benutzerdefinierten Protokollmeldungen tun. Wenn Sie jedoch den Code wieder in das OpenStack-Projekt einbringen möchten, das Protokollanweisungen enthält, müssen Sie Ihre Protokollnachrichten mit Unterstrichen und Klammern umgeben.
id: Pemformatan ini digunakan untuk mendukung terjemahan pesan logging ke bahasa yang berbeda menggunakan `gettext <https://docs.python.org/2/library/gettext.html>` _ perpustakaan internasionalisasi. Anda tidak perlu melakukan ini untuk pesan log kustom Anda sendiri. Namun, jika Anda ingin berkontribusi kode kembali ke proyek OpenStack yang mencakup pernyataan logging, Anda harus mengelilingi pesan log Anda dengan garis bawah dan tanda kurung.

source: This functionality is an important piece of the puzzle when it comes to live upgrades and is conceptually similar to the existing API versioning that allows OpenStack services of different versions to communicate without issue.
de: Diese Funktionalität ist ein wichtiger Bestandteil des Puzzles bei Live-Upgrades und ähnelt konzeptionell der bestehenden API-Versionierung, die es OpenStack-Diensten verschiedener Versionen ermöglicht, problemlos zu kommunizieren.
id: Fungsionalitas ini adalah bagian penting dari teka-teki (puzzle) ketika datang ke peningkatan langsung dan secara konsep mirip dengan versi API yang ada yang memungkinkan layanan OpenStack dari berbagai versi untuk berkomunikasi tanpa masalah.

source: This guide assumes that you are familiar with a Linux distribution that supports OpenStack, SQL databases, and virtualization. You must be comfortable administering and configuring multiple Linux machines for networking. You must install and maintain an SQL database and occasionally run queries against it.
de: In diesem Handbuch wird davon ausgegangen, dass Sie mit einer Linux-Distribution vertraut sind, die OpenStack, SQL-Datenbanken und Virtualisierung unterstützt. Sie müssen mit der Verwaltung und Konfiguration mehrerer Linux-Maschinen für die Vernetzung vertraut sein. Sie müssen eine SQL-Datenbank installieren und pflegen und gelegentlich Abfragen dagegen durchführen.

source: This guide is for OpenStack operators and does not seek to be an exhaustive reference for users, but as an operator, you should have a basic understanding of how to use the cloud facilities. This chapter looks at OpenStack from a basic user perspective, which helps you understand your users' needs and determine, when you get a trouble ticket, whether it is a user issue or a service issue. The main concepts covered are images, flavors, security groups, block storage, shared file system storage, and instances.
de: Dieses Handbuch richtet sich an OpenStack-Betreiber und soll keine erschöpfende Referenz für Benutzer sein, aber als Betreiber sollten Sie über ein grundlegendes Verständnis für die Nutzung der Cloud-Einrichtungen verfügen. In diesem Kapitel wird OpenStack aus einer grundlegenden Benutzerperspektive betrachtet, die Ihnen hilft, die Bedürfnisse Ihrer Benutzer zu verstehen und festzustellen, wann Sie ein Trouble Ticket erhalten, ob es sich um ein Benutzerproblem oder ein Serviceproblem handelt. Die wichtigsten Konzepte sind Abbilder, Varianten, Sicherheitsgruppen, Blockspeicher, Shared File System Storage und Instanzen.
id: Panduan ini diperuntukkan bagi operator OpenStack dan tidak mencari referensi lengkap bagi pengguna, tetapi sebagai operator, Anda harus memiliki pemahaman dasar tentang cara menggunakan fasilitas cloud. Bab ini membahas tentang OpenStack dari perspektif pengguna dasar, yang membantu Anda memahami kebutuhan pengguna Anda dan menentukan, ketika Anda mendapatkan tiket masalah, apakah itu masalah pengguna atau masalah layanan. Konsep utama yang dicakup adalah images, flavors, security groups, block storage, shared file system storage, dan instances.

source: This guide provides information about operating OpenStack clouds.
de: Dieses Handbuch enthält Informationen zum Betrieb von OpenStack-Clouds.
id: Panduan ini memberikan informasi tentang pengoperasian cloud OpenStack.

source: This guide targets OpenStack administrators seeking to deploy and manage OpenStack Networking (neutron).
de: Dieses Handbuch richtet sich an OpenStack-Administratoren, die OpenStack Networking (Neutron) einsetzen und verwalten möchten.

source: This guide uses the term ``project``, unless an example shows interaction with a tool that uses the term ``tenant``.
de: Dieser Leitfaden verwendet den Begriff ``Projekt``, es sei denn, ein Beispiel zeigt die Interaktion mit einem Werkzeug, das den Begriff ``Mandant`` verwendet
id: Panduan ini menggunakan istilah ``project``, kecuali jika contoh menunjukkan interaksi dengan alat yang menggunakan istilah ``tenant``.

source: This instructs rsyslog to send all logs to the IP listed. In this example, the IP points to the cloud controller.
de: Dies weist rsyslog an, alle Protokolle an die aufgelistete IP zu senden. In diesem Beispiel zeigt die IP auf den Cloud-Controller.
id: Ini menginstruksikan rsyslog untuk mengirim semua log ke IP yang terdaftar. Dalam contoh ini, IP menunjuk ke pengontrol cloud.

source: This is a collection of ideas from experienced operators on common things to look at that may be the cause of slowness. It is not, however, designed to be an exhaustive list.
de: Dies ist eine Sammlung von Ideen von erfahrenen Betreibern über gemeinsame Dinge, die man sich ansehen sollte, die möglicherweise die Ursache für die Langsamkeit sind. Es handelt sich jedoch nicht um eine vollständige Liste.
id: Ini adalah kumpulan ide dari operator berpengalaman tentang hal-hal umum untuk dilihat yang mungkin menjadi penyebab kelambatan. Namun, ini tidak dirancang untuk menjadi daftar lengkap.

source: This is an example of such legal frameworks:
de: Dies ist ein Beispiel für solche rechtlichen Rahmenbedingungen:
id: Ini adalah contoh kerangka hukum tersebut:

source: This is an ongoing and hot topic in networking circles —especially with the raise of virtualization and virtual switches.
de: Dies ist ein ständiges und aktuelles Thema in Netzwerkkreisen - insbesondere mit der Zunahme von Virtualisierung und virtuellen Switches.
id: Ini adalah topik yang sedang berlangsung dan panas di lingkaran jaringan — terutama dengan peningkatan virtualisasi dan virtual switch.

source: This is the first half of the equation. To get flavor types that are guaranteed a particular ratio, you must set the ``extra_specs`` in the flavor type to the key-value pair you want to match in the aggregate. For example, if you define ``extra_specs`` ``cpu_allocation_ratio`` to "1.0", then instances of that type will run in aggregates only where the metadata key ``cpu_allocation_ratio`` is also defined as "1.0." In practice, it is better to define an additional key-value pair in the aggregate metadata to match on rather than match directly on ``cpu_allocation_ratio`` or ``core_allocation_ratio``. This allows better abstraction. For example, by defining a key ``overcommit`` and setting a value of "high," "medium," or "low," you could then tune the numeric allocation ratios in the aggregates without also needing to change all flavor types relating to them.
de: Dies ist die erste Hälfte der Gleichung. Um Flavor-Typen zu erhalten, die ein bestimmtes Verhältnis garantieren, müssen Sie die ``extra_specs`` im Flavor-Typ auf das Schlüssel-Wert-Paar setzen, das Sie im Aggregat abgleichen möchten. Wenn Sie beispielsweise ``extra_specs`` ``cpu_allocation_ratio`` zu "1.0" definieren, dann laufen Instanzen dieses Typs nur in Aggregaten, in denen der Metadatenschlüssel `cpu_allocation_ratio`` auch als "1.0" definiert ist. In der Praxis ist es besser, ein zusätzliches Schlüssel-Wert-Paar in den aggregierten Metadaten zu definieren, das auf on passt, als direkt auf ``cpu_allocation_ratio`` oder `core_allocation_ratio``. Dies ermöglicht eine bessere Abstraktion. Wenn Sie beispielsweise einen Schlüssel "overcommit" definieren und einen Wert von "high", "medium" oder "low" einstellen, können Sie dann die numerischen Allokationsverhältnisse in den Aggregaten anpassen, ohne auch alle damit verbundenen Flavor-Typen ändern zu müssen.
id: Ini adalah bagian pertama dari persamaan. Untuk mendapatkan jenis flavor yang dijamin dengan rasio tertentu, Anda harus mengatur ``extra_specs`` dalam jenis flavor ke pasangan nilai kunci yang ingin Anda cocokkan dalam agregat. Misalnya, jika Anda mendefinisikan ``extra_specs`` ``cpu_allocation_ratio`` ke "1.0", maka instance jenis itu akan berjalan dalam agregat hanya di mana kunci metadata ``cpu_allocation_ratio`` juga didefinisikan sebagai "1.0." Dalam praktiknya, lebih baik untuk menentukan pasangan nilai kunci tambahan dalam metadata agregat untuk dicocokkan daripada mencocokkan secara langsung pada ``cpu_allocation_ratio`` atau ``core_allocation_ratio``. Ini memungkinkan abstraksi yang lebih baik. Misalnya, dengan mendefinisikan kunci ``overcommit`` dan menetapkan nilai "high," "medium," atau "low," Anda kemudian dapat menyetel rasio alokasi numerik dalam agregat tanpa juga perlu mengubah semua jenis flavor yang terkait ke mereka.

source: This is useful, as logs from c02.example.com go to:
de: Dies ist nützlich, da Protokolle von c02.example.com aufgerufen werden:
id: Ini berguna, karena log dari c02.example.com masuk ke:

source: This leaves you with an important point of decision when designing your cloud. OpenStack Networking is robust enough to use with a small number of limitations (performance issues in some scenarios, only basic high availability of layer 3 systems) and provides many more features than ``nova-network``. However, if you do not have the more complex use cases that can benefit from fuller software-defined networking capabilities, or are uncomfortable with the new concepts introduced, ``nova-network`` may continue to be a viable option for the next 12 months.
de: Dies gibt Ihnen einen wichtigen Entscheidungspunkt bei der Gestaltung Ihrer Cloud. OpenStack Networking ist robust genug, um mit einer kleinen Anzahl von Einschränkungen verwendet zu werden (Performance-Probleme in einigen Szenarien, nur grundlegende Hochverfügbarkeit von Layer-3-Systemen) und bietet viel mehr Funktionen als ``Nova-Netzwerk``. Wenn Sie jedoch nicht über die komplexeren Anwendungsfälle verfügen, die von vollständigeren, softwaredefinierten Netzwerkfunktionen profitieren können, oder wenn Sie sich mit den neuen Konzepten nicht wohl fühlen, kann ``nova-network`` für die nächsten 12 Monate weiterhin eine brauchbare Option sein.
id: Ini membuat Anda memiliki titik keputusan penting saat merancang cloud Anda. OpenStack Networking cukup kuat untuk digunakan dengan sejumlah kecil pembatasan (masalah kinerja dalam beberapa skenario, hanya ketersediaan tinggi dasar layer 3 systems) dan menyediakan banyak fitur lebih banyak daripada ``nova-network``. Namun, jika Anda tidak memiliki kasus penggunaan yang lebih kompleks yang dapat mengambil manfaat dari kemampuan jaringan yang ditentukan perangkat lunak lebih lengkap, atau tidak nyaman dengan konsep-konsep baru yang diperkenalkan, ``nova-network`` dapat terus menjadi opsi yang layak untuk 12 berikutnya bulan.

source: This list will change between releases, so please refer to your configuration guide for up-to-date information.
de: Diese Liste ändert sich zwischen den Versionen, daher lesen Sie bitte in Ihrem Konfigurationsleitfaden nach, um aktuelle Informationen zu erhalten.
id: Daftar ini akan berubah di antara rilis, jadi silakan merujuk ke panduan konfigurasi Anda untuk informasi terbaru.

source: This may be a dnsmasq and/or ``nova-network`` related issue. (For the preceding example, the problem happened to be that dnsmasq did not have any more IP addresses to give away because there were no more fixed IPs available in the OpenStack Compute database.)
de: Dies kann ein dnsmasq- und/oder ``nova-network``bezogenes Problem sein. (Für das vorhergehende Beispiel bestand das Problem darin, dass dnsmasq keine weiteren IP-Adressen zum Verschenken hatte, weil in der OpenStack Compute-Datenbank keine festen IPs mehr verfügbar waren.)
id: Ini mungkin masalah dnsmasq dan/atau ``nova-network`` terkait. (Sebagai contoh sebelumnya, masalahnya adalah bahwa dnsmasq tidak memiliki alamat IP untuk diberikan karena tidak ada lagi IP tetap yang tersedia di basis data OpenStack Compute.)

source: This might print the error and cause of the problem.
de: Dies kann den Fehler und die Ursache des Problems ausgeben.
id: Ini mungkin mencetak kesalahan dan penyebab masalah.

source: This output shows that two networks are configured, each network containing 255 IPs (a /24 subnet). The first network has been assigned to a certain project, while the second network is still open for assignment. You can assign this network manually; otherwise, it is automatically assigned when a project launches its first instance.
de: Diese Ausgabe zeigt, dass zwei Netzwerke konfiguriert sind, die jeweils 255 IPs (ein /24 Subnetz) enthalten. Das erste Netzwerk wurde einem bestimmten Projekt zugeordnet, während das zweite Netzwerk noch offen ist. Sie können dieses Netzwerk manuell zuweisen, ansonsten wird es automatisch zugewiesen, wenn ein Projekt seine erste Instanz startet.
id: Output ini menunjukkan bahwa dua jaringan telah dikonfigurasi, masing-masing jaringan berisi 255 IP (a / 24 subnet). Jaringan pertama telah ditetapkan untuk proyek tertentu, sedangkan jaringan kedua masih terbuka untuk penugasan. Anda dapat menetapkan jaringan ini secara manual; jika tidak, ia secara otomatis ditetapkan ketika proyek meluncurkan instance pertamanya.

source: This past Valentine's Day, I received an alert that a compute node was no longer available in the cloud—meaning,
de: An diesem vergangenen Valentinstag erhielt ich eine Warnung, dass ein Compute-Knoten im Sinne der Cloud nicht mehr verfügbar war,
id: Hari Valentine yang lalu, saya menerima peringatan bahwa node komputasi tidak lagi tersedia di cloud — artinya,

source: This project continues to improve and you may consider using it for greenfield deployments, though according to the latest user survey results it remains to see widespread uptake.
de: Dieses Projekt verbessert sich weiter und Sie können es für den Einsatz auf der grünen Wiese in Betracht ziehen, obwohl es nach den neuesten Ergebnissen der Benutzerbefragung nach wie vor eine breite Akzeptanz findet.
id: Proyek ini terus membaik dan Anda dapat mempertimbangkan menggunakannya untuk penyebaran greenfield, meskipun menurut hasil survei pengguna terbaru, masih ada untuk melihat serapan luas.

source: This request took over two minutes to process, but executed quickly on another co-existing Grizzly deployment using the same hardware and system configuration.
de: Diese Anfrage dauerte über zwei Minuten, wurde aber schnell bei einer anderen koexistierenden Grizzly-Bereitstellung mit der gleichen Hardware- und Systemkonfiguration ausgeführt.
id: Permintaan ini membutuhkan waktu dua menit untuk diproses, tetapi dieksekusi dengan cepat pada penyebaran Grizzly yang ada bersama (co-existing) menggunakan perangkat keras dan konfigurasi sistem yang sama.
