Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: The asterisk * indicates which screen window you are viewing. This example shows we are viewing the key (for keystone) screen window:
de: Das Sternchen * zeigt an, welches Bildschirmfenster Sie gerade betrachten. Dieses Beispiel zeigt, dass wir das Key (für Keystone) Bildschirmfenster betrachten:
id: Tanda bintang * menunjukkan jendela layar yang Anda lihat. Contoh ini menunjukkan kita sedang melihat jendela key kunci (untuk keystone):

source: The bare-metal deployment has been widely lauded, and development continues. The Juno release brought the OpenStack Bare metal drive into the Compute project, and it was aimed to deprecate the existing bare-metal driver in Kilo. If you are a current user of the bare metal driver, a particular blueprint to follow is `Deprecate the bare metal driver <https://blueprints.launchpad.net/nova/+spec/deprecate-baremetal-driver>`_
de: Der Bare-Metal-Einsatz wurde allgemein gelobt, und die Entwicklung geht weiter. Die Juno-Version brachte das OpenStack Bare-Metal-Laufwerk in das Compute-Projekt ein, und es wurde versucht, den vorhandenen Bare-Metal-Treiber in Kilo zu verwerfen. Wenn Sie ein aktueller Benutzer des Bare-Metal-Treibers sind, ist ein besonderer Plan zu folgen: `Den Bare-Metal-Treiber verwerfen <https://blueprints.launchpad.net/nova/+spec/deprecate-baremetal-driver>`_
id: Penggunaan bare-metal telah dipuji secara luas, dan pengembangan terus berlanjut. Rilis Juno membawa OpenStack Bare metal drive ke proyek Compute, dan itu bertujuan untuk menurunkan (deprecate) driver bare-metal yang ada di Kilo. Jika Anda adalah pengguna saat ini dari driver bare metal, cetak biru tertentu untuk diikuti adalah `Deprecate the bare metal driver <https://blueprints.launchpad.net/nova/+spec/deprecate-baremetal-driver>`_

source: The block device mapping format is ``<dev-name>=<id>:<type>:<size(GB)>:<delete-on-terminate>``, where:
de: Das Format für die Blockgerätezuordnung lautet ``<dev-name>=<id>:<type>:<size(GB)>:<delete-on-terminate>``, wo:

source: The bonded 10gb network device (bond0) was in a DOWN state
de: Das gebundene 10gb Netzwerkgerät (bond0) befand sich in einem DOWN-Zustand
id: Perangkat jaringan 10gb terikat (bond0) dalam keadaan DOWN

source: The chances of failure for the server's hardware are high at the start and the end of its life. As a result, dealing with hardware failures while in production can be avoided by appropriate burn-in testing to attempt to trigger the early-stage failures. The general principle is to stress the hardware to its limits. Examples of burn-in tests include running a CPU or disk benchmark for several days.
de: Die Wahrscheinlichkeit eines Ausfalls der Hardware des Servers ist am Anfang und am Ende ihrer Lebensdauer hoch. Dadurch kann die Behandlung von Hardwareausfällen während der Produktion durch geeignete Burn-In-Tests vermieden werden, um zu versuchen, die Fehler im Frühstadium auszulösen. Das allgemeine Prinzip besteht darin, die Hardware an ihre Grenzen zu bringen. Beispiele für Burn-In-Tests sind das Ausführen eines CPU- oder Festplatten-Benchmarks über mehrere Tage.
id: Peluang kegagalan untuk perangkat keras server menjadi tinggi pada awal dan akhir masa pakainya. Akibatnya, berurusan dengan kegagalan perangkat keras saat dalam produksi dapat dihindari dengan pengujian burn-in yang tepat untuk mencoba memicu kegagalan tahap awal. Prinsip umum adalah menekankan perangkat keras hingga batasnya. Contoh tes burn-in termasuk menjalankan benchmark CPU atau disk selama beberapa hari.

source: The choice of central logging engine will be dependent on the operating system in use as well as any organizational requirements for logging tools.
de: Die Wahl der zentralen Protokollierungs-Engine hängt vom verwendeten Betriebssystem und den organisatorischen Anforderungen an die Protokollierungswerkzeuge ab.
id: Pilihan mesin logging pusat akan tergantung pada sistem operasi yang digunakan serta persyaratan organisasi untuk alat logging.

source: The cloud controller and storage proxy are very similar to each other when it comes to expected and unexpected downtime. One of each server type typically runs in the cloud, which makes them very noticeable when they are not running.
de: Der Cloud-Controller und der Storage-Proxy sind sich sehr ähnlich, wenn es um erwartete und unerwartete Ausfallzeiten geht. Einer von jedem Servertyp läuft typischerweise in der Cloud, was ihn sehr auffällig macht, wenn er nicht läuft.
id: Pengontrol cloud dan proksi penyimpanan sangat mirip satu sama lain dalam hal penghentian yang diharapkan dan tidak terduga. Salah satu dari setiap jenis server biasanya berjalan di cloud, yang membuat mereka sangat terlihat ketika mereka tidak berjalan.

source: The cloud controller could completely fail if, for example, its motherboard goes bad. Users will immediately notice the loss of a cloud controller since it provides core functionality to your cloud environment. If your infrastructure monitoring does not alert you that your cloud controller has failed, your users definitely will. Unfortunately, this is a rough situation. The cloud controller is an integral part of your cloud. If you have only one controller, you will have many missing services if it goes down.
de: Der Cloud-Controller kann komplett ausfallen, wenn z.B. sein Motherboard kaputt geht. Benutzer werden sofort den Verlust eines Cloud Controllers bemerken, da er die Kernfunktionalität Ihrer Cloud-Umgebung bereitstellt. Wenn Ihre Infrastrukturüberwachung Sie nicht darüber informiert, dass Ihr Cloud-Controller ausgefallen ist, werden es Ihre Benutzer definitiv tun. Leider ist dies eine schwierige Situation. Der Cloud-Controller ist ein integraler Bestandteil Ihrer Cloud. Wenn Sie nur einen Controller haben, werden Sie viele fehlende Dienste haben, wenn er ausfällt.
id: Pengontrol cloud bisa gagal total, misalnya, motherboard-nya rusak. Pengguna akan segera melihat hilangnya pengontrol cloud karena menyediakan fungsionalitas inti ke lingkungan cloud Anda. Jika pemantauan infrastruktur Anda tidak memberi tahu Anda bahwa pengendali cloud Anda telah gagal, pengguna Anda pasti akan melakukannya. Sayangnya, ini adalah situasi yang sulit. Pengontrol cloud adalah bagian integral dari cloud Anda. Jika Anda hanya memiliki satu pengontrol, Anda akan memiliki banyak layanan yang hilang jika turun.

source: The cloud controller receives the ``255.255.255.255`` request and sends a third response.
de: Der Cloud-Controller empfängt die Anforderung ``255.255.255.255`` und sendet eine dritte Antwort.
id: Pengontrol cloud menerima permintaan `` 255.255.255.255`` dan mengirimkan respons ketiga.

source: The code for OpenStack lives in ``/opt/stack``, so go to the ``nova`` directory and edit your scheduler module. Change to the directory where ``nova`` is installed:
de: Der Code für OpenStack befindet sich in ``/opt/stack``, also gehen Sie in das Verzeichnis ``nova`` und bearbeiten Sie Ihr Scheduler-Modul. Wechseln Sie in das Verzeichnis, in dem ``nova`` installiert ist:
id: Kode untuk OpenStack hidup di ``/opt/stack``, jadi buka direktori ``nova`` dan edit modul penjadwal Anda. Ubah ke direktori tempat ``nova`` diinstal:

source: The code is similar to the above example of :command:`openstack security group rule create`. To use RemoteGroup, specify ``--remote-group`` instead of ``--remote-ip``. For example:
de: Der Code ähnelt dem obigen Beispiel von :command:`openstack security group rule create`. Um RemoteGroup zu verwenden, geben Sie ``--remote-group`` anstelle von ``--remote-ip`` an. Zum Beispiel:
id: Kode ini mirip dengan contoh di atas dari :command: `openstack security group rule create`. Untuk menggunakan RemoteGroup, tentukan ``--remote-group`` daripada ``--remote-ip``. Sebagai contoh:

source: The code shown below is a driver that will schedule servers to hosts based on IP address as explained at the beginning of the section. Copy the code into ``ip_scheduler.py``. When you are done, save and close the file.
de: Der untenstehende Code ist ein Treiber, der Server auf Hosts basierend auf der IP-Adresse plant, wie am Anfang des Abschnitts beschrieben. Kopieren Sie den Code in die ``ip_scheduler.py``. Wenn Sie fertig sind, speichern und schließen Sie die Datei.
id: Kode yang ditunjukkan di bawah ini adalah driver yang akan menjadwalkan server ke host berdasarkan alamat IP seperti yang dijelaskan di awal bagian. Salin kode ke ``ip_scheduler.py``. Setelah selesai, simpan dan tutup file.

source: The command output lists the currently installed version of the package, newest candidate version, and all versions along with the repository that contains each version. Look for the appropriate release version— ``2:14.0.1-0ubuntu1~cloud0`` in this case. The process of manually picking through this list of packages is rather tedious and prone to errors. You should consider using a script to help with this process. For example:
de: Die Befehlsausgabe listet die aktuell installierte Version des Pakets, die neueste Kandidatenversion und alle Versionen zusammen mit dem Repository, das jede Version enthält. Suchen Sie in diesem Fall nach der passenden Release-Version - ``2:14.0.1-0ubuntu1~cloud0``. Der Prozess der manuellen Kommissionierung durch diese Liste von Paketen ist ziemlich mühsam und fehleranfällig. Sie sollten in Betracht ziehen, ein Skript zu verwenden, um bei diesem Prozess zu helfen. Zum Beispiel:
id: Output perintah mencantumkan versi paket yang saat ini diinstal, versi kandidat terbaru, dan semua versi beserta repositori yang berisi setiap versi. Cari versi rilis yang sesuai— ``2:14.0.1-0ubuntu1~cloud0`` dalam kasus ini. Proses memilih secara manual daftar paket ini agak membosankan dan rentan terhadap kesalahan. Anda harus mempertimbangkan untuk menggunakan skrip untuk membantu proses ini. Sebagai contoh:

source: The command-line tools can be made to show the OpenStack API calls they make by passing the ``--debug`` flag to them. For example:
de: Die Befehlszeilen-Tools können so konfiguriert werden, dass sie die OpenStack-API-Aufrufe anzeigen, die sie ausführen, indem sie ihnen das Flag ``--debug`` übergeben. Zum Beispiel:
id: Alat-alat command-line dapat dibuat untuk menunjukkan panggilan OpenStack API yang mereka buat dengan mengirimkan flag ``--debug`` kepada mereka. Sebagai contoh:

source: The connection strings take this format:
de: Die Verbindungszeichenketten haben dieses Format:
id: String koneksi menggunakan format ini:

source: The currently implemented hypervisors are listed on the `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/compute/hypervisors.html>`__. You can see a matrix of the various features in OpenStack Compute (nova) hypervisor drivers at the `Hypervisor support matrix page <https://docs.openstack.org/nova/latest/user/support-matrix.html>`_.
de: Die aktuell implementierten Hypervisoren sind in der `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/compute/hypervisors.html>`__ aufgelistet. Eine Matrix der verschiedenen Features in den OpenStack Compute (nova) Hypervisor-Treibern finden Sie auf der `Hypervisor Supportmatrix-Seite <https://docs.openstack.org/nova/latest/user/support-matrix.html>`_.
id: Hypervisor yang saat ini diterapkan tercantum pada `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/compute/hypervisors.html>` __. Anda dapat melihat matriks berbagai fitur di driver hypervisor OpenStack Compute (nova) di `Hypervisor support matrix page <https://docs.openstack.org/nova/latest/user/support-matrix.html>`_.

source: The dangerous possibility comes with the ability to change member roles. This is the dropdown list below the username in the :guilabel:`Project Members` list. In virtually all cases, this value should be set to :guilabel:`Member`. This example purposefully shows an administrative user where this value is ``admin``.
de: Die gefährliche Möglichkeit besteht in der Fähigkeit, die Rollen der Mitglieder zu wechseln. Dies ist die Dropdown-Liste unter dem Benutzernamen in der Liste :guilabel:`Projektmitglieder`. In praktisch allen Fällen sollte dieser Wert auf :guilabel:`Member` gesetzt werden. Dieses Beispiel zeigt gezielt einen administrativen Benutzer, bei dem dieser Wert ``admin``` ist.

source: The dashboard interface for snapshots can be confusing because the snapshots and images are displayed in the :guilabel:`Images` page. However, an instance snapshot *is* an image. The only difference between an image that you upload directly to the Image Service and an image that you create by snapshot is that an image created by snapshot has additional properties in the glance database. These properties are found in the ``image_properties`` table and include:
de: Die Dashboard-Schnittstelle für Schattenkopien kann verwirrend sein, da die Schattenkopien und Abbilder auf der Seite :guilabel:`Images` angezeigt werden. Ein Instanz-Schattenkopie ist jedoch *ein* Abbild. Der einzige Unterschied zwischen einem Abbild, das Sie direkt in den Abbilddienst hochladen, und einem Abbild, das Sie per Schattenkopie erstellen, besteht darin, dass ein mit Schattenkopie erstelltes Abbild zusätzliche Eigenschaften in der glance-Datenbank hat. Diese Eigenschaften finden Sie in der Tabelle `Abbild_Eigenschaften`` und beinhalten:

source: The dashboard is based on the Python `Django <https://www.djangoproject.com/>`_ web application framework. To know how to build your Dashboard, see `Building a Dashboard using Horizon <https://docs.openstack.org/horizon/latest/>`_.
de: Das Dashboard basiert auf dem Python `Django <https://www.djangoproject.com/>`_ Web Application Framework. Um zu erfahren, wie Sie Ihr Dashboard erstellen können, siehe `Erstellen eines Dashboards mit Horizon <https://docs.openstack.org/horizon/latest/>`_.
id: Dasbor didasarkan pada Python `Django <https://www.djangoproject.com/>`_ kerangka kerja aplikasi web. Untuk mengetahui cara membangun Dasbor Anda, lihat `Building a Dashboard using Horizon <https://docs.openstack.org/horizon/latest/>`_.

source: The data security domain is primarily concerned with information pertaining to the storage services within OpenStack. The data that crosses this network has high integrity and confidentiality requirements and, depending on the type of deployment, may also have strong availability requirements. The trust level of this network is heavily dependent on other deployment decisions.
de: Die Datensicherheitsdomäne befasst sich in erster Linie mit Informationen über die Speicherdienste innerhalb von OpenStack. Die Daten, die dieses Netzwerk durchqueren, haben hohe Integritäts- und Vertraulichkeitsanforderungen und können je nach Art der Bereitstellung auch hohe Verfügbarkeitsanforderungen haben. Das Vertrauensniveau dieses Netzwerks ist stark von anderen Bereitstellungsentscheidungen abhängig.
id: Domain keamanan data terutama berkaitan dengan informasi yang berkaitan dengan layanan penyimpanan dalam OpenStack. Data yang melintasi jaringan ini memiliki persyaratan integritas dan kerahasiaan yang tinggi dan, tergantung pada jenis penyebaran, mungkin juga memiliki persyaratan ketersediaan yang kuat. Tingkat kepercayaan jaringan ini sangat tergantung pada keputusan penempatan lainnya.

source: The decisions you make with respect to provisioning and deployment will affect your maintenance of the cloud. Your configuration management will be able to evolve over time. However, more thought and design need to be done for upfront choices about deployment, disk partitioning, and network configuration.
de: Die Entscheidungen, die Sie in Bezug auf Provisionierung und Bereitstellung treffen, wirken sich auf Ihre Wartung der Cloud aus. Ihr Konfigurationsmanagement wird sich im Laufe der Zeit weiterentwickeln können. Allerdings müssen mehr Überlegungen und Entwürfe angestellt werden, um im Vorfeld Entscheidungen über die Bereitstellung, Festplattenpartitionierung und Netzwerkkonfiguration treffen zu können.
id: Keputusan yang Anda buat sehubungan dengan penyediaan dan penyebaran akan memengaruhi pemeliharaan cloud Anda. Manajemen konfigurasi Anda akan dapat berkembang seiring waktu. Namun, lebih banyak pemikiran dan desain perlu dilakukan untuk pilihan awal tentang penyebaran, partisi disk, dan konfigurasi jaringan.

source: The default :term:`authorization` settings allow administrative users only to create resources on behalf of a different project. OpenStack handles two kinds of authorization policies:
de: Die Standardeinstellungen von :term:`authorization` erlauben es administrativen Benutzern, nur Ressourcen im Namen eines anderen Projekts zu erstellen. OpenStack verwaltet zwei Arten von Autorisierungsrichtlinien:

source: The default Keystone configuration assumes that Keystone is in the local host, and it uses ``http://localhost:5000/v3`` as the endpoint URL, which is specified in ``glance-api.conf`` and ``nova-api.conf`` files:
de: Die Standardkonfiguration von Keystone geht davon aus, dass sich Keystone im lokalen Host befindet, und verwendet ``http://localhost:5000/v3`` als Endpunkt-URL, die in den Dateien ``glance-api.conf`` und ``nova-api.conf`` angegeben ist:
id: Konfigurasi Keystone default mengasumsikan Keystone ada di host lokal, dan menggunakan ``http://localhost:5000/v3`` sebagai URL endpoint, yang ditentukan dalam ``glance-api.conf`` dan ``file nova-api.conf``:

source: The default OpenStack flavors are shown in :ref:`table_default_flavors`.
de: Die standardmäßigen OpenStack-Varianten werden in :ref:`table_default_flavors` angezeigt.
id: Flavor OpenStack default ditampilkan di :ref: `table_default_flavours`.

source: The definition of what constitutes a site in the relevant licenses, as the term does not necessarily denote a geographic or otherwise physically isolated location.
de: Die Definition dessen, was einen Standort in den entsprechenden Lizenzen ausmacht, da der Begriff nicht unbedingt einen geografischen oder anderweitig physisch isolierten Standort bezeichnet.
id: Definisi dari apa yang merupakan situs dalam lisensi yang relevan, karena istilah tersebut tidak selalu menunjukkan lokasi geografis atau lokasi yang terisolasi secara fisik.

source: The direction in which the security group rule is applied. Valid values are ``ingress`` or ``egress``.
de: Die Richtung, in der die Sicherheitsgruppenregel angewendet wird. Gültige Werte sind ``ingress`` oder ``egress``.
id: Arah penerapan aturan grup keamanan. Nilai yang valid adalah ``ingress`` atau ``egress``.

source: The environment is largely based on Scientific Linux 6, which is Red Hat compatible. We use KVM as our primary hypervisor, although tests are ongoing with Hyper-V on Windows Server 2008.
de: Die Umgebung basiert weitgehend auf Scientific Linux 6, das Red Hat-kompatibel ist. Wir verwenden KVM als unseren primären Hypervisor, obwohl die Tests mit Hyper-V auf Windows Server 2008 laufen.
id: Lingkungan sebagian besar didasarkan pada Scientific Linux 6, yang kompatibel dengan Red Hat. Kami menggunakan KVM sebagai hypervisor utama kami, meskipun tes sedang berlangsung dengan Hyper-V pada Windows Server 2008.

source: The example OpenStack architecture designates the cloud controller as the MySQL server. This MySQL server hosts the databases for nova, glance, cinder, and keystone. With all of these databases in one place, it's very easy to create a database backup:
de: Die exemplarische OpenStack-Architektur bezeichnet den Cloud-Controller als MySQL-Server. Dieser MySQL-Server hostet die Datenbanken für nova, glance, cinder und keystone. Mit all diesen Datenbanken an einem Ort ist es sehr einfach, ein Datenbank-Backup zu erstellen:
id: Contoh arsitektur OpenStack menunjuk pengontrol cloud sebagai server MySQL. Server MySQL ini meng-host basis data untuk nova, glance, cinder, dan keystone. Dengan semua basis data ini di satu tempat, sangat mudah untuk membuat cadangan basis data:

source: The existence of the ``*-manage`` tools is a legacy issue. It is a goal of the OpenStack project to eventually migrate all of the remaining functionality in the ``*-manage`` tools into the API-based tools. Until that day, you need to SSH into the :term:`cloud controller node` to perform some maintenance operations that require one of the ``*-manage`` tools.
de: Die Existenz der ``*-manage`` Werkzeuge ist ein altes Problem. Ziel des OpenStack-Projekts ist es, schließlich alle verbleibenden Funktionen der ``*-manage`` Werkzeuge in die API-basierten Werkzeuge zu migrieren. Bis zu diesem Tag müssen Sie SSH in den :term:`Cloud Controller Node` einbinden, um einige Wartungsarbeiten durchzuführen, die eines der ``*-manage`` Tools erfordern.
id: Keberadaan alat `` * -manage`` adalah masalah warisan. Merupakan tujuan dari proyek OpenStack untuk akhirnya memigrasi semua fungsionalitas yang tersisa di alat `` * -manage`` ke alat berbasis API. Sampai hari itu, Anda perlu SSH ke :term: `cloud controller node` untuk melakukan beberapa operasi pemeliharaan yang memerlukan salah satu alat ``* -manage``.

source: The file system does not have any "dirty" buffers: where programs have issued the command to write to disk, but the operating system has not yet done the write
de: Das Dateisystem hat keine "schmutzigen" Puffer: wo Programme den Befehl zum Schreiben auf die Festplatte gegeben haben, das Betriebssystem aber noch nicht das Schreiben durchgeführt hat

source: The first column of this form, named :guilabel:`All Users`, includes a list of all the users in your cloud who are not already associated with this project. The second column shows all the users who are. These lists can be quite long, but they can be limited by typing a substring of the username you are looking for in the filter field at the top of the column.
de: Die erste Spalte dieses Formulars mit dem Namen :guilabel:`Alle Benutzer` enthält eine Liste aller Benutzer in Ihrer Cloud, die nicht bereits mit diesem Projekt verbunden sind. Die zweite Spalte zeigt alle Benutzer, die es sind. Diese Listen können recht lang sein, aber sie können eingeschränkt werden, indem Sie eine Teilzeichenfolge des gesuchten Benutzernamens in das Filterfeld oben in der Spalte eingeben.

source: The first is the ``_base`` directory. This contains all the cached base images from glance for each unique image that has been launched on that compute node. Files ending in ``_20`` (or a different number) are the ephemeral base images.
de: Das erste ist das Verzeichnis ``_base``. Dies enthält alle zwischengespeicherten Basisabbilder von Glance für jedes einzelne Abbild, das auf diesem Compute-Knoten gestartet wurde. Dateien mit der Endung ``_20`` (oder einer anderen Nummer) sind die ephemeren Basisabbilder.
id: Yang pertama adalah direktori ``_base``. Ini berisi semua image dasar yang di-cache dari glance untuk setiap image unik yang telah diluncurkan pada node komputasi itu. File yang diakhiri dengan ``_20`` (atau nomor yang berbeda) adalah image dasar fana.

source: The first place to look is the log file related to the command you are trying to run. For example, if ``openstack server list`` is failing, try tailing a nova log file and running the command again:
de: Der erste Ort, an dem Sie suchen müssen, ist die Protokolldatei, die sich auf den Befehl bezieht, den Sie ausführen möchten. Wenn beispielsweise die ``openstack server list`` fehlschlägt, versuchen Sie, eine nova-Protokolldatei zu beschneiden und den Befehl erneut auszuführen:
id: Tempat pertama yang harus dilihat adalah file log yang terkait dengan perintah yang Anda coba jalankan. Sebagai contoh, jika ``openstack server list`` gagal, coba tailing file log nova dan jalankan perintah lagi:
