Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: You must have the appropriate credentials if you want to use the command-line tools to make queries against your OpenStack cloud. By far, the easiest way to obtain :term:`authentication` credentials to use with command-line clients is to use the OpenStack dashboard. Select :guilabel:`Project`, click the :guilabel:`Project` tab, and click :guilabel:`Access & Security` on the :guilabel:`Compute` category. On the :guilabel:`Access & Security` page, click the :guilabel:`API Access` tab to display two buttons, :guilabel:`Download OpenStack RC File` and :guilabel:`Download EC2 Credentials`, which let you generate files that you can source in your shell to populate the environment variables the command-line tools require to know where your service endpoints and your authentication information are. The user you logged in to the dashboard dictates the filename for the openrc file, such as ``demo-openrc.sh``. When logged in as admin, the file is named ``admin-openrc.sh``.
de: Sie müssen über die entsprechenden Anmeldeinformationen verfügen, wenn Sie die Befehlszeilentools verwenden möchten, um Abfragen gegen Ihre OpenStack-Cloud durchzuführen. Der bei weitem einfachste Weg, um :term:`Authentifizierung`-Anmeldeinformationen für die Verwendung mit Befehlszeilen-Clients zu erhalten, ist die Verwendung des OpenStack-Dashboards. Wählen Sie :guilabel:`Projekt`, klicken Sie auf die Registerkarte :guilabel:`Projekt` und klicken Sie auf :guilabel:`Access & Security` in der Kategorie :guilabel:`Compute`. Klicken Sie auf der Seite :guilabel:`Access & Security` auf die Registerkarte :guilabel:`API Access`, um zwei Schaltflächen anzuzeigen, :guilabel:`Download OpenStack RC File` und :guilabel:`Download EC2 Credentials`, mit denen Sie Dateien erzeugen können, die Sie in Ihrer Shell erzeugen können, um die Umgebungsvariablen zu füllen, die die Kommandozeilen-Tools benötigen, um zu wissen, wo sich Ihre Serviceendpunkte und Ihre Authentifizierungsinformationen befinden. Der Benutzer, den Sie im Dashboard angemeldet haben, gibt den Dateinamen für die openrc-Datei an, z.B. ``demo-openrc.sh``. Wenn Sie als Administrator angemeldet sind, heißt die Datei ``admin-openrc.sh``.
id: Anda harus memiliki kredensial yang sesuai jika Anda ingin menggunakan alat command-line untuk membuat kueri terhadap OpenStack cloud Anda. Sejauh ini, cara termudah untuk mendapatkan kredensial :term:`authentication` untuk digunakan dengan klien command-line adalah dengan menggunakan dasbor OpenStack. Pilih :guilabel:`Project`, klik tab :guilabel:`Project`, dan klik :guilabel:`Access & Security` pada kategory :guilabel:`Compute`. Pada halaman :guilabel:`Access & Security`, klik tab :guilabel:`API Access` untuk menampilkan dua tombol, :guilabel:`Download OpenStack RC File` dan :guilabel:`Download EC2 Credentials`, yang memungkinkan Anda menghasilkan file yang Anda dapat sumber dalam shell Anda untuk mengisi variabel lingkungan alat command-line perlu tahu di mana endpoint layanan Anda dan informasi otentikasi Anda. Pengguna yang Anda masuk ke dasbor menentukan nama file untuk file openrc, seperti ``demo-openrc.sh``. Saat masuk sebagai admin, file tersebut dinamai ``admin-openrc.sh``.

source: You must have the matching private key to access instances associated with this key.
de: Sie müssen den passenden privaten Schlüssel haben, um auf die diesem Schlüssel zugeordneten Instanzen zugreifen zu können.

source: You must remove the image after each test. Even better, test whether you can successfully delete an image from the Image service.
de: Sie müssen das Abbild nach jedem Test entfernen. Noch besser ist es, zu testen, ob Sie ein Abbild erfolgreich aus dem Abbilddienst löschen können.
id: Anda harus menghapus image setelah setiap tes. Lebih baik lagi, uji apakah Anda berhasil menghapus image dari layanan Image.

source: You now need to act in the target project scope.
de: Sie müssen nun im Ziel-Projektumfang handeln.
id: Anda sekarang harus bertindak dalam lingkup proyek target.

source: You should be doing sanity checks on the interfaces using command such as :command:`ip a` and :command:`brctl show` to ensure that the interfaces are actually up and configured the way that you think that they are.
de: Sie sollten Verträglichkeitsprüfungen an den Schnittstellen mit Befehlen wie :command:`ip a` und :command:`brctl show` durchführen, um sicherzustellen, dass die Schnittstellen tatsächlich hochgefahren sind und so konfiguriert sind, wie Sie es denken.
id: Anda harus melakukan pemeriksaan kewarasan pada antarmuka menggunakan perintah seperti :command:`ip a` dan :command:`brctl show` untuk memastikan bahwa antarmuka benar-benar siap (up) dan mengkonfigurasi cara Anda berpikir bahwa mereka.

source: You should load balance user-facing services such as dashboard, ``nova-api``, or the Object Storage proxy. Use any standard HTTP load-balancing method (DNS round robin, hardware load balancer, or software such as Pound or HAProxy). One caveat with dashboard is the VNC proxy, which uses the WebSocket protocol— something that an L7 load balancer might struggle with. See also `Horizon session storage <https://docs.openstack.org/horizon/latest/admin/sessions.html>`_.
de: Sie sollten benutzerorientierte Dienste wie Dashboard, ``nova-api`` oder den Object Storage-Proxy laden. Verwenden Sie eine beliebige Standardmethode des HTTP-Lastausgleichs (DNS Round Robin, Hardware Load Balancer oder Software wie Pound oder HAProxy). Ein Vorbehalt mit Dashboard ist der VNC-Proxy, der das WebSocket-Protokoll verwendet - etwas, womit ein L7-Lastausgleich kämpfen könnte. Siehe auch `Horizon Session Storage <https://docs.openstack.org/horizon/latest/admin/sessions.html>`_.
id: Anda harus memuat keseimbangan layanan yang menghadap pengguna seperti dasbor, ``nova-api``, atau proksi Object Storage. Gunakan metode penyeimbangan beban HTTP standar (round robin DNS, penyeimbang beban perangkat keras, atau perangkat lunak seperti Pound atau HAProxy). Satu peringatan dengan dashboard adalah proksi VNC, yang menggunakan protokol WebSocket — sesuatu yang mungkin dihadapi oleh penyeimbang beban L7. Lihat juga `Horizon session storage <https://docs.openstack.org/horizon/latest/admin/sessions.html>`_.

source: You should see a message about ``/dev/sdb``.
de: Sie sollten eine Meldung über ``/dev/sdb`` sehen.
id: Anda harus melihat pesan tentang ``/dev/sdb``.

source: You should see a result similar to the following:
de: Sie sollten ein ähnliches Ergebnis wie das folgende sehen:
id: Anda akan melihat hasil yang serupa dengan yang berikut:

source: You should verify that you have the requisite backups to restore. Rolling back upgrades is a tricky process because distributions tend to put much more effort into testing upgrades than downgrades. Broken downgrades take significantly more effort to troubleshoot and, resolve than broken upgrades. Only you can weigh the risks of trying to push a failed upgrade forward versus rolling it back. Generally, consider rolling back as the very last option.
de: Sie sollten sicherstellen, dass Sie über die erforderlichen Sicherungen verfügen, um diese wiederherzustellen. Das Zurücksetzen von Upgrades ist ein kniffliger Prozess, da Distributionen dazu neigen, viel mehr Aufwand in das Testen von Upgrades zu stecken als Downgrades. Zerrüttete Downgrades erfordern deutlich mehr Aufwand bei der Fehlersuche und -behebung als defekte Upgrades. Nur Sie können die Risiken, ein fehlgeschlagenes Upgrade voranzutreiben, gegen ein Zurückrollen abwägen. Im Allgemeinen sollten Sie das Zurücksetzen als allerletzte Option in Betracht ziehen.
id: Anda harus memverifikasi bahwa Anda memiliki backup yang diperlukan untuk restore. Rolling back upgrade adalah proses yang sulit karena distribusi cenderung berupaya lebih banyak untuk menguji upgrade daripada downgrade versi. Downgrade rusak membutuhkan upaya lebih besar untuk memecahkan masalah dan, menyelesaikan daripada upgrade yang rusak. Hanya Anda yang dapat mempertimbangkan risiko mencoba mendorong upgrade yang gagal ke depan dibandingkan mengembalikannya. Secara umum, pertimbangkan rolling back sebagai opsi terakhir.

source: You want to keep an eye on the areas improving within OpenStack. The best way to "watch" roadmaps for each project is to look at the blueprints that are being approved for work on milestone releases. You can also learn from PTL webinars that follow the OpenStack summits twice a year.
de: Sie möchten ein Auge auf die Bereiche werfen, die sich in OpenStack verbessern. Der beste Weg, Roadmaps für jedes Projekt zu "sehen", besteht darin, sich die Blueprints anzusehen, die für die Arbeit an Meilenstein-Releases genehmigt werden. Sie können auch von PTL-Webinaren lernen, die zweimal im Jahr die OpenStack-Summites verfolgen.
id: Anda ingin mengawasi area yang meningkat dalam OpenStack. Cara terbaik untuk "watch" peta jalan untuk setiap proyek adalah dengan melihat cetak biru yang disetujui untuk bekerja pada rilis tonggak. Anda juga dapat belajar dari webinar PTL yang mengikuti KTT OpenStack dua kali setahun.

source: You will not see the shared image yet. Therefore the sharing needs to be accepted.
de: Sie werden das freigegebene Abbild noch nicht sehen. Deshalb muss das Teilen akzeptiert werden.
id: Anda belum akan melihat image yang dibagikan. Karena itu pembagian itu harus diterima.

source: Your credentials are a combination of username, password, and tenant (project). You can extract these values from the ``openrc.sh`` discussed above. The token allows you to interact with your other service endpoints without needing to reauthenticate for every request. Tokens are typically good for 24 hours, and when the token expires, you are alerted with a 401 (Unauthorized) response and you can request another token.
de: Ihre Zugangsdaten sind eine Kombination aus Benutzername, Passwort und Mandant (Projekt). Sie können diese Werte aus der oben beschriebenen ``openrc.sh`` extrahieren. Das Token ermöglicht es Ihnen, mit Ihren anderen Service-Endpunkten zu interagieren, ohne dass Sie sich für jede Anfrage neu authentifizieren müssen. Token sind in der Regel 24 Stunden lang gültig, und wenn das Token abläuft, werden Sie mit einer 401 (unbefugten) Antwort benachrichtigt und Sie können ein anderes Token anfordern.
id: Kredensial Anda adalah kombinasi nama pengguna, kata sandi, dan penyewa (proyek). Anda dapat mengekstraksi nilai-nilai ini dari ``openrc.sh`` yang dibahas di atas. Token memungkinkan Anda untuk berinteraksi dengan endpoint layanan Anda yang lain tanpa perlu mengautentikasi ulang untuk setiap permintaan. Token biasanya baik selama 24 jam, dan ketika token berakhir, Anda diberitahu dengan respons 401 (Unauthorized) dan Anda dapat meminta token lainnya.

source: `A breakdown of current features under development, with their target milestone <https://status.openstack.org/release/>`_
de: `Eine Aufschlüsselung der aktuellen Features in der Entwicklung mit ihrem Ziel-Meilenstein <https://status.openstack.org/release/>`_

source: `A list of all features, including those not yet under development <https://blueprints.launchpad.net/openstack>`_
de: `Eine Liste aller Funktionen, auch derjenigen, die sich noch nicht in der Entwicklung befinden <https://blueprints.launchpad.net/openstack>`_

source: `A tcpdump Tutorial and Primer <https://danielmiessler.com/study/tcpdump/>`_
de: `Ein tcpdump Tutorial und Primer <https://danielmiessler.com/study/tcpdump/>`_

source: `Block Storage service (cinder) upgrades <https://docs.openstack.org/cinder/latest/upgrade.html>`_
de: `Blockspeicherdienst (cinder) Upgrades <https://docs.openstack.org/cinder/latest/upgrade.html>`_

source: `Dive Into Python (Apress) <http://www.diveintopython.net/>`_
de: `Tauchen Sie ein in Python (Apress) <http://www.diveintopython.net/>`_

source: `Don <https://github.com/openstack/python-don>`_ is another convenient network analysis and diagnostic system that provides a completely automated service for verifying and diagnosing the networking functionality provided by OVS.
de: `Don <https://github.com/openstack/python-don>`_ ist ein weiteres komfortables Netzwerkanalyse- und Diagnosesystem, das einen vollständig automatisierten Service zur Überprüfung und Diagnose der von OVS bereitgestellten Netzwerkfunktionalität bietet.
id: `Don <https://github.com/openstack/python-don>`_ adalah analisis jaringan dan sistem diagnostik yang nyaman yang menyediakan layanan yang sepenuhnya otomatis untuk memverifikasi dan mendiagnosis fungsionalitas jaringan yang disediakan oleh OVS.

source: `Identity service (keystone) upgrades <https://docs.openstack.org/keystone/latest/admin/upgrading.html>`_
de: `Aktualisierungen des Identitätsdienstes (Keystone) <https://docs.openstack.org/keystone/latest/admin/upgrading.html>`_

source: `Image service (glance) database upgrades <https://docs.openstack.org/glance/latest/admin/db.html>`_
de: `Abbilddienst (glance) Datenbank-Upgrades <https://docs.openstack.org/glance/latest/admin/db.html>`_

source: `List of OpenStack releases and release notes <https://releases.openstack.org/>`_
de: `Liste der OpenStack-Versionen und Versionshinweise <https://releases.openstack.org/>`_

source: `List of individual code changes under review <https://review.openstack.org/>`_
de: `Liste der einzelnen Code-Änderungen im Review <https://review.openstack.org/>`_

source: `Networking service (neutron) upgrades <https://docs.openstack.org/neutron/latest/contributor/internals/upgrade.html>`_
de: `Aktualisierungen des Netzwerkdienstes (Neutron) <https://docs.openstack.org/neutron/latest/contributor/internals/upgrade.html>`_

source: `OpenStack API Guide <https://docs.openstack.org/api-quick-start/>`_
de: `OpenStack API Leitfaden <https://docs.openstack.org/api-quick-start/>`_

source: `OpenStack Cloud Computing Cookbook <https://openstackcookbook.com/>`_
de: `OpenStack Cloud Computing Kochbuch <https://openstackcookbook.com/>`_

source: `OpenStack Compute Cells <https://docs.openstack.org/nova/latest/user/cells.html>`_ are designed to allow running the cloud in a distributed fashion without having to use more complicated technologies, or be invasive to existing nova installations. Hosts in a cloud are partitioned into groups called *Cells*. Cells are configured in a tree. The top-level Cell ("API cell") has a host that runs the ``nova-api`` service, but no ``nova-compute`` services. The ``nova-compute`` runs in a child Cell. Each Cell has its own message queue and database service.
de: `OpenStack Compute-Zellen <https://docs.openstack.org/nova/latest/user/cells.html>`_ sind so konzipiert, dass sie den verteilten Betrieb der Cloud ermöglichen, ohne kompliziertere Technologien einsetzen zu müssen oder in bestehende nova-Installationen einzugreifen. Hosts in einer Cloud werden in Gruppen unterteilt, die *Zellen* genannt werden. Die Zellen werden in einem Baum konfiguriert. Die oberste Zelle ("API-Zelle") hat einen Host, der den Dienst ``nova-api`` ausführt, aber keine ``nova-compute`` Dienste. Der ``nova-compute`` Service läuft in den Kinder Zellen. Jede Zelle hat ihre eigene Message Queue und Datenbank Service.

source: `OpenStack End User Guide <https://docs.openstack.org/user-guide/>`_
de: `OpenStack Endbenutzerhandbuch <https://docs.openstack.org/user-guide/>`_

source: `OpenStack High Availability Guide <https://docs.openstack.org/ha-guide/index.html>`_
de: `OpenStack Hochverfügbarkeitsleitfaden <https://docs.openstack.org/ha-guide/index.html>`_

source: `OpenStack Installation Tutorial for Red Hat Enterprise Linux and CentOS <https://docs.openstack.org/ocata/install-guide-rdo/>`_
de: `OpenStack Installations-Tutorial für Red Hat Enterprise Linux und CentOS <https://docs.openstack.org/ocata/install-guide-rdo/>`_

source: `OpenStack Installation Tutorial for Ubuntu Server <https://docs.openstack.org/ocata/install-guide-ubuntu/>`_
de: `OpenStack Installations-Tutorial für Ubuntu Server <https://docs.openstack.org/ocata/install-guide-ubuntu/>`_

source: `OpenStack Installation Tutorial for openSUSE and SUSE Linux Enterprise Server <https://docs.openstack.org/ocata/install-guide-obs/>`_
de: `Tutorial zur OpenStack-Installation für openSUSE und SUSE Linux Enterprise Server <https://docs.openstack.org/ocata/install-guide-obs/>`_

source: `OpenStack Security Guide <https://docs.openstack.org/security-guide/>`_
de: `OpenStack Sicherheitsleitfaden <https://docs.openstack.org/security-guide/>`_

source: `OpenStack in Production: A tale of 3 OpenStack Clouds <https://openstack-in-production.blogspot.de/2013/09/a-tale-of-3-openstack-clouds-50000.html>`_
de: `OpenStack in der Produktion: Eine Geschichte von 3 OpenStack Clouds <https://openstack-in-production.blogspot.de/2013/09/a-tale-of-3-openstack-clouds-50000.html>`_

source: `Orchestration service (heat) upgrades <https://docs.openstack.org/heat/latest/operating_guides/upgrades_guide.html>`_
de: `Aktualisierung des Orchestrierungs-Dienst (Heat) <https://docs.openstack.org/heat/latest/operating_guides/upgrades_guide.html>`_

source: `Pro Puppet (Apress) <https://www.apress.com/9781430230571>`_
de: `Pro Puppe (Apress) <https://www.apress.com/9781430230571>`_

source: `Problem with Heavy Network IO and Dnsmasq <https://www.gossamer-threads.com/lists/openstack/operators/18197>`_.
de: `Problem mit Heavy Network IO und Dnsmasq <https://www.gossamer-threads.com/lists/openstack/operators/18197>`_.

source: `Puppet Labs Documentation <https://docs.puppet.com/>`_
de: `Puppet Labs Dokumentation <https://docs.puppet.com/>`_

source: `Review of CERN Data Centre Infrastructure <http://cds.cern.ch/record/1457989/files/chep%202012%20CERN%20infrastructure%20final.pdf?version=1>`_
de: `Übersicht über die Infrastruktur des CERN-Rechenzentrums <http://cds.cern.ch/record/1457989/files/chep%202012%20CERN%20infrastructure%20final.pdf?version=1>`_

source: `Rough-draft design discussions ("etherpads") from the last design summit <https://wiki.openstack.org/wiki/Summit/Kilo/Etherpads>`_
de: Vorentwurfsdiskussionen ("Etherpads") vom `letzten Design-Gipfel <https://wiki.openstack.org/wiki/Summit/Kilo/Etherpads>`_

source: `TCP/IP Illustrated, Volume 1: The Protocols, 2/E (Pearson) <https://www.pearsonhighered.com/educator/product/TCPIP-Illustrated-Volume-1-The-Protocols/9780321336316.page>`_
de: `TCP/IP veranschaulicht, Band 1: Die Protokolle, 2/E (Pearson) <https://www.pearsonhighered.com/educator/product/TCPIP-Illustrated-Volume-1-The-Protocols/9780321336316.page>`_

source: `Telemetry service (ceilometer) upgrades <https://docs.openstack.org/ceilometer/ocata/install/upgrade.html>`_
de: `Telemetrieservice (ceilometer) Upgrades <https://docs.openstack.org/ceilometer/ocata/install/upgrade.html>`_

source: `The Book of Xen (No Starch Press) <https://nostarch.com/releases/xen.html>`_
de: Das Buch` Xen (No Starch Press) <https://nostarch.com/releases/xen.html>`_

source: `The NIST Definition of Cloud Computing <https://nvlpubs.nist.gov/nistpubs/Legacy/SP/nistspecialpublication800-145.pdf>`_
de: `Die NIST-Definition von Cloud Computing <https://nvlpubs.nist.gov/nistpubs/Legacy/SP/nistspecialpublication800-145.pdf>`_

source: `The TCP/IP Guide (No Starch Press) <https://www.nostarch.com/tcpip.htm>`_
de: `Der TCP/IP-Leitfaden (No Starch Press) <https://www.nostarch.com/tcpip.htm>`_

source: `UNIX and Linux Systems Administration Handbook (Prentice Hall) <https://www.admin.com/>`_
de: `Handbuch zur Administration von Unix- und Linux-Systemen (Prentice Hall) <https://www.admin.com/>`_

source: ``/etc/cinder`` and ``/var/log/cinder`` follow the same rules as other components.
de: ``/etc/cinder`` und ``/var/log/cinder`` folgen den gleichen Regeln wie andere Komponenten.
id: ``/etc/cinder`` and ``/var/log/cinder`` ikuti aturan yang sama dengan komponen lainnya.

source: ``/etc/glance`` and ``/var/log/glance`` follow the same rules as their nova counterparts.
de: ``/etc/glance`` und ``/var/log/glance`` folgen den gleichen Regeln wie ihre nova-Pendants.
id: ``/etc/glance`` and ``/var/log/glance`` ikuti aturan yang sama dengan counterpart Nova mereka.

source: ``/etc/keystone`` and ``/var/log/keystone`` follow the same rules as other components.
de: ``/etc/keystone`` und ``/var/log/keystone`` folgen den gleichen Regeln wie andere Komponenten.
id: ``/etc/keystone`` and ``/var/log/keystone`` ikuti aturan yang sama dengan komponen lainnya.

source: ``/etc/neutron`` and ``/var/log/neutron`` follow the same rules as other components.
de: ``/etc/neutron`` und ``/var/log/neutron`` folgen den gleichen Regeln wie andere Komponenten.
id: ``/etc/neutron`` and ``/var/log/neutron`` ikuti aturan yang sama dengan komponen lainnya.

source: ``/etc/swift`` is very important to have backed up. This directory contains the swift configuration files as well as the ring files and ring :term:`builder files <builder file>`, which if lost, render the data on your cluster inaccessible. A best practice is to copy the builder files to all storage nodes along with the ring files. Multiple backup copies are spread throughout your storage cluster.
de: ``/etc/swift`` ist sehr wichtig, um ein Backup erstellt zu haben. Dieses Verzeichnis enthält die swift Konfigurationsdateien sowie die Ringdateien und Ring :term:`builder files <builder file>`, die bei Verlust die Daten auf Ihrem Cluster unzugänglich machen. Eine bewährte Vorgehensweise ist es, die Builder-Dateien zusammen mit den Ringdateien auf alle Speicherknoten zu kopieren. Mehrere Sicherungskopien sind über Ihren Speichercluster verteilt.
id: ``/etc/swift`` sangat penting untuk didukung. Direktori ini berisi file konfigurasi swift serta file ring dan ring :term:`builder files <builder file>`, yang jika hilang, membuat data di cluster Anda tidak dapat diakses. Praktik terbaik adalah menyalin file pembangun ke semua node penyimpanan bersama dengan file ring. Beberapa salinan cadangan tersebar di seluruh kluster penyimpanan Anda.

source: ``/var/lib/cinder`` should also be backed up.
de: ``/var/lib/cinder`` sollte ebenfalls gesichert werden.
id: ``/var/lib/cinder`` juga harus didukung.

source: ``/var/lib/glance`` should also be backed up. Take special notice of ``/var/lib/glance/images``. If you are using a file-based back end of glance, ``/var/lib/glance/images`` is where the images are stored and care should be taken.
de: ``/var/lib/glance`` sollte ebenfalls gesichert werden. Beachten Sie besonders ``/var/lib/glance/images``. Wenn Sie ein dateibasiertes Backend von glance verwenden, ist ``/var/lib/glance/images`` der Ort, an dem die Abilder gespeichert werden, und es sollte mit Sorgfalt vorgegangen werden.
id: ``/var/lib/glance`` juga harus didukung. Perhatikan ``/var/lib/glance/images``.Jika Anda menggunakan back end berbasis file dari glance, ``/var/lib/glance/images`` Di sinilah image disimpan dan perawatan harus diambil.

source: ``/var/lib/keystone``, although it should not contain any data being used, can also be backed up just in case.
de: ``/var/lib/keystone``, obwohl es keine zu verwendenden Daten enthalten sollte, kann für alle Fälle auch eine Sicherung durchgeführt werden.
id: ``/var/lib/keystone``, meskipun tidak boleh berisi data apa pun yang digunakan, juga dapat dicadangkan untuk berjaga-jaga.

source: ``/var/lib/neutron`` should also be backed up.
de: ``/var/lib/neutron`` sollte ebenfalls gesichert werden.
id: ``/var/lib/neutron`` juga harus didukung.

source: ``/var/lib/nova/instances`` contains two types of directories.
de: ``/var/lib/nova/instances`` enthält zwei Arten von Verzeichnissen.
id: ``/var/lib/nova/instances`` berisi dua jenis direktori.
