Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: An advanced use of this general concept allows different flavor types to run with different CPU and RAM allocation ratios so that high-intensity computing loads and low-intensity development and testing systems can share the same cloud without either starving the high-use systems or wasting resources on low-utilization systems. This works by setting ``metadata`` in your host aggregates and matching ``extra_specs`` in your flavor types.
de: Eine fortgeschrittene Nutzung dieses allgemeinen Konzepts ermöglicht es, dass verschiedene Flavor-Typen mit unterschiedlichen CPU- und RAM-Zuordnungsverhältnissen betrieben werden können, so dass hochintensive Rechenlasten und niedrigintensive Entwicklungs- und Testsysteme die gleiche Cloud gemeinsam nutzen können, ohne die hochgradig genutzten Systeme zu verhungern oder Ressourcen für Systeme mit geringer Auslastung zu verschwenden. Dies funktioniert, indem Sie ``Metadaten`` in Ihren Host-Aggregaten setzen und ``extra_specs`` in Ihren Flavor-Typen anpassen.
id: Penggunaan lanjutan dari konsep umum ini memungkinkan jenis flavor berbeda untuk dijalankan dengan rasio alokasi CPU dan RAM yang berbeda sehingga beban komputasi intensitas tinggi dan pengembangan dan sistem pengujian intensitas rendah dapat berbagi cloud yang sama tanpa penurunan (starving) sistem penggunaan tinggi ataupun pemborosan. sumber daya pada sistem pemanfaatan rendah. Ini bekerja dengan mengatur ``metadata`` di agregat host Anda dan mencocokkan ``extra_specs`` dalam jenis flavor Anda.

source: An alternative to enabling the RabbitMQ web management interface is to use the ``rabbitmqctl`` commands. For example, :command:`rabbitmqctl list_queues| grep cinder` displays any messages left in the queue. If there are messages, it's a possible sign that cinder services didn't connect properly to rabbitmq and might have to be restarted.
de: Eine Alternative zur Aktivierung der RabbitMQ-Webmanagement-Schnittstelle ist die Verwendung der Befehle ``rabbitmqctl``. Zum Beispiel zeigt :command:`rabbitmqctl list_queues| grep cinder` alle Nachrichten an, die in der Warteschlange verbleiben. Wenn es Nachrichten gibt, ist es ein mögliches Zeichen dafür, dass sich die Aschendienste nicht richtig mit rabbitmq verbunden haben und neu gestartet werden müssen.
id: Alternatif untuk mengaktifkan antarmuka manajemen web RabbitMQ adalah dengan menggunakan perintah ``rabbitmqctl``. Sebagai contoh, :command:`rabbitmqctl list_queues| grep cinder` menampilkan pesan apa pun yang tersisa di antrian. Jika ada pesan, itu kemungkinan pertanda bahwa layanan cinder tidak terhubung dengan benar ke rabbitmq dan mungkin harus dimulai ulang.

source: An attempt was made to deprecate ``nova-network`` during the Havana release, which was aborted due to the lack of equivalent functionality (such as the FlatDHCP multi-host high-availability mode mentioned in this guide), lack of a migration path between versions, insufficient testing, and simplicity when used for the more straightforward use cases ``nova-network`` traditionally supported. Though significant effort has been made to address these concerns, ``nova-network`` was not be deprecated in the Juno release. In addition, to a limited degree, patches to ``nova-network`` have again begin to be accepted, such as adding a per-network settings feature and SR-IOV support in Juno.
de: Es wurde versucht, das ``Nova-Netzwerk`` während der Havanna-Version zu verwerfen, was aufgrund fehlender gleichwertiger Funktionen (wie dem in diesem Leitfaden erwähnten FlatDHCP-Multi-Host-Hochverfügbarkeitsmodus), des Fehlens eines Migrationspfades zwischen Versionen, unzureichender Tests und der Einfachheit bei Verwendung für die einfacheren Anwendungsfälle des traditionell unterstützten ``Nova-Netzwerkes`` abgebrochen wurde. Obwohl erhebliche Anstrengungen unternommen wurden, um diesen Bedenken entgegenzuwirken, wurde das ``Nova-Netzwerk`` in der Juno-Version nicht veraltet. Darüber hinaus haben in begrenztem Umfang Patches für ``Nova-Netzwerk`` wieder begonnen, akzeptiert zu werden, wie z.B. das Hinzufügen einer Funktion für die Einstellungen pro Netzwerk und die SR-IOV-Unterstützung in Juno.
id: Upaya telah dilakukan untuk menurunkan (deprecate) ``nova-network`` selama rilis Havana, yang dibatalkan karena kurangnya fungsi yang setara (seperti mode FlatDHCP multi-host high-availability yang disebutkan dalam panduan ini), kurangnya migrasi jalur antara versi, pengujian yang tidak mencukupi, dan kesederhanaan saat digunakan untuk kasus penggunaan yang lebih mudah ``nova-network`` yang didukung secara tradisional. Meskipun upaya signifikan telah dilakukan untuk mengatasi masalah ini, ``nova-network`` tidak ditinggalkan dalam rilis Juno. Selain itu, untuk tingkat yang terbatas, patch ke ``nova-network`` telah mulai diterima lagi, seperti menambahkan fitur pengaturan per-network dan dukungan SR-IOV di Juno.

source: An authorization policy can be composed by one or more rules. If more rules are specified, evaluation policy is successful if any of the rules evaluates successfully; if an API operation matches multiple policies, then all the policies must evaluate successfully. Also, authorization rules are recursive. Once a rule is matched, the rule(s) can be resolved to another rule, until a terminal rule is reached. These are the rules defined:
de: Eine Autorisierungsrichtlinie kann aus einer oder mehreren Regeln bestehen. Wenn mehr Regeln angegeben werden, ist die Evaluierungsrichtlinie erfolgreich, wenn eine der Regeln erfolgreich bewertet wird; wenn eine API-Operation mehreren Richtlinien entspricht, dann müssen alle Richtlinien erfolgreich bewertet werden. Außerdem sind die Autorisierungsregeln rekursiv. Sobald eine Regel abgeglichen ist, kann die Regel(n) in eine andere Regel aufgelöst werden, bis eine Terminalregel erreicht ist. Das sind die definierten Regeln:

source: An automated deployment system installs and configures operating systems on new servers, without intervention, after the absolute minimum amount of manual work, including physical racking, MAC-to-IP assignment, and power configuration. Typically, solutions rely on wrappers around PXE boot and TFTP servers for the basic operating system install and then hand off to an automated configuration management system.
de: Ein automatisiertes Bereitstellungssystem installiert und konfiguriert Betriebssysteme auf neuen Servern, ohne Eingriffe, nach dem absoluten Minimum an manueller Arbeit, einschließlich physischem Racking, MAC-zu-IP-Zuweisung und Stromkonfiguration. Typischerweise basieren Lösungen auf Wrappern um PXE-Boot- und TFTP-Server für die Installation des Basis-Betriebssystems und die Übergabe an ein automatisiertes Konfigurationsmanagementsystem.
id: Sistem penyebaran otomatis menginstal dan mengkonfigurasi sistem operasi pada server baru, tanpa intervensi, setelah jumlah minimum absolut dari pekerjaan manual, termasuk pemerasan fisik, penugasan MAC-ke-IP, dan konfigurasi daya. Biasanya, solusi mengandalkan pembungkus (wrapper) di sekitar boot PXE dan server TFTP untuk instalasi sistem operasi dasar dan kemudian diserahkan ke sistem manajemen konfigurasi otomatis.

source: An external server outside of the cloud
de: Ein externer Server außerhalb der Cloud
id: Server eksternal di luar cloud

source: An hour later I received the same alert, but for another compute node. Crap. OK, now there's definitely a problem going on. Just like the original node, I was able to log in by SSH. The bond0 NIC was DOWN but the 1gb NIC was active.
de: Eine Stunde später erhielt ich den gleichen Alarm, aber für einen anderen Compute-Knoten. Mist. OK, jetzt gibt es definitiv ein Problem. Genau wie der ursprüngliche Knoten konnte ich mich per SSH anmelden. Die bond0 NIC war DOWN, aber die 1gb NIC war aktiv.
id: Satu jam kemudian saya menerima peringatan yang sama, tetapi untuk node komputasi lain. Crap. OK, sekarang pasti ada masalah yang terjadi. Sama seperti node asli, saya bisa masuk oleh SSH. Bond0 NIC BAWAH tetapi 1gb NIC aktif.

source: An initial idea was to just increase the lease time. If the instance only renewed once every week, the chances of this problem happening would be tremendously smaller than every minute. This didn't solve the problem, though. It was just covering the problem up.
de: Eine erste Idee war es, die Mietdauer einfach zu erhöhen. Wenn die Instanz nur einmal pro Woche erneuert würde, wären die Chancen, dass dieses Problem auftritt, enorm geringer als jede Minute. Das hat das Problem jedoch nicht gelöst. Es ging nur darum, das Problem zu vertuschen.
id: Gagasan awal adalah hanya menambah waktu sewa. Jika instance hanya diperbarui sekali setiap minggu, peluang terjadinya masalah ini akan jauh lebih kecil daripada setiap menit. Tapi ini tidak menyelesaikan masalah. Itu hanya menutupi masalah.

source: An instance running on that compute node
de: Eine Instanz, die auf diesem Compute-Knoten ausgeführt wird
id: Sebuah instance berjalan pada node komputasi itu

source: An integral part of a configuration-management system is the item that it controls. You should carefully consider all of the items that you want, or do not want, to be automatically managed. For example, you may not want to automatically format hard drives with user data.
de: Ein integraler Bestandteil eines Konfigurationsmanagementsystems ist das Element, das es steuert. Sie sollten alle Elemente, die Sie automatisch verwalten lassen möchten oder nicht, sorgfältig in Betracht ziehen. Beispielsweise möchten Sie möglicherweise keine Festplatten mit Benutzerdaten automatisch formatieren.
id: Bagian integral dari sistem manajemen konfigurasi adalah item yang dikontrolnya. Anda harus hati-hati mempertimbangkan semua item yang Anda inginkan, atau tidak ingin, dikelola secara otomatis. Misalnya, Anda mungkin tidak ingin memformat hard drive dengan data pengguna secara otomatis.

source: An upgrade pre-testing system is excellent for getting the configuration to work. However, it is important to note that the historical use of the system and differences in user interaction can affect the success of upgrades.
de: Ein Upgrade-Pretestsystem ist hervorragend geeignet, um die Konfiguration zum Laufen zu bringen. Es ist jedoch wichtig zu beachten, dass die historische Nutzung des Systems und Unterschiede in der Benutzerinteraktion den Erfolg von Upgrades beeinflussen können.
id: Sistem pra-testing upgrade sangat baik untuk membuat konfigurasi berfungsi. Namun, penting untuk dicatat bahwa penggunaan historis sistem dan perbedaan dalam interaksi pengguna dapat mempengaruhi keberhasilan upgrade.

source: And finally, you can disassociate the floating IP:
de: Und schließlich können Sie die Floating IP dissoziieren:
id: Dan akhirnya, Anda dapat melepaskan IP mengambang:

source: And the best part: the same user had just tried creating a CentOS instance. What?
de: Und das Beste: Der gleiche Benutzer hatte gerade versucht, eine CentOS-Instanz zu erstellen. Was?
id: Dan bagian terbaiknya: pengguna yang sama baru saja mencoba membuat instance CentOS. Apa?

source: Anne is the documentation coordinator for OpenStack and also served as an individual contributor to the Google Documentation Summit in 2011, working with the Open Street Maps team. She has worked on book sprints in the past, with FLOSS Manuals’ Adam Hyde facilitating. Anne lives in Austin, Texas.
de: Anne ist die Dokumentationskoordinatorin für OpenStack und hat auch als Einzelperson am Google Documentation Summit 2011 teilgenommen und mit dem Open Street Maps-Team zusammengearbeitet. Sie hat in der Vergangenheit an Buchsprints gearbeitet, wobei Adam Hyde von FLOSS Manuals die Moderation übernahm. Anne lebt in Austin, Texas.

source: Another common concept across various OpenStack projects is that of periodic tasks. Periodic tasks are much like cron jobs on traditional Unix systems, but they are run inside an OpenStack process. For example, when OpenStack Compute (nova) needs to work out what images it can remove from its local cache, it runs a periodic task to do this.
de: Ein weiteres gemeinsames Konzept in verschiedenen OpenStack-Projekten ist das der periodischen Aufgaben. Periodische Aufgaben sind ähnlich wie Cron-Jobs auf traditionellen Unix-Systemen, aber sie werden innerhalb eines OpenStack-Prozesses ausgeführt. Wenn OpenStack Compute (nova) beispielsweise herausfinden muss, welche Abbilder es aus seinem lokalen Cache entfernen kann, führt es dazu eine regelmäßige Aufgabe aus.
id: Konsep umum lainnya di berbagai proyek OpenStack adalah tugas berkala. Tugas berkala mirip dengan pekerjaan cron pada sistem Unix tradisional, tetapi dijalankan di dalam proses OpenStack. Sebagai contoh, ketika OpenStack Compute (nova) perlu mencari image apa yang dapat dihapus dari cache lokal, itu menjalankan tugas berkala untuk melakukan ini.

source: Another example is a user consuming a very large amount of bandwidth. Again, the key is to understand what the user is doing. If she naturally needs a high amount of bandwidth, you might have to limit her transmission rate as to not affect other users or move her to an area with more bandwidth available. On the other hand, maybe her instance has been hacked and is part of a botnet launching DDOS attacks. Resolution of this issue is the same as though any other server on your network has been hacked. Contact the user and give her time to respond. If she doesn't respond, shut down the instance.
de: Ein weiteres Beispiel ist ein Benutzer, der eine sehr große Menge an Bandbreite verbraucht. Auch hier gilt es zu verstehen, was der Benutzer tut. Wenn sie natürlich eine hohe Bandbreite benötigt, müssen Sie möglicherweise ihre Übertragungsrate begrenzen, um andere Benutzer nicht zu beeinträchtigen oder sie in einen Bereich mit mehr Bandbreite zu verlegen. Auf der anderen Seite wurde vielleicht ihre Instanz gehackt und ist Teil eines Botnetzes, das DDOS-Angriffe startet. Die Lösung dieses Problems ist die gleiche wie wenn jeder andere Server in Ihrem Netzwerk gehackt wurde. Kontaktieren Sie den Benutzer und geben Sie ihm Zeit, zu antworten. Wenn sie nicht antwortet, beenden Sie die Instanz.

source: Another example is displaying all properties for a certain image:
de: Ein weiteres Beispiel ist die Anzeige aller Eigenschaften für ein bestimmtes Abbild:
id: Contoh lain adalah menampilkan semua properti untuk image tertentu:

source: Any time an instance shuts down unexpectedly, it might have problems on boot. For example, the instance might require an ``fsck`` on the root partition. If this happens, the user can use the dashboard VNC console to fix this.
de: Jedes Mal, wenn eine Instanz unerwartet heruntergefahren wird, kann es beim Booten zu Problemen kommen. Zum Beispiel könnte die Instanz ein ``fsck`` auf der Root-Partition erfordern. Wenn dies der Fall ist, kann der Benutzer die Dashboard VNC-Konsole verwenden, um dies zu beheben.
id: Setiap kali sebuah instance dimatikan secara tak terduga, mungkin ada masalah saat boot. Sebagai contoh, instance mungkin memerlukan ``fsck`` di partisi root. Jika ini terjadi, pengguna dapat menggunakan konsol VNC dasbor untuk memperbaikinya.

source: Appendix
de: Anhang
id: Lampiran

source: Arbitrary local files can also be placed into the instance file system at creation time by using the ``--file <dst-path=src-path>`` option. You may store up to five files.
de: Beliebige lokale Dateien können auch zum Zeitpunkt der Erstellung in das Instanzdateisystem platziert werden, indem Sie die Option ``--file <dst-path=src-path>`` verwenden. Sie können bis zu fünf Dateien speichern.

source: Armed with a patched qemu and a way to reproduce, we set out to see if we've finally solved The Issue. After 48 hours straight of hammering the instance with bandwidth, we were confident. The rest is history. You can search the bug report for "joe" to find my comments and actual tests.
de: Bewaffnet mit einem gepatchten Qemu und einer Möglichkeit der Reproduktion, machten wir uns auf den Weg, um zu sehen, ob wir das Problem endlich gelöst haben. Nach 48 Stunden, in denen wir die Instanz mit Bandbreite gehämmert haben, waren wir zuversichtlich. Der Rest ist Geschichte. Sie können den Fehlerbericht nach "joe" durchsuchen, um meine Kommentare und aktuellen Tests zu finden.
id: Dipersenjatai dengan qemu yang di-patch dan cara untuk mereproduksi, kami berangkat untuk melihat apakah kami akhirnya telah menyelesaikan The Issue. Setelah 48 jam terus-menerus memukul instance dengan bandwidth, kami yakin. Sisanya (the rest) adalah sejarah. Anda dapat mencari "bug" laporan bug untuk menemukan komentar saya dan tes yang sebenarnya.

source: Artificial scale testing can go only so far. After your cloud is upgraded, you must pay careful attention to the performance aspects of your cloud.
de: Künstliche Maßstabstests können nur so weit gehen. Nachdem Ihre Cloud aktualisiert wurde, müssen Sie die Leistungsaspekte Ihrer Cloud sorgfältig beachten.
id: Pengujian skala buatan hanya bisa sejauh ini. Setelah cloud Anda ditingkatkan (upgraded), Anda harus memperhatikan aspek kinerja cloud Anda.

source: As a cloud administrative user, you can use the OpenStack dashboard to create and manage projects, users, images, and flavors. Users are allowed to create and manage images within specified projects and to share images, depending on the Image service configuration. Typically, the policy configuration allows admin users only to set quotas and create and manage services. The dashboard provides an :guilabel:`Admin` tab with a :guilabel:`System Panel` and an :guilabel:`Identity` tab. These interfaces give you access to system information and usage as well as to settings for configuring what end users can do. Refer to the `Horizon Administration Guide <https://docs.openstack.org/horizon/latest/admin/>`_ for detailed how-to information about using the dashboard as an admin user.
de: Als administrativer Cloud-Benutzer können Sie das OpenStack-Dashboard verwenden, um Projekte, Benutzer, Abbilder und Varianten zu erstellen und zu verwalten. Benutzer dürfen Abbilder innerhalb bestimmter Projekte erstellen und verwalten und Abbilder gemeinsam nutzen, je nach Konfiguration des Abbilddienstes. In der Regel erlaubt die Richtlinienkonfiguration es Admin-Benutzern, nur Quoten festzulegen und Dienste zu erstellen und zu verwalten. Das Dashboard bietet eine Registerkarte :guilabel:`Admin` mit einem :guilabel:`System Panel` und einer Registerkarte :guilabel:`Identity`. Diese Schnittstellen bieten Ihnen Zugriff auf Systeminformationen und -verwendung sowie auf Einstellungen zur Konfiguration der Möglichkeiten von Endbenutzern. Ausführliche Informationen zur Verwendung des Dashboards als Admin-Benutzer finden Sie im `Horizon Administration Guide <https://docs.openstack.org/horizon/latest/admin/>`__.
id: Sebagai pengguna cloud administrasi, Anda dapat menggunakan dasbor OpenStack untuk membuat dan mengelola proyek, pengguna, image, dan flavor. Pengguna diizinkan untuk membuat dan mengelola image dalam proyek yang ditentukan dan untuk berbagi image, tergantung pada konfigurasi layanan Image. Biasanya, konfigurasi kebijakan hanya mengizinkan pengguna admin untuk menetapkan kuota dan membuat serta mengelola layanan. Dasbor menyediakan tab :guilabel: `Admin` dengan :guilabel:` System Panel` dan sebuah tab :guilabel: `Identity`. Antarmuka ini memberi Anda akses ke informasi dan penggunaan sistem serta pengaturan untuk mengonfigurasi apa yang dapat dilakukan end user. Mengacu kepada `Horizon Administration Guide <https://docs.openstack.org/horizon/latest/admin/>`_ untuk informasi rinci tentang cara menggunakan dasbor sebagai pengguna admin.

source: As a last resort, our network admin (Alvaro) and myself sat down with four terminal windows, a pencil, and a piece of paper. In one window, we ran ping. In the second window, we ran ``tcpdump`` on the cloud controller. In the third, ``tcpdump`` on the compute node. And the forth had ``tcpdump`` on the instance. For background, this cloud was a multi-node, non-multi-host setup.
de: Als letztes Mittel setzten sich unser Netzwerkadministrator (Alvaro) und ich mit vier Terminalfenstern, einem Bleistift und einem Stück Papier hin. In einem Fenster liefen wir Ping. Im zweiten Fenster haben wir ``tcpdump`` auf dem Cloud-Controller ausgeführt. Im dritten Fall ``tcpdump`` auf dem Compute-Knoten. Und der vierte hatte ``tcpdump`` auf der Instanz. Im Hintergrund war diese Cloud ein Multi-Node, Non-Multi-Host-Setup.
id: Sebagai upaya terakhir, admin jaringan kami (Alvaro) dan saya sendiri duduk dengan empat windows terminal, pensil, dan selembar kertas. Di satu jendela, kami menjalankan ping. Di windows kedua, kami menjalankan ``tcpdump`` pada pengontrol cloud. Pada yang ketiga, ``tcpdump`` pada compute node. Dan keempat memiliki ``tcpdump`` pada instance. Sebagai latar belakang, cloud ini merupakan pengaturan multi-node, non-multi-host.

source: As a specific example, compare a cloud that supports a managed web-hosting platform with one running integration tests for a development project that creates one VM per code commit. In the former, the heavy work of creating a VM happens only every few months, whereas the latter puts constant heavy load on the cloud controller. You must consider your average VM lifetime, as a larger number generally means less load on the cloud controller.
de: Als konkretes Beispiel vergleichen Sie eine Cloud, die eine verwaltete Web-Hosting-Plattform unterstützt, mit einem laufenden Integrationstest für ein Entwicklungsprojekt, das eine VM pro Code Commit erstellt. Im ersten Fall erfolgt die schwere Arbeit bei der Erstellung einer VM nur alle paar Monate, während im zweiten Fall der Cloud-Controller ständig stark belastet wird. Sie müssen Ihre durchschnittliche VM-Lebensdauer berücksichtigen, da eine größere Anzahl in der Regel eine geringere Belastung des Cloud-Controllers bedeutet.
id: Sebagai contoh spesifik, bandingkan cloud yang mendukung platform hosting web yang dikelola dengan satu yang menjalankan tes integrasi untuk proyek pengembangan yang membuat satu VM per komit kode. Dalam yang pertama, pekerjaan berat menciptakan VM terjadi hanya setiap beberapa bulan, sedangkan yang terakhir menempatkan beban berat konstan pada pengendali cloud. Anda harus mempertimbangkan masa pakai VM rata-rata, karena jumlah yang lebih besar umumnya berarti lebih sedikit beban pada pengontrol cloud.

source: As an OpenStack cloud is composed of so many different services, there are a large number of log files. This chapter aims to assist you in locating and working with them and describes other ways to track the status of your deployment.
de: Da eine OpenStack-Cloud aus so vielen verschiedenen Diensten besteht, gibt es eine große Anzahl von Protokolldateien. Dieses Kapitel soll Ihnen bei der Suche und Arbeit mit ihnen helfen und beschreibt andere Möglichkeiten, den Status Ihrer Bereitstellung zu verfolgen.
id: Karena cloud OpenStack terdiri dari begitu banyak layanan yang berbeda, ada banyak file log. Bab ini bertujuan untuk membantu Anda menemukan dan bekerja dengan mereka dan menjelaskan cara-cara lain untuk melacak status penempatan Anda.

source: As an administrative user, you can update the Block Storage service quotas for a tenant, as well as update the quota defaults for a new tenant. See :ref:`table_block_storage_quota`.
de: Als administrativer Benutzer können Sie die Kontingente für den Block Storage Service für einen Mieter aktualisieren sowie die Standardeinstellungen für einen neuen Mandanten aktualisieren. Siehe :ref:`table_block_storage_quota`.
id: Sebagai pengguna administratif, Anda dapat memperbarui kuota layanan Block Storage untuk tenant, serta memperbarui kuota default untuk tenant baru. Lihat :ref:`table_block_storage_quota`.
