Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: RemoteGroups are a dynamic way of defining the CIDR of allowed sources. The user specifies a RemoteGroup (security group name) and then all the users' other instances using the specified RemoteGroup are selected dynamically. This dynamic selection alleviates the need for individual rules to allow each new member of the cluster.
de: RemoteGroups sind eine dynamische Möglichkeit, den CIDR der zulässigen Quellen zu definieren. Der Benutzer gibt eine RemoteGroup (Sicherheitsgruppenname) an, und dann werden alle anderen Instanzen der Benutzer, die die angegebene RemoteGroup verwenden, dynamisch ausgewählt. Diese dynamische Auswahl erspart die Notwendigkeit individueller Regeln, um jedes neue Mitglied des Clusters zuzulassen.
id: RemoteGroup adalah cara dinamis untuk mendefinisikan CIDR dari sumber yang diizinkan. Pengguna menentukan RemoteGroup (nama grup keamanan) dan kemudian semua instance pengguna yang menggunakan RemoteGroup yang ditentukan dipilih secara dinamis. Seleksi dinamis ini mengurangi kebutuhan akan aturan individual untuk memungkinkan setiap anggota baru cluster.

source: Remove all packages.
de: Entfernen Sie alle Pakete.
id: Hapus semua paket.

source: Remove databases.
de: Datenbanken entfernen.
id: Hapus database.

source: Remove remaining files.
de: Entfernen Sie die restlichen Dateien.
id: Hapus file yang tersisa.

source: Remove the repository for the previous release packages.
de: Entfernen Sie das Repository für die vorherigen Release-Pakete.
id: Hapus repositori untuk paket rilis sebelumnya.

source: Repeat steps 7-8.
de: Wiederholen Sie die Schritte 7-8.
id: Ulangi langkah 7-8.

source: Replacement of Open vSwitch Plug-in with Modular Layer 2
de: Austausch des Open vSwitch Plugins durch Modular Layer 2
id: Penggantian Open vSwitch Plug-in dengan Modular Layer 2

source: Replacing Components
de: Austausch von Komponenten
id: Mengganti Komponen

source: Replacing a Swift Disk
de: Ersetzen einer Swift DIsk
id: Mengganti Swift Disk

source: Reset Share State
de: Freigabestatus zurücksetzen

source: Resource Alerting
de: Ressourcenalarmierung
id: Peringatan Sumberdaya

source: Resource alerting provides notifications when one or more resources are critically low. While the monitoring thresholds should be tuned to your specific OpenStack environment, monitoring resource usage is not specific to OpenStack at all—any generic type of alert will work fine.
de: Resourcenallarmierung liefert Benachrichtigungen, wenn eine oder mehrere Ressourcen kritisch niedrig sind. Obwohl die Überwachungsschwellenwerte auf Ihre spezifische OpenStack-Umgebung abgestimmt werden sollten, ist die Überwachung der Ressourcennutzung nicht spezifisch für OpenStack und jede generische Art von Warnungen funktioniert einwandfrei.
id: Peringatan sumber daya memberikan pemberitahuan ketika satu atau beberapa sumber daya sangat rendah. Sementara ambang pemantauan harus disesuaikan dengan lingkungan OpenStack spesifik Anda, pemantauan penggunaan sumber daya sama sekali tidak khusus untuk OpenStack — semua jenis peringatan umum akan berfungsi dengan baik.

source: Resource based
de: Ressourcenbasiert

source: Resources
de: Resourcen
id: Sumber daya

source: Resources such as memory, disk, and CPU are generic resources that all servers (even non-OpenStack servers) have and are important to the overall health of the server. When dealing with OpenStack specifically, these resources are important for a second reason: ensuring that enough are available to launch instances. There are a few ways you can see OpenStack resource usage. The first is through the :command:`openstack` command:
de: Ressourcen wie Speicher, Festplatte und CPU sind generische Ressourcen, die alle Server (auch Nicht-OpenStack-Server) haben und für den allgemeinen Zustand des Servers wichtig sind. Wenn es um OpenStack geht, sind diese Ressourcen aus einem zweiten Grund wichtig: Sicherstellen, dass genügend verfügbar ist, um Instanzen zu starten. Es gibt einige Möglichkeiten, wie Sie die Nutzung von OpenStack-Ressourcen sehen können. Die erste ist durch den Befehl :command:`openstack`:

source: Restart the RabbitMQ service on all of the controller nodes:
de: Starten Sie den RabbitMQ-Dienst auf allen Controller-Knoten neu:
id: Restart layanan RabbitMQ di semua node pengontrol:

source: Restart the RabbitMQ service on the first controller node. The :command:`service rabbitmq-server restart` command may not work in certain situations, so it is best to use:
de: Starten Sie den RabbitMQ-Dienst auf dem ersten Controller-Knoten neu. Der Befehl :command:`service rabbitmq-server restart` funktioniert in bestimmten Situationen möglicherweise nicht, daher ist es am besten, ihn zu verwenden:
id: Restart layanan RabbitMQ pada node pengontrol pertama. Perintah :command:`service rabbitmq-server restart` mungkin tidak berfungsi dalam situasi tertentu, jadi yang terbaik adalah menggunakan:

source: Restart the ``swift proxy`` service to make swift use your middleware. Start by switching to the ``swift-proxy`` screen:
de: Starten Sie den Dienst ``swift proxy`` neu, um Ihre Middleware schnell zu nutzen. Wechseln Sie zunächst zum Bildschirm "swift-proxy":
id: Mulai ulang layanan ``swift proxy`` untuk menjadikan swift menggunakan middleware Anda. Mulailah dengan beralih ke layar ``swift-proxy``:

source: Restart the nova scheduler service to make nova use your scheduler. Start by switching to the ``n-sch`` screen:
de: Starten Sie den Dienst nova scheduler neu, damit nova Ihren Scheduler verwenden kann. Wechseln Sie zunächst zum Bildschirm "n-sch":
id: Mulai ulang layanan penjadwal nova untuk membuat nova menggunakan penjadwal Anda. Mulailah dengan beralih ke layar (screen) ``n-sch``:

source: Restore databases from backup.
de: Wiederherstellen von Datenbanken aus dem Backup.
id: Restore databases dari backup.

source: Restore databases from the ``RELEASE_NAME-db-backup.sql`` backup file that you created with the :command:`mysqldump` command during the upgrade process:
de: Stellen Sie Datenbanken aus der Sicherungsdatei ``RELEASE_NAME-db-backup.sql`` wieder her, die Sie mit dem Befehl :command:`mysqldump` während des Upgrade-Prozesses erstellt haben:
id: Pulihkan basis data dari file cadangan ``RELEASE_NAME-db-backup.sql`` yang Anda buat dengan perintah :command:`mysqldump` selama proses upgrade:

source: Resume I/O to the disks, similar to the Linux ``fsfreeze -u`` operation.
de: Setzen Sie die I/O auf den Festplatten fort, ähnlich wie bei der Operation Linux ``fsfsfreeze -u``.

source: Resume the instance using :command:`virsh`:
de: Nimm die Instanz mit :command:`virsh` wieder auf:
id: Lanjutkan instance menggunakan :command:`virsh`:

source: Resume the instance.
de: Nimm die Instanz wieder auf.
id: Lanjutkan instance.

source: Retrieve image for upload
de: Abbild zum Hochladen abrufen
id: Ambil image untuk diunggah

source: Reverse the direction to see the path of a ping reply. From this path, you can see that a single packet travels across four different NICs. If a problem occurs with any of these NICs, a network issue occurs.
de: Umgekehrt die Richtung, um den Weg einer Ping-Antwort zu sehen. Aus diesem Pfad können Sie ersehen, dass ein einzelnes Paket über vier verschiedene NICs läuft. Wenn ein Problem mit einem dieser NICs auftritt, tritt ein Netzwerkproblem auf.
id: Balikkan arah (reverse) untuk melihat jalur balasan ping. Dari jalur ini, Anda dapat melihat bahwa satu paket bergerak melintasi empat NIC yang berbeda. Jika masalah terjadi dengan salah satu NIC ini, masalah jaringan terjadi.

source: Review and plan any major OpenStack upgrades.
de: Überprüfung und Planung aller wichtigen OpenStack-Upgrades.
id: Tinjau dan rencanakan setiap upgrade OpenStack utama.

source: Review and plan any necessary cloud additions.
de: Überprüfen und planen Sie alle notwendigen Cloud-Additionen.
id: Tinjau dan rencanakan semua penambahan awan yang diperlukan.

source: Review common actions in your cloud.
de: Überprüfen Sie allgemeine Aktionen in Ihrer Cloud.
id: Tinjau tindakan umum di cloud Anda.

source: Review the component's configuration file to see how each OpenStack component accesses its corresponding database. Look for a ``connection`` option. The following command uses ``grep`` to display the SQL connection string for nova, glance, cinder, and keystone:
de: Überprüfen Sie die Konfigurationsdatei der Komponente, um zu sehen, wie jede OpenStack-Komponente auf die entsprechende Datenbank zugreift. Suchen Sie nach einer Option "Verbindung". Der folgende Befehl verwendet ``grep``, um die SQL-Verbindungszeichenfolge für nova, glance, cinder und keystone anzuzeigen:
id: Tinjau file konfigurasi komponen untuk melihat bagaimana setiap komponen OpenStack mengakses database terkait. Cari opsi ``connection``. Perintah berikut menggunakan ``grep`` untuk menampilkan string koneksi SQL untuk nova, glance, cinder, dan keystone:

source: Review usage and trends over the past quarter.
de: Überprüfung der Nutzung und der Trends im vergangenen Quartal.
id: Tinjau penggunaan dan tren selama kuartal terakhir.

source: Role
de: Rolle

source: Role-based rules
de: Rollenbasierte Regeln

source: Roll Your Own OpenStack
de: Rollen Sie Ihren eigenen OpenStack aus

source: Roll back configuration files.
de: Rollback der Konfigurationsdateien.
id: Roll back file konfigurasi.

source: Roll back packages.
de: Pakete zurücksetzen.
id: Roll backpaket.

source: Roll these tests into an alerting system.
de: Rollen Sie diese Tests in ein Alarmsystem.
id: Gulirkan tes ini ke sistem peringatan.

source: Rolling back a failed upgrade
de: Zurücksetzen eines fehlgeschlagenen Upgrades
id: Mengembalikan upgrade yang gagal

source: Rolling back your environment should be the final course of action since you are likely to lose any data added since the backup.
de: Das Zurücksetzen Ihrer Umgebung sollte die letzte Maßnahme sein, da Sie wahrscheinlich alle seit dem Backup hinzugefügten Daten verlieren werden.
id: Mengembalikan lingkungan Anda harus menjadi tindakan terakhir karena Anda kemungkinan kehilangan data yang ditambahkan sejak cadangan.

source: Routing through or avoiding specific networks
de: Routing durch oder Vermeidung bestimmter Netzwerke
id: Routing melalui atau menghindari jaringan tertentu

source: Run the :command:`openstack port set` command to remove the port from the instance:
de: Führen Sie den Befehl :command:`openstack port set` aus, um den Port aus der Instanz zu entfernen:
id: Jalankan perintah :command:`openstack port set` untuk menghapus port dari instance:

source: Run the :command:`rabbitmqctl status` to view the current file descriptor limits:
de: Führen Sie den Befehl :command:`rabbitmqctl status` aus, um die aktuellen Grenzen des Datei-Deskriptors anzuzeigen:
id: Jalankan :command:`rabbitmqctl status` untuk melihat batas deskriptor file saat ini:

source: Run the following command to view the current iptables configuration:
de: Führen Sie den folgenden Befehl aus, um die aktuelle iptables-Konfiguration anzuzeigen:
id: Jalankan perintah berikut untuk melihat konfigurasi iptables saat ini:

source: Run the following command to view the properties of existing images:
de: Führen Sie den folgenden Befehl aus, um die Eigenschaften vorhandener Abbilder anzuzeigen:
id: Jalankan perintah berikut untuk melihat properti image yang ada:

source: Run this on the command line of the following areas:
de: Führen Sie dies auf der Befehlszeile der folgenden Bereiche aus:
id: Jalankan ini pada command line area berikut:

source: Running Daemons on the CLI
de: Dämonen auf dem CLI ausführen
id: Menjalankan Daemon di CLI

source: Running Instances
de: Laufende Instanzen
id: Menjalankan Instance

source: Running ``sync`` writes dirty buffers (buffered blocks that have been modified but not written yet to the disk block) to disk.
de: Das Ausführen von ``sync`` schreibt schmutzige Puffer (gepufferte Blöcke, die geändert, aber noch nicht auf den Festplattenblock geschrieben wurden) auf die Festplatte.

source: Running programs have written their contents to disk
de: Laufende Programme haben ihren Inhalt auf die Festplatte geschrieben

source: Save the configuration files on all nodes. For example:
de: Speichern Sie die Konfigurationsdateien auf allen Knoten. Zum Beispiel:
id: Simpan file konfigurasi di semua node. Sebagai contoh:

source: Scalable Hardware
de: Skalierbare Hardware
id: Perangkat keras yang dapat diskalakan

source: Scheduler Improvements
de: Verbesserungen des Schedulers
id: Perbaikan Penjadwal

source: Scheduling to hosts with trusted hardware support.
de: Planung auf Hosts mit vertrauenswürdiger Hardwareunterstützung.
id: Penjadwalan ke host dengan dukungan perangkat keras tepercaya.

source: Secondly, DAIR's shared ``/var/lib/nova/instances`` directory contributed to the problem. Since all compute nodes have access to this directory, all compute nodes periodically review the \_base directory. If there is only one instance using an image, and the node that the instance is on is down for a few minutes, it won't be able to mark the image as still in use. Therefore, the image seems like it's not in use and is deleted. When the compute node comes back online, the instance hosted on that node is unable to start.
de: Zweitens trug das gemeinsame Verzeichnis ``/var/lib/nova/instances`` von DAIR zu dem Problem bei. Da alle Compute-Knoten Zugriff auf dieses Verzeichnis haben, überprüfen alle Compute-Knoten regelmäßig das Verzeichnis \_base. Wenn es nur eine Instanz gibt, die ein Abbild verwendet, und der Knoten, auf dem sich die Instanz befindet, für einige Minuten nicht aktiv ist, kann er das Abbild nicht als noch in Gebrauch markieren. Daher scheint das Abbild nicht verwendet zu werden und wird gelöscht. Wenn der Compute-Knoten wieder online ist, kann die auf diesem Knoten gehostete Instanz nicht gestartet werden.
id: Kedua, direktori ``/var/lib/nova/instances``` bersama DAIR berkontribusi pada masalah. Karena semua node komputasi memiliki akses ke direktori ini, semua node komputasi secara berkala meninjau direktori \ _base. Jika hanya ada satu instance menggunakan image, dan simpul yang dihidupkan instance turun selama beberapa menit, itu tidak akan dapat menandai image sebagai masih digunakan. Oleh karena itu, image sepertinya tidak digunakan dan dihapus. Ketika node komputasi kembali online, instance yang dihosting pada node itu tidak dapat memulai.

source: Securing a multi-site OpenStack installation brings several challenges. Tenants may expect a tenant-created network to be secure. In a multi-site installation the use of a non-private connection between sites may be required. This may mean that traffic would be visible to third parties and, in cases where an application requires security, this issue requires mitigation. In these instances, install a VPN or encrypted connection between sites to conceal sensitive traffic.
de: Die Sicherung einer OpenStack-Installation mit mehreren Standorten bringt mehrere Herausforderungen mit sich. Mandanten können erwarten, dass ein vom Mandanten geschaffenes Netzwerk sicher ist. Bei einer Installation mit mehreren Standorten kann die Verwendung einer nicht privaten Verbindung zwischen Standorten erforderlich sein. Dies kann bedeuten, dass der Datenverkehr für Dritte sichtbar wäre, und in Fällen, in denen eine Anwendung Sicherheit erfordert, erfordert dieses Problem eine Verringerung. Installieren Sie in diesen Fällen ein VPN oder eine verschlüsselte Verbindung zwischen Standorten, um vertraulichen Datenverkehr zu verbergen.
id: Mengamankan instalasi OpenStack multi-situs membawa beberapa tantangan. Penyewa dapat mengharapkan jaringan yang dibuat penyewa aman. Dalam instalasi multi-situs, penggunaan koneksi non-pribadi antara situs mungkin diperlukan. Ini mungkin berarti bahwa lalu lintas akan terlihat oleh pihak ketiga dan, dalam kasus di mana aplikasi membutuhkan keamanan, masalah ini membutuhkan mitigasi. Dalam hal ini, instal VPN atau koneksi terenkripsi antara situs untuk menyembunyikan lalu lintas sensitif.

source: Security Configuration for Compute, Networking, and Storage
de: Sicherheitskonfiguration für Compute, Networking und Storage
id: Konfigurasi Keamanan untuk Komputasi, Jaringan, dan Penyimpanan

source: Security Groups
de: Sicherheitsgruppen
id: Grup Keamanan

source: Security breach policies governing the ways to notify individuals through cloud provider's systems or other means if their personal data gets compromised in any way.
de: Sicherheitsverletzungsrichtlinien, die regeln, wie Personen über die Systeme des Cloud-Anbieters oder auf andere Weise benachrichtigt werden können, wenn ihre personenbezogenen Daten in irgendeiner Weise gefährdet werden.
id: Kebijakan pelanggaran keamanan yang mengatur cara untuk memberi tahu individu melalui sistem penyedia cloud atau cara lain jika data pribadi mereka dikompromikan dengan cara apa pun.

source: Security domains
de: Sicherheitsdomänen
id: Domain keamanan

source: Security domains include:
de: Zu den Sicherheitsdomänen gehören:
id: Domain keamanan meliputi:

source: Security group rules
de: Sicherheitsgruppenregeln
id: Aturan grup keamanan

source: Security groups
de: Sicherheitsgruppen
id: Grup keamanan

source: Security groups are sets of IP filter rules that are applied to an instance's networking. They are project specific, and project members can edit the default rules for their group and add new rules sets. All projects have a "default" security group, which is applied to instances that have no other security group defined. Unless changed, this security group denies all incoming traffic.
de: Sicherheitsgruppen sind Sätze von IP-Filterregeln, die auf das Netzwerk einer Instanz angewendet werden. Sie sind projektspezifisch, und die Projektmitglieder können die Standardregeln für ihre Gruppe bearbeiten und neue Regelsätze hinzufügen. Alle Projekte haben eine "default"-Sicherheitsgruppe, die auf Instanzen angewendet wird, die keine andere Sicherheitsgruppe definiert haben. Sofern nicht anders angegeben, verweigert diese Sicherheitsgruppe den gesamten eingehenden Datenverkehr.
id: Grup keamanan adalah sekumpulan aturan filter IP yang diterapkan pada jaringan instance. Mereka spesifik proyek, dan anggota proyek dapat mengedit aturan default untuk grup mereka dan menambahkan set aturan baru. Semua proyek memiliki grup keamanan "default", yang diterapkan pada instance yang tidak memiliki grup keamanan lain yang ditentukan. Kecuali diubah, grup keamanan ini menolak semua lalu lintas masuk.

source: Security groups for the current project can be found on the OpenStack dashboard under :guilabel:`Access & Security`. To see details of an existing group, select the :guilabel:`Edit Security Group` action for that security group. Obviously, modifying existing groups can be done from this edit interface. There is a :guilabel:`Create Security Group` button on the main :guilabel:`Access & Security` page for creating new groups. We discuss the terms used in these fields when we explain the command-line equivalents.
de: Sicherheitsgruppen für das aktuelle Projekt finden Sie im OpenStack-Dashboard unter :guilabel:`Access & Security`. Um Details zu einer bestehenden Gruppe anzuzeigen, wählen Sie die Aktion :guilabel:`Edit Security Group` für diese Sicherheitsgruppe. Natürlich kann das Ändern bestehender Gruppen über diese Bearbeitungsoberfläche erfolgen. Es gibt eine Schaltfläche :guilabel:`Create Security Group` auf der Hauptseite :guilabel:`Access & Security` zum Erstellen neuer Gruppen. Wir besprechen die in diesen Feldern verwendeten Begriffe, wenn wir die Befehlszeilenäquivalente erklären.
id: Grup keamanan untuk proyek saat ini dapat ditemukan di dashboard OpenStack di bawah :guilabel:`Access & Security`. Untuk melihat detail grup yang ada, pilih tindakan :guilabel:`Edit Grup Keamanan` untuk grup keamanan itu. Jelas, memodifikasi grup yang ada dapat dilakukan dari antarmuka edit ini. Ada tombol :guilabel:`Create Security Group` pada halaman utama :guilabel:`Access & Security` untuk membuat grup baru. Kami membahas istilah yang digunakan dalam field ini ketika kami menjelaskan padanan baris perintah (command-line equivalent).

source: Security groups, as discussed earlier, are typically required to allow network traffic to an instance, unless the default security group for a project has been modified to be more permissive.
de: Sicherheitsgruppen, wie bereits erwähnt, sind in der Regel erforderlich, um den Netzwerkverkehr auf eine Instanz zuzulassen, es sei denn, die Standard-Sicherheitsgruppe für ein Projekt wurde geändert, um freizügiger zu sein.

source: Security requirements
de: Sicherheitsanforderungen
id: Persyaratan keamanan

source: See `Share Management <https://docs.openstack.org/admin-guide/shared-file-systems-share-management.html>`__ of “Shared File Systems” section of OpenStack Administrator Guide document for the details on share management operations.
de: Siehe `Share Management <https://docs.openstack.org/admin-guide/shared-file-systems-share-management.html>`__ im Abschnitt "Shared File Systems" im OpenStack Administrator Guide Dokument für Details zu den Vorgängen der Share Management.

source: See `Share Networks <https://docs.openstack.org/admin-guide/shared-file-systems-share-networks.html>`__ of “Shared File Systems” section of OpenStack Administrator Guide document for more details.
de: Weitere Informationen finden Sie unter `Share Networks <https://docs.openstack.org/admin-guide/shared-file-systems-share-networks.html>`__ im Abschnitt "Shared File Systems" im OpenStack Administrator Guide Dokument.

source: Segregating your cloud
de: Trennung Ihrer Cloud
id: Memisahkan cloud Anda

source: Segregating your cloud is needed when users require different regions for legal considerations for data storage, redundancy across earthquake fault lines, or for low-latency API calls. It can be segregated by *cells*, *regions*, *availability zones*, or *host aggregates*.
de: Die Trennung Ihrer Cloud ist erforderlich, wenn Benutzer verschiedene Regionen aus rechtlichen Gründen für die Datenspeicherung, die Redundanz über Erdbeben-Fehlerleitungen oder für API-Aufrufe mit niedriger Latenz benötigen. Es kann durch *Zellen*, *Regionen*, *Verfügbarkeitszonen* oder *Host-Aggregate* getrennt werden.
id: Memisahkan cloud Anda diperlukan ketika pengguna memerlukan wilayah yang berbeda untuk pertimbangan hukum untuk penyimpanan data, redundansi di seluruh jalur gangguan gempa bumi, atau untuk panggilan API latensi rendah. Ini dapat dipisahkan oleh *cells*, *regions*, *availability zones*, atau *host aggregates*.

source: Select the :guilabel:`Identity` tab in the left navigation bar.
de: Wählen Sie in der linken Navigationsleiste die Registerkarte :guilabel:`Identity`.
id: Pilih tab :guilabel:`Identity` di bar navigasi kiri.

source: Semiannually
de: Halbjährlich
id: Tengah tahunan

source: Send unmatched traffic to the fallback chain.
de: Senden Sie unübertroffenen Traffic an die Fallback-Kette.
id: Kirim lalu lintas yang tak cocok ke rantai fallback.

source: Seriously, Google.
de: Im Ernst, Google.
id: Serius, Google.

source: Server Group Members
de: Mitglieder der Servergruppe
id: Anggota Grup Server

source: Server Groups
de: Servergruppen
id: Grup Server

source: Server load
de: Serverauslastung

source: Servers and Services
de: Server und Dienste
id: Server dan Layanan

source: Service
de: Dienst

source: Service specific upgrade instructions
de: Dienstspezifische Upgrade-Anweisungen
id: Instruksi upgrade layanan khusus

source: Services
de: Dienste
