Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: The maximum port number in the range that is matched by the security group rule. The ``port_range_min`` attribute constrains the ``port_range_max`` attribute. If the protocol is ICMP or ICMPv6, this value must be an ICMP or ICMPv6 type, respectively.
de: Die maximale Portnummer in dem Bereich, die von der Sicherheitsgruppenregel erfüllt wird. Das Attribut ``port_range_min`` beschränkt das Attribut ``port_range_max``. Wenn das Protokoll ICMP oder ICMPv6 ist, muss dieser Wert ein ICMP- bzw. ICMPv6-Typ sein.
id: Nomor port maksimum dalam rentang yang cocok dengan aturan grup keamanan. Atribut ``port_range_min`` membatasi atribut ``port_range_max``. Jika protokolnya adalah ICMP atau ICMPv6, nilai ini harus masing-masing merupakan tipe ICMP atau ICMPv6.

source: The minimum port number in the range that is matched by the security group rule. If the protocol is TCP or UDP, this value must be less than or equal to the ``port_range_max`` attribute value. If the protocol is ICMP or ICMPv6, this value must be an ICMP or ICMPv6 type, respectively.
de: Die minimale Portnummer in dem Bereich, der von der Sicherheitsgruppenregel erfüllt wird. Wenn das Protokoll TCP oder UDP ist, muss dieser Wert kleiner oder gleich dem Attributwert ``port_range_max_max`` sein. Wenn das Protokoll ICMP oder ICMPv6 ist, muss dieser Wert ein ICMP- bzw. ICMPv6-Typ sein.
id: Nomor port minimum dalam rentang yang cocok dengan aturan grup keamanan. Jika protokolnya adalah TCP atau UDP, nilai ini harus kurang dari atau sama dengan nilai atribut ``port_range_max``. Jika protokolnya adalah ICMP atau ICMPv6, nilai ini harus masing-masing merupakan tipe ICMP atau ICMPv6.

source: The most important step is the pre-upgrade testing. If you are upgrading immediately after release of a new version, undiscovered bugs might hinder your progress. Some deployers prefer to wait until the first point release is announced. However, if you have a significant deployment, you might follow the development and testing of the release to ensure that bugs for your use cases are fixed.
de: Der wichtigste Schritt ist die Pre-Upgrade-Prüfung. Wenn Sie unmittelbar nach der Veröffentlichung einer neuen Version ein Upgrade durchführen, können unentdeckte Fehler Ihren Fortschritt behindern. Einige Bereitsteller ziehen es vor, zu warten, bis die erste Punktfreigabe angekündigt wird. Wenn Sie jedoch einen signifikanten Einsatz haben, können Sie die Entwicklung und den Test des Releases verfolgen, um sicherzustellen, dass Fehler für Ihre Anwendungsfälle behoben werden.
id: Langkah paling penting adalah pengujian pra-upgrade. Jika Anda upgrade segera setelah rilis versi baru, bug yang belum ditemukan mungkin menghambat kemajuan Anda. Beberapa penyebar lebih suka menunggu sampai rilis poin pertama diumumkan. Namun, jika Anda memiliki penyebaran yang signifikan, Anda dapat mengikuti pengembangan dan pengujian rilis untuk memastikan bahwa bug untuk kasus penggunaan Anda diperbaiki.

source: The networking chapter of the `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`_ shows a variety of networking scenarios and their connection paths. The purpose of this section is to give you the tools to troubleshoot the various components involved however they are plumbed together in your environment.
de: Das Netzwerkkapitel des `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`_ zeigt eine Vielzahl von Netzwerkszenarien und deren Verbindungspfade. Der Zweck dieses Abschnitts ist es, Ihnen die Werkzeuge zur Verfügung zu stellen, um die verschiedenen beteiligten Komponenten zu beheben, egal wie sie in Ihrer Umgebung zusammengefügt sind.
id: Bab jaringan dari `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`_ menampilkan berbagai skenario jaringan dan jalur koneksinya. Tujuan dari bagian ini adalah untuk memberi Anda alat untuk memecahkan masalah berbagai komponen yang terlibat namun mereka diselami bersama di lingkungan Anda.

source: The next best approach is to use a configuration-management tool, such as Puppet, to automatically build a cloud controller. This should not take more than 15 minutes if you have a spare server available. After the controller rebuilds, restore any backups taken (see :doc:`ops-backup-recovery`).
de: Der nächstbeste Ansatz ist die Verwendung eines Konfigurationsmanagement-Tools wie Puppet, um automatisch einen Cloud-Controller zu erstellen. Dies sollte nicht länger als 15 Minuten dauern, wenn Sie einen freien Server zur Verfügung haben. Nachdem die Steuerung neu aufgebaut wurde, stellen Sie alle durchgeführten Backups wieder her (siehe :doc:`ops-backup-recovery`).
id: Pendekatan terbaik berikutnya adalah menggunakan alat manajemen konfigurasi, seperti Puppet, untuk secara otomatis membangun pengendali cloud. Seharusnya tidak lebih dari 15 menit jika Anda memiliki server cadangan. Setelah pengontrol membangun kembali, pulihkan semua cadangan yang diambil (lihat :doc:`ops-backup-recovery`).

source: The next step depends on whether the virtual network is configured to use 802.1q VLAN tags or GRE:
de: Der nächste Schritt hängt davon ab, ob das virtuelle Netzwerk für die Verwendung von 802.1q VLAN-Tags oder GRE konfiguriert ist:
id: Langkah selanjutnya tergantung pada apakah jaringan virtual dikonfigurasi untuk menggunakan tag VLAN 802.1q atau GRE:

source: The nova scheduler service
de: Der nova Scheduler-Dienst
id: Layanan penjadwal nova

source: The nova services
de: Die nova-Dienste
id: Layanan nova

source: The number of Object Storage requests each hour
de: Die Anzahl der Objektspeicheranforderungen pro Stunde
id: Jumlah permintaan Object Storage setiap jam

source: The number of ``nova-api`` requests each hour
de: Die Anzahl der ``nova-api`` Anfragen pro Stunde
id: Jumlah ``nova-api`` permintaan setiap jam

source: The number of instances on each compute node
de: Anzahl der Instanzen auf jedem Compute-Knoten
id: Jumlah instance pada setiap node komputasi

source: The number of virtual machines (VMs) you expect to run, ``((overcommit fraction × cores) / virtual cores per instance)``
de: Die Anzahl der virtuellen Maschinen (VMs), die Sie voraussichtlich ausführen werden, ``((overcommit fraction × cores) / virtual cores per instance)````
id: Jumlah virtual machine (VM) yang Anda harapkan untuk dijalankan, ``((overcommit fraction × cores) / virtual cores per instance)`

source: The number of volumes in use
de: Die Anzahl der verwendeten Datenträger
id: Jumlah volume yang digunakan

source: The only thing the Image service does not store in a database is the image itself. The Image service database has two main tables:
de: Das Einzige, was der Abbild-Dienst nicht in einer Datenbank speichert, ist das Abbild selbst. Die Datenbank des Abbild-Dienstes hat zwei Haupttabellen:
id: Satu-satunya layanan Image tidak menyimpan dalam basis data adalah image itu sendiri. Basis data layanan image memiliki dua tabel utama:

source: The order you should upgrade services, and any changes from the general upgrade process is described below:
de: Die Reihenfolge, in der Sie die Dienste aktualisieren sollten, und alle Änderungen, die sich aus dem allgemeinen Upgrade-Prozess ergeben, werden im Folgenden beschrieben:
id: Urutan yang harus Anda upgrade layanan, dan setiap perubahan dari proses upgrade umum dijelaskan di bawah ini:

source: The other directories are titled ``instance-xxxxxxxx``. These directories correspond to instances running on that compute node. The files inside are related to one of the files in the ``_base`` directory. They're essentially differential-based files containing only the changes made from the original ``_base`` directory.
de: Die anderen Verzeichnisse tragen den Titel ``Instance-xxxxxxxxxxxxxx``. Diese Verzeichnisse entsprechen den Instanzen, die auf diesem Compute-Knoten ausgeführt werden. Die darin enthaltenen Dateien beziehen sich auf eine der Dateien im Verzeichnis ``_base``. Es handelt sich im Wesentlichen um differentiell basierte Dateien, die nur die Änderungen enthalten, die aus dem ursprünglichen ``_base`` Verzeichnis vorgenommen wurden.
id: Direktori lain berjudul ``instance-xxxxxxxx``. Direktori-direktori ini berhubungan dengan instance yang berjalan pada node komputasi itu. File-file di dalamnya terkait dengan salah satu file di direktori ``_base``. Mereka pada dasarnya adalah file berbasis diferensial yang hanya berisi perubahan yang dibuat dari direktori ``_base`` asli.

source: The output looks like the following:
de: Die Ausgabe sieht wie folgt aus:
id: Outputnya terlihat seperti berikut:

source: The output looks something like the following:
de: Die Ausgabe sieht in etwa wie folgt aus:
id: Outputnya terlihat seperti berikut:

source: The output of this command varies depending on the hypervisor because hypervisors support different attributes. The following demonstrates the difference between the two most popular hypervisors. Here is example output when the hypervisor is Xen:
de: Die Ausgabe dieses Befehls variiert je nach Hypervisor, da Hypervisoren verschiedene Attribute unterstützen. Der folgende Abschnitt zeigt den Unterschied zwischen den beiden beliebtesten Hypervisoren. Hier ist eine exemplarische Ausgabe, wenn der Hypervisor Xen ist:
id: Output dari perintah ini bervariasi tergantung pada hypervisor karena hypervisors mendukung atribut yang berbeda. Berikut ini menunjukkan perbedaan antara dua hypervisor paling populer. Berikut adalah contoh output ketika hypervisor adalah Xen:

source: The output shows that there are five compute nodes and one cloud controller. You see all the services in the up state, which indicates that the services are up and running. If a service is in a down state, it is no longer available. This is an indication that you should troubleshoot why the service is down.
de: Die Ausgabe zeigt, dass es fünf Compute-Knoten und einen Cloud-Controller gibt. Sie sehen alle Dienste im Zustand up, was bedeutet, dass die Dienste betriebsbereit sind. Wenn sich ein Dienst in einem ausgefallenen Zustand befindet, ist er nicht mehr verfügbar. Dies ist ein Hinweis darauf, dass Sie Fehler beheben sollten, warum der Dienst ausgefallen ist.
id: Output menunjukkan bahwa ada lima node komputasi dan satu pengendali cloud. Anda melihat semua layanan dalam status naik, yang menunjukkan bahwa layanan sudah berjalan dan berjalan. Jika suatu layanan dalam keadaan down, itu tidak lagi tersedia. Ini merupakan indikasi bahwa Anda harus memecahkan masalah mengapa layanan ini mati.

source: The output shows three different dnsmasq processes. The dnsmasq process that has the DHCP subnet range of 192.168.122.0 belongs to libvirt and can be ignored. The other two dnsmasq processes belong to ``nova-network``. The two processes are actually related—one is simply the parent process of the other. The arguments of the dnsmasq processes should correspond to the details you configured ``nova-network`` with.
de: Die Ausgabe zeigt drei verschiedene dnsmasq-Prozesse. Der dnsmasq-Prozess mit dem DHCP-Subnetzbereich von 192.168.122.0 gehört zu libvirt und kann ignoriert werden. Die beiden anderen dnsmasq-Prozesse gehören zum ``nova-network``. Die beiden Prozesse sind tatsächlich miteinander verbunden - einer ist einfach der übergeordnete Prozess des anderen. Die Argumente der dnsmasq-Prozesse sollten den Details entsprechen, mit denen Sie ``nova-network`` konfiguriert haben.
id: Output menunjukkan tiga proses dnsmasq yang berbeda. Proses dnsmasq yang memiliki rentang subnet DHCP 192.168.122.0 milik libvirt dan dapat diabaikan. Dua proses dnsmasq lainnya adalah milik ``nova-network``. Kedua proses itu sebenarnya saling terkait — yang satu hanyalah proses induk dari yang lain. Argumen proses dnsmasq harus sesuai dengan detail yang Anda konfigurasikan ``nova-network`` dengan.

source: The packet is then received on the network node. Note that any traffic to the l3-agent or dhcp-agent will be visible only within their network namespace. Watching any interfaces outside those namespaces, even those that carry the network traffic, will only show broadcast packets like Address Resolution Protocols (ARPs), but unicast traffic to the router or DHCP address will not be seen. See :ref:`dealing_with_network_namespaces` for detail on how to run commands within these namespaces.
de: Das Paket wird dann auf dem Netzwerkknoten empfangen. Beachten Sie, dass jeglicher Traffic zum l3-Agenten oder dhcp-Agenten nur innerhalb seines Netzwerk-Namensraums sichtbar ist. Wenn Sie Schnittstellen außerhalb dieser Namensräume überwachen, auch solche, die den Netzwerkverkehr übertragen, werden nur Broadcast-Pakete wie Address Resolution Protocols (ARPs) angezeigt, aber Unicast-Verkehr zum Router oder zur DHCP-Adresse wird nicht angezeigt. Siehe :ref:`dealing_with_network_namespaces` für Details darüber, wie Befehle innerhalb dieser Namensräume ausgeführt werden.
id: Paket tersebut kemudian diterima pada node jaringan. Perhatikan bahwa lalu lintas apa pun ke l3-agent atau dhcp-agent hanya akan terlihat dalam namespace jaringan mereka. Menonton antarmuka apa pun di luar namespace itu, bahkan yang membawa lalu lintas jaringan, hanya akan menampilkan paket siaran seperti Address Resolution Protocols (ARPs), tetapi lalu lintas unicast ke router atau alamat DHCP tidak akan terlihat. Lihat :ref:`dealing_with_network_namespaces` untuk detail tentang cara menjalankan perintah di dalam namespaces ini.

source: The packet then makes it to the l3-agent. This is actually another TAP device within the router's network namespace. Router namespaces are named in the form ``qrouter-<router-uuid>``. Running :command:`ip a` within the namespace will show the TAP device name, qr-e6256f7d-31 in this example:
de: Das Paket schafft es dann zum l3-Agenten. Dies ist eigentlich ein weiteres TAP-Gerät innerhalb des Netzwerk-Namensraums des Routers. Router-Namensräume werden in der Form ``qrouter-<router-uuid>`` benannt. Wenn Sie den :command:`ip a` innerhalb des Namensraums ausführen, wird der TAP-Gerätename qr-e6256f7d-31 in diesem Beispiel angezeigt:
id: Paket kemudian menuju ke l3-agent. Ini sebenarnya adalah perangkat TAP lain dalam namespace jaringan router. Namespace router diberi nama dalam bentuk ``qrouter- <router-uuid> ``. Menjalankan :command:`ip a` dalam namespace akan menampilkan nama perangkat TAP, qr-e6256f7d-31 dalam contoh ini:

source: The packet transfers to a Test Access Point (TAP) device on the compute host, such as tap690466bc-92. You can find out what TAP is being used by looking at the ``/etc/libvirt/qemu/instance-xxxxxxxx.xml`` file.
de: Das Paket wird zu einer Test Access Point (TAP)-Vorrichtung auf dem Rechenhost übertragen, wie z.B. tap690466bc-92. Sie können herausfinden, welches TAP verwendet wird, indem Sie sich die Datei ``/etc/libvirt/qemu/instance-xxxxxxxxxxxx.xml`` ansehen.
id: Paket transfer ke perangkat Test Access Point (TAP) pada host komputasi, seperti tap690466bc-92. Anda dapat mengetahui TAP apa yang sedang digunakan dengan melihat file ``/etc/libvirt/qemu/instance-xxxxxxxx.xml``.

source: The packet transfers to the main NIC of the compute node. You can also see this NIC in the :command:`brctl` output, or you can find it by referencing the ``flat_interface`` option in ``nova.conf``.
de: Das Paket wird an das Hauptnetzwerk des Compute-Knotens übertragen. Sie können diesen NIC auch im :command:`brctl` output sehen, oder Sie können ihn finden, indem Sie auf die Option ``flat_interface`` in ``nova.conf`` verweisen.
id: Paket transfer ke NIC utama dari node komputasi. Anda juga dapat melihat NIC ini dalam :command:`brctl` output, atau Anda dapat menemukannya dengan merujuk opsi ``flat_interface`` di ``nova.conf``.

source: The packet transfers to the virtual NIC of the compute host, such as, ``vnet1``. You can find out what vnet NIC is being used by looking at the ``/etc/libvirt/qemu/instance-xxxxxxxx.xml`` file.
de: Das Paket wird an das virtuelle NIC des Rechenhosts übertragen, z.B. ``vnet1``. Sie können herausfinden, welches vnet-NIC verwendet wird, indem Sie sich die Datei ``/etc/libvirt/qemu/instance-xxxxxxxxxxxx.xml`` ansehen.
id: Paket transfer ke NIC virtual host komputasi, seperti, ``vnet1``. Anda dapat mengetahui apa vnet NIC yang digunakan dengan melihat file ``/etc/libvirt/qemu/instance-xxxxxxxx.xml``.

source: The pip utility is used to manage package installation from the PyPI archive and is available in the python-pip package in most Linux distributions. While each OpenStack project has its own client, they are being deprecated in favour of a common OpenStack client. It is generally recommended to install the OpenStack client.
de: Das Pip-Utility wird zur Verwaltung der Paketinstallation aus dem PyPI-Archiv verwendet und ist im Python-Pip-Paket in den meisten Linux-Distributionen verfügbar. Obwohl jedes OpenStack-Projekt seinen eigenen Client hat, wird es zugunsten eines gemeinsamen OpenStack-Clients abgelehnt. Es wird generell empfohlen, den OpenStack-Client zu installieren.
id: Utilitas pip digunakan untuk mengelola instalasi paket dari arsip PyPI dan tersedia dalam paket python-pip di sebagian besar distribusi Linux. Sementara setiap proyek OpenStack memiliki klien sendiri, mereka tidak lagi digunakan untuk klien OpenStack yang umum. Umumnya disarankan untuk menginstal klien OpenStack.

source: The point we are trying to make here is that just because an option exists doesn't mean that option is relevant to your driver choices. Normally, the documentation notes which drivers the configuration applies to.
de: Der Punkt, den wir hier ansprechen wollen, ist, dass nur weil es eine Option gibt, nicht bedeutet, dass diese Option für Ihre Treiberauswahl relevant ist. Normalerweise ist in der Dokumentation vermerkt, für welche Treiber die Konfiguration gilt.
id: Poin yang kami coba sampaikan di sini adalah hanya karena ada opsi, tidak berarti opsi itu relevan dengan pilihan driver Anda. Biasanya, dokumentasi mencatat driver yang berlaku untuk konfigurasi.

source: The policy engine reads entries from the ``policy.json`` file. The actual location of this file might vary from distribution to distribution: for nova, it is typically in ``/etc/nova/policy.json``. You can update entries while the system is running, and you do not have to restart services. Currently, the only way to update such policies is to edit the policy file.
de: Die Richtlinien-Engine liest Einträge aus der Datei ``policy.json``. Der tatsächliche Speicherort dieser Datei kann von Distribution zu Distribution variieren: Für nova befindet sie sich typischerweise in ``/etc/nova/policy.json``. Sie können Einträge aktualisieren, während das System läuft, und Sie müssen die Dienste nicht neu starten. Derzeit besteht die einzige Möglichkeit, solche Richtlinien zu aktualisieren, darin, die Richtliniendatei zu bearbeiten.

source: The preceding information was generated by using a custom script that can be found on `GitHub <https://github.com/cybera/novac/blob/dev/libexec/novac-quota-report>`_.
de: Die vorhergehenden Informationen wurden mit einem benutzerdefinierten Skript generiert, das Sie unter `GitHub <https://github.com/cybera/novac/blob/dev/libexec/novac-quota-report>`_ finden.
id: Informasi sebelumnya dihasilkan dengan menggunakan skrip khusus yang dapat ditemukan di `GitHub <https://github.com/cybera/novac/blob/dev/libexec/novac-quota-report>`_.

source: The preceding output has been truncated to show only two services. You will see one service entry for each service that your cloud provides. Note how the endpoint domain can be different depending on the endpoint type. Different endpoint domains per type are not required, but this can be done for different reasons, such as endpoint privacy or network traffic segregation.
de: Die vorhergehende Ausgabe wurde gekürzt, um nur zwei Dienste anzuzeigen. Sie sehen einen Serviceeintrag für jeden Service, den Ihre Cloud anbietet. Beachten Sie, dass die Endpunktdomäne je nach Endpunkttyp unterschiedlich sein kann. Unterschiedliche Endpunktdomänen pro Typ sind nicht erforderlich, aber dies kann aus verschiedenen Gründen geschehen, wie z.B. Datenschutz am Endpunkt oder Trennung des Netzwerkverkehrs.
id: Output sebelumnya telah terpotong untuk hanya menampilkan dua layanan. Anda akan melihat satu entri layanan untuk setiap layanan yang disediakan cloud Anda. Perhatikan bagaimana domain endpoint dapat berbeda tergantung pada jenis endpoint. Domain endpoint yang berbeda per jenis tidak diperlukan, tetapi ini dapat dilakukan karena alasan yang berbeda, seperti privasi endpoint atau pemisahan lalu lintas jaringan.

source: The protocol that is matched by the security group rule. Valid values are ``null``, ``tcp``, ``udp``, ``icmp``, and ``icmpv6``.
de: Das Protokoll, das von der Sicherheitsgruppenregel übernommen wird. Gültige Werte sind ``null```, ``tcp``, ``udp```, ``icmp``, `icmp`` und ``icmpv6``.
id: Protokol yang dicocokkan dengan aturan grup keamanan. Nilai yang valid adalah ``null``, ``tcp``, ``udp``, ``icmp``, dan ``icmpv6``.

source: The public security domain can refer to the internet as a whole or networks over which you have no authority. This domain is considered untrusted. For example, in a hybrid cloud deployment, any information traversing between and beyond the clouds is in the public domain and untrustworthy.
de: Der Bereich der öffentlichen Sicherheit kann sich auf das Internet als Ganzes oder auf Netzwerke beziehen, über die Sie keine Autorität haben. Diese Domain gilt als nicht vertrauenswürdig. Beispielsweise sind bei einer hybriden Cloud-Bereitstellung alle Informationen, die zwischen und über die Clouds hinausgehen, öffentlich zugänglich und nicht vertrauenswürdig.
id: Domain keamanan publik dapat merujuk ke internet secara keseluruhan atau jaringan di mana Anda tidak memiliki wewenang. Domain ini dianggap tidak tepercaya. Misalnya, dalam penyebaran cloud hybrid, setiap informasi yang melintasi antara dan di luar cloud berada dalam domain publik dan tidak dapat dipercaya.

source: The purpose of automatic configuration management is to establish and maintain the consistency of a system without using human intervention. You want to maintain consistency in your deployments so that you can have the same cloud every time, repeatably. Proper use of automatic configuration-management tools ensures that components of the cloud systems are in particular states, in addition to simplifying deployment, and configuration change propagation.
de: Der Zweck des automatischen Konfigurationsmanagements ist es, die Konsistenz eines Systems ohne menschliches Zutun herzustellen und aufrechtzuerhalten. Sie möchten die Konsistenz Ihrer Implementierungen aufrechterhalten, damit Sie jedes Mal die gleiche Cloud haben, wiederholbar. Der richtige Einsatz von automatischen Konfigurationsmanagement-Tools stellt sicher, dass Komponenten der Cloud-Systeme in bestimmten Zuständen sind, und vereinfacht die Bereitstellung und Verbreitung von Konfigurationsänderungen.
id: Tujuan dari manajemen konfigurasi otomatis adalah untuk membangun dan memelihara konsistensi sistem tanpa menggunakan intervensi manusia. Anda ingin mempertahankan konsistensi dalam penerapan Anda sehingga Anda dapat memiliki cloud yang sama setiap saat, berulang-ulang. Penggunaan yang tepat dari alat manajemen konfigurasi otomatis memastikan bahwa komponen sistem cloud berada dalam kondisi tertentu, selain menyederhanakan deployment, dan propagasi perubahan konfigurasi.

source: The purpose of the screen windows are as follows:
de: Die Bildschirmfenster haben folgenden Zweck:
id: Tujuan dari layar windows adalah sebagai berikut:
