Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: As an administrative user, you can update the Compute service quotas for an existing tenant, as well as update the quota defaults for a new tenant. See :ref:`table_compute_quota`.
de: Als administrativer Benutzer können Sie die Compute Service Quoten für einen bestehenden Mandanten aktualisieren sowie die Quotenvorgaben für einen neuen Mandanten aktualisieren. Siehe :ref:`table_compute_quota`.
id: Sebagai pengguna administratif, Anda dapat memperbarui kuota layanan Compute untuk penyewa yang ada, serta memperbarui kuota default untuk penyewa baru. Lihat :ref:`table_compute_quota`.

source: As an administrative user, you can use the :command:`cinder quota-*` commands, which are provided by the ``python-cinderclient`` package, to view and update tenant quotas.
de: Als administrativer Benutzer können Sie die Befehle :command:`cinder quota-*`, die vom Paket ``python-cinderclient`` bereitgestellt werden, verwenden, um Mandantenquoten anzuzeigen und zu aktualisieren.
id: Sebagai pengguna administratif, Anda dapat menggunakan perintah :command:`cinder quota-*`, yang disediakan oleh paket ``python-cinderclient``, untuk melihat dan memperbarui kuota tenant.

source: As an administrative user, you can use the :command:`nova quota-*` commands, which are provided by the ``python-novaclient`` package, to view and update tenant quotas.
de: Als administrativer Benutzer können Sie die Befehle :command:`nova quota-*`, die vom Paket ``python-novaclient`` bereitgestellt werden, verwenden, um Mandantenquoten anzuzeigen und zu aktualisieren.
id: Sebagai pengguna administratif, Anda dapat menggunakan perintah :command:`nova quota-*`, yang disediakan oleh paket ``python-novaclient``, untuk melihat dan memperbarui kuota penyewa.

source: As an administrator, you have a few ways to discover what your OpenStack cloud looks like simply by using the OpenStack tools available. This section gives you an idea of how to get an overview of your cloud, its shape, size, and current state.
de: Als Administrator haben Sie einige Möglichkeiten, um herauszufinden, wie Ihre OpenStack-Cloud aussieht, indem Sie einfach die verfügbaren OpenStack-Tools verwenden. Dieser Abschnitt gibt Ihnen eine Vorstellung davon, wie Sie sich einen Überblick über Ihre Cloud, ihre Form, Größe und den aktuellen Zustand verschaffen können.
id: Sebagai administrator, Anda memiliki beberapa cara untuk menemukan seperti apa cloud OpenStack Anda hanya dengan menggunakan alat OpenStack yang tersedia. Bagian ini memberi Anda gambaran tentang cara mendapatkan ikhtisar cloud, bentuk, ukuran, dan kondisi saat ini.

source: As an example, recording ``nova-api`` usage can allow you to track the need to scale your cloud controller. By keeping an eye on ``nova-api`` requests, you can determine whether you need to spawn more ``nova-api`` processes or go as far as introducing an entirely new server to run ``nova-api``. To get an approximate count of the requests, look for standard INFO messages in ``/var/log/nova/nova-api.log``:
de: Als Beispiel kann die Aufzeichnung der ``nova-api`` Nutzung ermöglichen, dass Sie die Notwendigkeit der Skalierung Ihres Cloud Controllers verfolgen können. Indem Sie die Anfragen von ``nova-api`` im Auge behalten, können Sie bestimmen, ob Sie weitere ``nova-api`` Prozesse erzeugen müssen oder sogar einen völlig neuen Server für den Betrieb von ``nova-api`` einführen. Um eine ungefähre Anzahl der Anfragen zu erhalten, suchen Sie nach Standard INFO-Meldungen in ``/var/log/nova/nova/nova-api.log``:
id: Sebagai contoh, merekam penggunaan ``nova-api`` dapat memungkinkan Anda untuk melacak kebutuhan untuk meningkatkan skala pengontrol cloud Anda. Dengan mengawasi permintaan ``nova-api``, Anda dapat menentukan apakah Anda perlu menelurkan (spawn) lebih banyak proses ``nova-api`` atau sejauh memperkenalkan server yang sama sekali baru untuk menjalankan ``nova-api`` . Untuk mendapatkan perkiraan jumlah permintaan, cari pesan INFO standar di ``/var/log/nova/nova-api.log``:

source: As an open source project, one of the unique aspects of OpenStack is that it has many different levels at which you can begin to engage with it—you don't have to do everything yourself.
de: Als Open-Source-Projekt ist einer der einzigartigen Aspekte von OpenStack, dass es viele verschiedene Ebenen hat, auf denen man sich damit beschäftigen kann - man muss nicht alles selbst machen.

source: As for your initial deployment, you should ensure that all hardware is appropriately burned in before adding it to production. Run software that uses the hardware to its limits—maxing out RAM, CPU, disk, and network. Many options are available, and normally double as benchmark software, so you also get a good idea of the performance of your system.
de: Wie bei Ihrer ersten Bereitstellung sollten Sie sicherstellen, dass die gesamte Hardware ordnungsgemäß eingebrannt ist, bevor Sie sie der Produktion hinzufügen. Führen Sie Software aus, die die Hardware bis an ihre Grenzen ausnutzt - bis hin zu RAM, CPU, Festplatte und Netzwerk. Viele Optionen sind verfügbar und dienen in der Regel als Benchmark-Software, so dass Sie sich auch ein gutes Bild von der Leistung Ihres Systems machen können.
id: Apapun penyebaran awal Anda, Anda harus memastikan bahwa semua perangkat keras dibakar (burned) secara tepat sebelum menambahkannya ke produksi. Jalankan perangkat lunak yang menggunakan perangkat keras hingga batasnya — memaksimalkan RAM, CPU, disk, dan jaringan. Banyak pilihan yang tersedia, dan biasanya berfungsi ganda sebagai perangkat lunak benchmark, jadi Anda juga mendapatkan ide bagus tentang kinerja sistem Anda.

source: As mentioned, there's currently no way to cleanly migrate from ``nova-network`` to neutron. We recommend that you keep a migration in mind and what that process might involve for when a proper migration path is released.
de: Wie bereits erwähnt, gibt es derzeit keine Möglichkeit, sauber vom ``Nova-Netzwerk``zum Neutron zu migrieren. Wir empfehlen Ihnen, eine Migration im Auge zu behalten und zu berücksichtigen, was dieser Prozess beinhalten könnte, wenn ein geeigneter Migrationspfad freigegeben wird.
id: Seperti yang disebutkan, saat ini tidak ada cara untuk bermigrasi secara bersih dari ``nova-network`` ke neutron. Kami menyarankan Anda mengingat migrasi dan apa proses yang mungkin terlibat ketika jalur migrasi yang tepat dirilis.

source: As noted in the previous chapter, the number of rules per security group is controlled by the ``quota_security_group_rules``, and the number of allowed security groups per project is controlled by the ``quota_security_groups`` quota.
de: Wie im vorherigen Kapitel erwähnt, wird die Anzahl der Regeln pro Sicherheitsgruppe durch die ``quota_security_group_rules`` gesteuert, und die Anzahl der zulässigen Sicherheitsgruppen pro Projekt wird durch die ``quota_security_groups`` Quota gesteuert.
id: Seperti disebutkan dalam bab sebelumnya, jumlah aturan per grup keamanan dikendalikan oleh ``quota_security_group_rules``, dan jumlah grup keamanan yang diizinkan per proyek dikontrol oleh kuota ``quota_security_groups``.

source: As soon as this setting was fixed, everything worked.
de: Sobald diese Einstellung behoben war, funktionierte alles.
id: Segera setelah pengaturan ini diperbaiki, semuanya bekerja.

source: As this would be the server's bonded NIC.
de: Da dies die gebundene NIC des Servers wäre.
id: Karena ini akan menjadi NIC yang terikat pada server.

source: As with most architecture choices, the right answer depends on your environment. If you are using existing hardware, you know the disk density of your servers and can determine some decisions based on the options above. If you are going through a procurement process, your user's requirements also help you determine hardware purchases. Here are some examples from a private cloud providing web developers custom environments at AT&T. This example is from a specific deployment, so your existing hardware or procurement opportunity may vary from this. AT&T uses three types of hardware in its deployment:
de: Wie bei den meisten Architekturentscheidungen hängt die richtige Antwort von Ihrer Umgebung ab. Wenn Sie vorhandene Hardware verwenden, kennen Sie die Festplattendichte Ihrer Server und können einige Entscheidungen basierend auf den oben genannten Optionen treffen. Wenn Sie einen Beschaffungsprozess durchlaufen, helfen Ihnen die Anforderungen Ihres Benutzers auch bei der Bestimmung des Hardwarekaufs. Hier sind einige Beispiele aus einer privaten Cloud, die Webentwicklern benutzerdefinierte Umgebungen bei AT&T bietet. Dieses Beispiel stammt aus einem bestimmten Einsatz, so dass Ihre vorhandene Hardware oder Beschaffungsmöglichkeit davon abweichen kann. AT&T verwendet bei der Bereitstellung drei Arten von Hardware:

source: As with other removable disk technology, it is important that the operating system is not trying to make use of the disk before removing it. On Linux instances, this typically involves unmounting any file systems mounted from the volume. The OpenStack volume service cannot tell whether it is safe to remove volumes from an instance, so it does what it is told. If a user tells the volume service to detach a volume from an instance while it is being written to, you can expect some level of file system corruption as well as faults from whatever process within the instance was using the device.
de: Wie bei anderen Wechselplattentechnologien ist es wichtig, dass das Betriebssystem nicht versucht, die Festplatte zu nutzen, bevor es sie entfernt. Bei Linux-Instanzen bedeutet dies in der Regel, dass alle Dateisysteme, die vom Datenträger gemountet sind, entfernt werden. Der OpenStack-Datenträger-Dienst kann nicht sagen, ob es sicher ist, Datenträger aus einer Instanz zu entfernen, also tut er, was ihm gesagt wird. Wenn ein Benutzer den Datenträger-Dienst anweist, ein Datenträger von einer Instanz zu trennen, während es geschrieben wird, können Sie eine gewisse Beschädigung des Dateisystems sowie Fehler von jedem Prozess innerhalb der Instanz erwarten, der das Gerät verwendet hat.
id: Seperti halnya teknologi removable disk lainnya, penting agar sistem operasi tidak mencoba memanfaatkan disk sebelum melepasnya. Pada instance Linux, ini biasanya melibatkan unmount sistem file yang dipasang dari volume. Layanan volume OpenStack tidak dapat memastikan apakah aman untuk menghapus volume dari sebuah instance, sehingga ia melakukan apa yang diperintahkan. Jika pengguna memberi tahu layanan volume untuk melepaskan volume dari instance saat sedang ditulis, Anda dapat mengharapkan beberapa tingkat kerusakan sistem file serta kesalahan dari proses apa pun dalam instance yang menggunakan perangkat.

source: As your cloud grows, MySQL is utilized more and more. If you suspect that MySQL might be becoming a bottleneck, you should start researching MySQL optimization. The MySQL manual has an entire section dedicated to this topic: `Optimization Overview <https://dev.mysql.com/doc/refman/5.5/en/optimize-overview.html>`_.
de: Wenn Ihre Cloud wächst, wird MySQL immer häufiger eingesetzt. Wenn Sie vermuten, dass MySQL zu einem Engpass werden könnte, sollten Sie mit der Erforschung der MySQL-Optimierung beginnen. Das MySQL-Handbuch hat einen ganzen Abschnitt, der diesem Thema gewidmet ist: `Optimierungsübersicht <https://dev.mysql.com/doc/refman/5.5/en/optimize-overview.html>`_.
id: Seiring cloud Anda tumbuh, MySQL semakin banyak digunakan. Jika Anda mencurigai bahwa MySQL mungkin menjadi hambatan, Anda harus mulai meneliti optimasi MySQL. Manual MySQL memiliki seluruh bagian yang didedikasikan untuk topik ini: `Optimization Overview <https://dev.mysql.com/doc/refman/5.5/en/optimize-overview.html>`_.

source: As your focus turns to stable operations, we recommend that you do skim this guide to get a sense of the content. Some of this content is useful to read in advance so that you can put best practices into effect to simplify your life in the long run. Other content is more useful as a reference that you might turn to when an unexpected event occurs (such as a power failure), or to troubleshoot a particular problem.
de: Wenn Sie sich auf einen stabilen Betrieb konzentrieren, empfehlen wir Ihnen, diesen Leitfaden zu lesen, um einen Überblick über den Inhalt zu erhalten. Einige dieser Inhalte sind nützlich, um sie im Voraus zu lesen, so dass Sie Best Practices umsetzen können, um Ihr Leben auf lange Sicht zu vereinfachen. Andere Inhalte sind eher als Referenz nützlich, an die Sie sich wenden können, wenn ein unerwartetes Ereignis eintritt (z.B. ein Stromausfall) oder um ein bestimmtes Problem zu beheben.
id: Saat fokus Anda beralih ke operasi yang stabil, kami sarankan Anda membaca panduan ini untuk memahami kontennya. Beberapa konten ini bermanfaat untuk dibaca terlebih dahulu sehingga Anda dapat menerapkan praktik terbaik untuk menyederhanakan hidup Anda dalam jangka panjang. Konten lain lebih bermanfaat sebagai referensi yang dapat Anda gunakan ketika terjadi peristiwa tak terduga (seperti listrik mati), atau memecahkan masalah tertentu.

source: Aside from connection failures, RabbitMQ log files are generally not useful for debugging OpenStack related issues. Instead, we recommend you use the RabbitMQ web management interface. Enable it on your cloud controller:
de: Abgesehen von Verbindungsausfällen sind RabbitMQ-Protokolldateien im Allgemeinen nicht nützlich für die Fehlersuche bei OpenStack-bezogenen Problemen. Stattdessen empfehlen wir Ihnen, die Web-Management-Schnittstelle von RabbitMQ zu verwenden. Aktivieren Sie es auf Ihrem Cloud-Controller:
id: Selain dari kegagalan koneksi, file log RabbitMQ umumnya tidak berguna untuk debugging masalah terkait OpenStack. Sebagai gantinya, kami sarankan Anda menggunakan antarmuka manajemen web RabbitMQ. Aktifkan di pengontrol cloud Anda:

source: Aside from the creation and termination of VMs, you must consider the impact of users accessing the service particularly on ``nova-api`` and its associated database. Listing instances garners a great deal of information and, given the frequency with which users run this operation, a cloud with a large number of users can increase the load significantly. This can occur even without their knowledge. For example, leaving the OpenStack dashboard instances tab open in the browser refreshes the list of VMs every 30 seconds.
de: Abgesehen von der Erstellung und Beendigung von VMs müssen Sie die Auswirkungen von Benutzern, die auf den Dienst zugreifen, insbesondere auf ``nova-api`` und die zugehörige Datenbank berücksichtigen. Listing-Instanzen liefern eine Vielzahl von Informationen, und angesichts der Häufigkeit, mit der Benutzer diesen Vorgang ausführen, kann eine Cloud mit einer großen Anzahl von Benutzern die Last deutlich erhöhen. Dies kann auch ohne ihr Wissen geschehen. Wenn Sie beispielsweise die Registerkarte OpenStack Dashboard-Instanzen im Browser geöffnet lassen, wird die Liste der VMs alle 30 Sekunden aktualisiert.
id: Selain pembuatan dan penghentian VM, Anda harus mempertimbangkan dampak dari pengguna yang mengakses layanan khususnya pada ``nova-api`` dan database terkaitnya. Mendaftar instance mengumpulkan banyak informasi dan, mengingat frekuensi pengguna menjalankan operasi ini, cloud dengan sejumlah besar pengguna dapat meningkatkan beban secara signifikan. Ini dapat terjadi bahkan tanpa sepengetahuan mereka. Misalnya, membiarkan tab instance dasbor OpenStack terbuka di browser menyegarkan daftar VM setiap 30 detik.

source: Aside from the direct-to-blueprint pathway, there is another very well-regarded mechanism to influence the development roadmap: the user survey. Found at `OpenStack User Survey <https://www.openstack.org/user-survey/>`_, it allows you to provide details of your deployments and needs, anonymously by default. Each cycle, the user committee analyzes the results and produces a report, including providing specific information to the technical committee and project team leads.
de: Neben dem Direct-to-Blueprint-Pfad gibt es noch einen weiteren sehr angesehenen Mechanismus, der die Entwicklungs-Roadmap beeinflusst: die Benutzerbefragung. Sie finden es unter `OpenStack User Survey <https://www.openstack.org/user-survey/>`_ und können Details zu Ihren Implementierungen und Anforderungen angeben, standardmäßig anonym. In jedem Zyklus analysiert das Benutzerkomitee die Ergebnisse und erstellt einen Bericht, einschließlich spezifischer Informationen für den technischen Ausschuss und die Projektteamleiter.
id: Selain dari jalur direct-to-blueprint, ada mekanisme lain yang sangat dipertimbangkan untuk memengaruhi roadmap pengembangan: survei pengguna. Ditemukan di `OpenStack User Survey <https://www.openstack.org/user-survey/>` _, ini memungkinkan Anda untuk memberikan rincian penyebaran dan kebutuhan Anda, secara anonim secara default. Setiap siklus, komite pengguna menganalisis hasil dan menghasilkan laporan, termasuk memberikan informasi spesifik kepada komite teknis dan pimpinan tim proyek.

source: Aspects to Watch
de: Zu beachtende Aspekte
id: Aspects to Watch (aspek untuk dilihat)

source: Assign a lost IPv4 address back to a project
de: Weisen Sie einem Projekt eine verlorene IPv4-Adresse wieder zu
id: Mengangkat alamat IPv4 yang hilang kembali ke proyek

source: Associating Security Groups
de: Zuordnen von Sicherheitsgruppen

source: Associating Users with Projects
de: Zuordnen von Benutzern zu Projekten

source: Associating existing users with an additional project or removing them from an older project is done from the :guilabel:`Projects` page of the dashboard by selecting :guilabel:`Manage Members` from the :guilabel:`Actions` column, as shown in the screenshot below.
de: Das Zuordnen vorhandener Benutzer zu einem zusätzlichen Projekt oder das Entfernen aus einem älteren Projekt erfolgt über die Seite :guilabel:`Projekte` des Dashboards, indem Sie :guilabel:`Mitglieder verwalten` aus der Spalte :guilabel:`Aktionen` auswählen, wie im Screenshot unten gezeigt.

source: At that time, our control services were hosted by another team and we didn't have much debugging information to determine what was going on with the master, and we could not reboot it. That team noted that it failed without alert, but managed to reboot it. After an hour, the cluster had returned to its normal state and we went home for the day.
de: Zu dieser Zeit wurden unsere Kontrolldienste von einem anderen Team gehostet, und wir hatten nicht viele Debugging-Informationen, um festzustellen, was mit dem Master vor sich ging, und wir konnten ihn nicht neu starten. Dieses Team bemerkte, dass es ohne Warnung fehlgeschlagen war, konnte es aber neu starten. Nach einer Stunde war das Cluster wieder in den Normalzustand zurückgekehrt und wir fuhren für den Tag nach Hause.
id: Pada saat itu, layanan kontrol kami dihosting oleh tim lain dan kami tidak memiliki banyak informasi debug untuk menentukan apa yang terjadi dengan master, dan kami tidak dapat mem-boot ulang. Tim itu mencatat bahwa ia gagal tanpa peringatan, tetapi berhasil mem-boot ulangnya. Setelah satu jam, gugus telah kembali ke keadaan normal dan kami pulang untuk hari itu.

source: At the data center, I was finishing up some tasks and remembered the lock-up. I logged into the new instance and ran :command:`ps aux` again. It worked. Phew. I decided to run it one more time. It locked up.
de: Im Rechenzentrum erledigte ich einige Aufgaben und erinnerte mich an das Lock-up. Ich habe mich in die neue Instanz eingeloggt und :command:`ps aux` erneut ausgeführt. Es hat funktioniert. Puh. Ich beschloss, es noch einmal auszuführen. Es hat sich abgeschlossen.
id: Di pusat data, saya menyelesaikan beberapa tugas dan mengingat pengunciannya. Saya masuk ke instance baru dan menjalankan: command: `ps aux` lagi. Itu berhasil. Fiuh. Saya memutuskan untuk menjalankannya sekali lagi. Terkunci.

source: At the end of 2012, Cybera (a nonprofit with a mandate to oversee the development of cyberinfrastructure in Alberta, Canada) deployed an updated OpenStack cloud for their `DAIR project <https://www.canarie.ca/cloud/>`_. A few days into production, a compute node locks up. Upon rebooting the node, I checked to see what instances were hosted on that node so I could boot them on behalf of the customer. Luckily, only one instance.
de: Ende 2012 implementierte Cybera (ein gemeinnütziger Verein mit dem Auftrag, die Entwicklung der Cyberinfrastruktur in Alberta, Kanada, zu überwachen) eine aktualisierte OpenStack-Cloud für ihr `DAIR-Projekt <https://www.canarie.ca/cloud/>`_. Ein paar Tage nach der Produktion schließt ein Compute-Knoten. Beim Neustart des Knotens überprüfte ich, welche Instanzen auf diesem Knoten gehostet wurden, damit ich sie im Namen des Kunden starten konnte. Glücklicherweise nur eine Instanz.
id: Pada akhir 2012, Cybera (sebuah organisasi nirlaba dengan mandat untuk mengawasi pengembangan infrastruktur cyber di Alberta, Kanada) mengerahkan OpenStack cloud yang diperbarui untuk proyek mereka `DAIR project <https://www.canarie.ca/cloud/>` _ . Beberapa hari setelah produksi, sebuah node komputasi terkunci. Setelah me-reboot node, saya memeriksa untuk melihat instance apa yang di-host pada node itu sehingga saya bisa mem-bootnya atas nama pelanggan. Untungnya, hanya satu instance.

source: At the end of August 2012, a post-secondary school in Alberta, Canada migrated its infrastructure to an OpenStack cloud. As luck would have it, within the first day or two of it running, one of their servers just disappeared from the network. Blip. Gone.
de: Ende August 2012 migrierte eine postsekundäre Schule in Alberta, Kanada, ihre Infrastruktur in eine OpenStack-Cloud. Wie der Zufall es wollte, verschwand innerhalb der ersten ein oder zwei Tage einer ihrer Server einfach aus dem Netzwerk. Blip. Weg.
id: Pada akhir Agustus 2012, sebuah sekolah pasca sekolah menengah di Alberta, Kanada memigrasikan infrastrukturnya ke cloud OpenStack. Seperti keberuntungan, dalam hari pertama atau kedua berjalan, salah satu server mereka hilang dari jaringan. Blip. Hilang.

source: At the same time of finding the bug report, a co-worker was able to successfully reproduce The Issue! How? He used ``iperf`` to spew a ton of bandwidth at an instance. Within 30 minutes, the instance just disappeared from the network.
de: Gleichzeitig mit dem Auffinden des Fehlerberichts konnte ein Mitarbeiter Das Problem erfolgreich reproduzieren. Wie? Er benutzte ``iperf``, um eine Tonne Bandbreite in einer Instanz auszuspucken. Innerhalb von 30 Minuten verschwand die Instanz einfach aus dem Netzwerk.
id: Pada saat yang sama menemukan laporan bug, rekan kerja berhasil mereproduksi The Issue! How? Dia menggunakan ``iperf`` untuk memuntahkan satu ton bandwidth pada sebuah instance. Dalam 30 menit, instance baru saja menghilang dari jaringan.
