Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: We wrote this book because we have deployed and maintained OpenStack clouds for at least a year and we wanted to share this knowledge with others. After months of being the point people for an OpenStack cloud, we also wanted to have a document to hand to our system administrators so that they'd know how to operate the cloud on a daily basis—both reactively and pro-actively. We wanted to provide more detailed technical information about the decisions that deployers make along the way.
de: Wir haben dieses Buch geschrieben, weil wir OpenStack-Clouds seit mindestens einem Jahr einsetzen und pflegen und dieses Wissen mit anderen teilen wollten. Nachdem wir monatelang die ersten Ansprechpartner für eine OpenStack-Cloud waren, wollten wir auch ein Dokument an unsere Systemadministratoren übergeben, damit sie wissen, wie man die Cloud täglich betreibt - sowohl reaktiv als auch proaktiv. Wir wollten detailliertere technische Informationen über die Entscheidungen liefern, die die Deployments dabei treffen.

source: We wrote this book in a book sprint, which is a facilitated, rapid development production method for books. For more information, see the `BookSprints site <https://www.booksprints.net/>`_. Your authors cobbled this book together in five days during February 2013, fueled by caffeine and the best takeout food that Austin, Texas, could offer.
de: Wir haben dieses Buch in einem Buchsprint geschrieben, der eine vereinfachte, schnelle Entwicklungsproduktionsmethode für Bücher ist. Weitere Informationen finden Sie auf der `BookSprints-Seite <https://www.booksprints.net/>`_. Ihre Autoren haben dieses Buch in fünf Tagen im Februar 2013 zusammengeschustert, angetrieben von Koffein und dem besten Takeout-Lebensmittel, das Austin, Texas, anbieten konnte.

source: We wrote this book to help you:
de: Wir haben dieses Buch geschrieben, um Ihnen zu helfen:

source: Weekly
de: Wöchentlich
id: Mingguan

source: What to Back Up
de: Was zu sichern ist
id: Yang Harus Dicadangkan

source: What to do when things are running slowly
de: Was tun, wenn die Dinge langsam laufen
id: Apa yang harus dilakukan ketika segalanya berjalan lambat

source: When adding a new security group, you should pick a descriptive but brief name. This name shows up in brief descriptions of the instances that use it where the longer description field often does not. Seeing that an instance is using security group ``http`` is much easier to understand than ``bobs_group`` or ``secgrp1``.
de: Wenn Sie eine neue Sicherheitsgruppe hinzufügen, sollten Sie einen beschreibenden, aber kurzen Namen wählen. Dieser Name erscheint in Kurzbeschreibungen der Instanzen, die ihn verwenden, wo das längere Beschreibungsfeld dies oft nicht tut. Zu sehen, dass eine Instanz die Sicherheitsgruppe ``http`` verwendet, ist viel einfacher zu verstehen als `bobs_group`` oder ``secgrp1``.
id: Saat menambahkan grup keamanan baru, Anda harus memilih nama yang deskriptif tapi singkat. Nama ini muncul dalam deskripsi singkat tentang contoh yang menggunakannya di mana bidang deskripsi yang lebih panjang sering tidak. Melihat sebuah instance menggunakan grup keamanan ``http`` lebih mudah dipahami daripada ``bobs_group`` atau ``secgrp1``.

source: When an instance fails to behave properly, you will often have to trace activity associated with that instance across the log files of various ``nova-*`` services and across both the cloud controller and compute nodes.
de: Wenn sich eine Instanz nicht ordnungsgemäß verhält, müssen Sie oft die mit dieser Instanz verbundenen Aktivitäten über die Protokolldateien verschiedener ``nova-*``Dienste und sowohl über den Cloud Controller als auch über Compute-Knoten verfolgen.
id: Ketika sebuah instance gagal untuk berperilaku dengan benar, Anda akan sering harus melacak aktivitas yang terkait dengan instance tersebut di seluruh file log dari berbagai layanan ``nova- * `` dan di seluruh cloud controller dan compute nodes.

source: When booting a server, you can also add arbitrary metadata so that you can more easily identify it among other running instances. Use the ``--property`` option with a key-value pair, where you can make up the string for both the key and the value. For example, you could add a description and also the creator of the server:
de: Beim Booten eines Servers können Sie auch beliebige Metadaten hinzufügen, um sie leichter zwischen anderen laufenden Instanzen identifizieren zu können. Verwenden Sie die Option ``--property`` mit einem Schlüssel-Wert-Paar, wo Sie die Zeichenkette sowohl für den Schlüssel als auch für den Wert zusammensetzen können. Sie können z.B. eine Beschreibung und auch den Ersteller des Servers hinzufügen:

source: When debugging DNS issues, start by making sure that the host where the dnsmasq process for that instance runs is able to correctly resolve. If the host cannot resolve, then the instances won't be able to either.
de: Wenn Sie DNS-Probleme debuggen, stellen Sie zunächst sicher, dass der Host, auf dem der dnsmasq-Prozess für diese Instanz läuft, in der Lage ist, diese korrekt zu lösen. Wenn der Host nicht auflösen kann, dann können es auch die Instanzen nicht.
id: Ketika men-debug masalah DNS, mulailah dengan memastikan bahwa host tempat proses dnsmasq untuk instance berjalan dapat menyelesaikan dengan benar. Jika host tidak dapat menyelesaikan, maka instance tidak akan bisa baik.

source: When deploying OpenStack in an enterprise as a private cloud, it is usually behind the firewall and within the trusted network alongside existing systems. Users are employees that are bound by the company security requirements. This tends to drive most of the security domains towards a more trusted model. However, when deploying OpenStack in a public facing role, no assumptions can be made and the attack vectors significantly increase.
de: Wenn OpenStack in einem Unternehmen als private Cloud bereitgestellt wird, befindet es sich in der Regel hinter der Firewall und im vertrauenswürdigen Netzwerk neben bestehenden Systemen. Benutzer sind Mitarbeiter, die an die Sicherheitsanforderungen des Unternehmens gebunden sind. Dies führt dazu, dass die meisten Sicherheitsbereiche zu einem vertrauenswürdigeren Modell tendieren. Wenn OpenStack jedoch in einer öffentlich zugänglichen Rolle eingesetzt wird, können keine Annahmen getroffen werden und die Angriffsvektoren steigen deutlich an.
id: Ketika menggunakan OpenStack di perusahaan sebagai cloud pribadi, biasanya di balik firewall dan di dalam jaringan tepercaya bersama sistem yang ada. Pengguna adalah karyawan yang terikat oleh persyaratan keamanan perusahaan. Ini cenderung mendorong sebagian besar domain keamanan ke arah model yang lebih tepercaya. Namun, ketika menggunakan OpenStack dalam peran publik, tidak ada asumsi yang dapat dibuat dan vektor serangan meningkat secara signifikan.

source: When operating an OpenStack cloud, you may discover that your users can be quite demanding. If OpenStack doesn't do what your users need, it may be up to you to fulfill those requirements. This chapter provided you with some options for customization and gave you the tools you need to get started.
de: Beim Betrieb einer OpenStack-Cloud können Sie feststellen, dass Ihre Benutzer sehr anspruchsvoll sein können. Wenn OpenStack nicht das tut, was Ihre Benutzer benötigen, liegt es vielleicht an Ihnen, diese Anforderungen zu erfüllen. In diesem Kapitel finden Sie einige Optionen zur Anpassung und die Tools, die Sie für den Einstieg benötigen.
id: Saat mengoperasikan cloud OpenStack, Anda mungkin menemukan bahwa pengguna Anda bisa sangat menuntut. Jika OpenStack tidak melakukan apa yang dibutuhkan pengguna Anda, mungkin terserah Anda untuk memenuhi persyaratan itu. Bab ini memberi Anda beberapa opsi untuk penyesuaian dan memberi Anda alat yang Anda butuhkan untuk memulai.

source: When the :command:`fsfreeze -f` command is issued, all ongoing transactions in the file system are allowed to complete, new write system calls are halted, and other calls that modify the file system are halted. Most importantly, all dirty data, metadata, and log information are written to disk.
de: Wenn der Befehl :command:`fsfsfreeze -f` ausgegeben wird, dürfen alle laufenden Transaktionen im Dateisystem abgeschlossen werden, neue Schreibsystemaufrufe werden gestoppt und andere Aufrufe, die das Dateisystem verändern, gestoppt. Am wichtigsten ist, dass alle schmutzigen Daten, Metadaten und Protokollinformationen auf die Festplatte geschrieben werden.

source: When the node is able to rejoin the cluster, just add it back to the ring. The exact syntax you use to add a node to your swift cluster with ``swift-ring-builder`` heavily depends on the original options used when you originally created your cluster. Please refer back to those commands.
de: Wenn der Knoten in der Lage ist, dem Cluster wieder beizutreten, fügen Sie ihn einfach wieder dem Ring hinzu. Die genaue Syntax, mit der Sie mit dem ``swift-ring-builder`` einen Knoten zu Ihrem schnellen Cluster hinzufügen, hängt stark von den ursprünglichen Optionen ab, die bei der ursprünglichen Erstellung Ihres Clusters verwendet wurden. Bitte lesen Sie diese Befehle noch einmal durch.
id: Ketika node dapat bergabung kembali dengan cluster, tambahkan saja kembali ke ring. Sintaks yang tepat yang Anda gunakan untuk menambahkan node ke cluster swift Anda dengan ``swift-ring-builder`` sangat tergantung pada opsi asli yang digunakan saat Anda awalnya membuat cluster Anda. Silakan merujuk kembali ke perintah itu.

source: When the snapshot is done, you can thaw the file system with the following command, as root, inside of the instance:
de: Wenn die Schattenkopie fertig ist, können Sie das Dateisystem mit dem folgenden Befehl als root innerhalb der Instanz auftauen:

source: When this node fully booted, I ran through the same scenario of seeing what instances were running so I could turn them back on. There were a total of four. Three booted and one gave an error. It was the same error as before: unable to find the backing disk. Seriously, what?
de: Als dieser Knoten vollständig gestartet wurde, durchlief ich das gleiche Szenario, um zu sehen, welche Instanzen ausgeführt wurden, damit ich sie wieder einschalten konnte. Es waren insgesamt vier. Drei wurden gebootet und einer gab einen Fehler. Es war derselbe Fehler wie zuvor: Die Backup-Disk konnte nicht gefunden werden. Im Ernst, was?
id: Ketika node ini sepenuhnya boot, saya menjalankan skenario yang sama untuk melihat instance apa yang sedang berjalan sehingga saya bisa menyalakannya kembali. Ada total empat. Tiga boot dan satu memberikan kesalahan. Itu kesalahan yang sama seperti sebelumnya: tidak dapat menemukan backing disk. Serius, apa?

source: When users provision resources, they can specify from which availability zone they want their instance to be built. This allows cloud consumers to ensure that their application resources are spread across disparate machines to achieve high availability in the event of hardware failure.
de: Wenn Benutzer Ressourcen bereitstellen, können sie angeben, aus welcher Verfügbarkeitszone ihre Instanz erstellt werden soll. Auf diese Weise können Cloud-Kunden sicherstellen, dass ihre Anwendungsressourcen auf unterschiedliche Computer verteilt sind, um im Falle eines Hardwareausfalls eine hohe Verfügbarkeit zu erreichen.
id: Ketika pengguna menyediakan sumber daya, mereka dapat menentukan dari zona ketersediaan mana mereka ingin instance mereka dibangun. Hal ini memungkinkan konsumen cloud untuk memastikan bahwa sumber daya aplikasi mereka tersebar di berbagai mesin yang berbeda untuk mencapai ketersediaan tinggi jika terjadi kegagalan perangkat keras.

source: When viewing the server information, you can see the metadata included on the metadata line:
de: Wenn Sie die Serverinformationen anzeigen, sehen Sie die Metadaten, die in der Metadatenzeile enthalten sind:

source: When you are getting slow responses from various services, it can be hard to know where to start looking. The first thing to check is the extent of the slowness: is it specific to a single service, or varied among different services? If your problem is isolated to a specific service, it can temporarily be fixed by restarting the service, but that is often only a fix for the symptom and not the actual problem.
de: Wenn Sie langsame Antworten von verschiedenen Diensten erhalten, kann es schwer sein zu wissen, wo Sie anfangen sollen zu suchen. Das erste, was zu prüfen ist, ist das Ausmaß der Langsamkeit: Ist es spezifisch für einen einzelnen Dienst oder variiert es zwischen verschiedenen Diensten? Wenn Ihr Problem für einen bestimmten Dienst isoliert ist, kann es vorübergehend durch Neustart des Dienstes behoben werden, aber das ist oft nur eine Lösung für das Symptom und nicht für das eigentliche Problem.
id: Ketika Anda mendapatkan respons lambat dari berbagai layanan, mungkin sulit untuk mengetahui di mana harus mulai mencari. Hal pertama yang perlu diperiksa adalah tingkat kelambatan: apakah spesifik untuk satu layanan, atau beragam di antara layanan yang berbeda? Jika masalah Anda diisolasi untuk layanan tertentu, sementara itu dapat diperbaiki dengan memulai kembali layanan, tetapi itu seringkali hanya perbaikan untuk gejala dan bukan masalah yang sebenarnya.

source: When you create a deployment plan, focus on a few vital areas because they are very hard to modify post deployment. The next two sections talk about configurations for:
de: Wenn Sie einen Bereitstellungsplan erstellen, konzentrieren Sie sich auf einige wichtige Bereiche, da sie nach der Bereitstellung nur sehr schwer zu ändern sind. In den nächsten beiden Abschnitten wird über die Konfigurationen für:
id: Saat Anda membuat rencana penempatan, fokuslah pada beberapa area penting karena sangat sulit untuk memodifikasi penempatan setelah itu. Dua bagian berikutnya berbicara tentang konfigurasi untuk:

source: When you join the screen session that ``stack.sh`` starts with ``screen -r stack``, you are greeted with many screen windows:
de: Wenn Sie an der Bildschirmsitzung teilnehmen, die ``stack.sh`` mit ``screen -r stack`` beginnt, werden Sie mit vielen Bildschirmfenstern begrüßt:
id: Ketika Anda bergabung dengan sesi layar yang ``stack.sh`` dimulai dengan ``screen -r stack``, Anda akan disambut dengan banyak jendela layar (screen windows):

source: When you join the screen session that ``stack.sh`` starts with ``screen -r stack``, you see a screen for each service running, which can be a few or several, depending on how many services you configured DevStack to run.
de: Wenn Sie der Bildschirmsitzung beitreten, die ``stack.sh`` mit ``screen -r stack`` beginnt, sehen Sie einen Bildschirm für jeden laufenden Dienst, der einige oder mehrere sein kann, je nachdem, wie viele Dienste Sie DevStack zum Ausführen konfiguriert haben.
id: Ketika Anda bergabung dengan sesi layar yang ``stack.sh`` dimulai dengan ``screen -r stack``, Anda melihat layar untuk setiap layanan yang berjalan, yang bisa beberapa atau beberapa, tergantung pada berapa banyak layanan yang Anda konfigurasi DevStack untuk berlari.

source: When you reboot a compute node, first verify that it booted successfully. This includes ensuring that the ``nova-compute`` service is running:
de: Wenn Sie einen Computerknoten neu starten, überprüfen Sie zunächst, ob er erfolgreich gestartet wurde. Dazu gehört auch die Sicherstellung, dass der Dienst ``nova-compute`` läuft:
id: Ketika Anda me-reboot node komputasi, pertama-tama pastikan itu berhasil boot. Ini termasuk memastikan bahwa layanan ``nova-compute`` sedang berjalan:

source: When you run any of the following operations, the services appear in their own internal availability zone (CONF.internal_service_availability_zone):
de: Wenn Sie eine der folgenden Operationen ausführen, erscheinen die Dienste in einer eigenen internen Verfügbarkeitszone (CONF.internal_service_availability_zone):
id: Ketika Anda menjalankan salah satu dari operasi berikut, layanan muncul di zona ketersediaan internal mereka sendiri (CONF.internal_service_avilities_zone):

source: When your middleware is done, we encourage you to open source it and let the community know on the OpenStack mailing list. Perhaps others need the same functionality. They can use your code, provide feedback, and possibly contribute. If enough support exists for it, perhaps you can propose that it be added to the official swift `middleware <https://opendev.org/openstack/swift/src/branch/master/swift/common/middleware>`_.
de: Wenn Ihre Middleware fertig ist, empfehlen wir Ihnen, sie Open Source zu verwenden und die Community auf der OpenStack-Mailingliste darüber zu informieren. Vielleicht benötigen andere die gleiche Funktionalität. Sie können Ihren Code verwenden, Feedback geben und möglicherweise einen Beitrag leisten. Wenn es genügend Unterstützung dafür gibt, können Sie vielleicht vorschlagen, dass sie dem offiziellen Swift `Middleware <https://opendev.org/openstack/swift/src/branch/master/swift/common/middleware>`_ hinzugefügt wird.

source: When your scheduler is done, we encourage you to open source it and let the community know on the OpenStack mailing list. Perhaps others need the same functionality. They can use your code, provide feedback, and possibly contribute. If enough support exists for it, perhaps you can propose that it be added to the official Compute `schedulers <https://opendev.org/openstack/nova/src/branch/master/nova/scheduler>`_.
de: Wenn Ihr Scheduler fertig ist, empfehlen wir Ihnen, ihn Open Source zu verwenden und die Community auf der OpenStack-Mailingliste darüber zu informieren. Vielleicht benötigen andere die gleiche Funktionalität. Sie können Ihren Code verwenden, Feedback geben und möglicherweise einen Beitrag leisten. Wenn es genügend Unterstützung dafür gibt, können Sie vielleicht vorschlagen, dass sie dem offiziellen Compute `schedulers <https://opendev.org/openstack/nova/src/branch/master/nova/scheduler>`_ hinzugefügt wird.

source: Where Are the Logs?
de: Wo sind die Protokolle?
id: Dimana Log-nya?

source: Where do you even begin troubleshooting something like this? An instance that just randomly locks up when a command is issued. Is it the image? Nope—it happens on all images. Is it the compute node? Nope—all nodes. Is the instance locked up? No! New SSH connections work just fine!
de: Wo fangen Sie überhaupt an, so etwas zu beheben? Eine Instanz, die einfach zufällig blockiert, wenn ein Befehl ausgeführt wird. Ist es das Abbild? Nein - es passiert auf allen Abbildern. Ist es der Compute-Knoten? Nope-all Knoten. Ist die Instanz gesperrt? Nein! Neue SSH-Verbindungen funktionieren einwandfrei!
id: Di mana Anda bahkan mulai memecahkan masalah seperti ini? instance yang hanya terkunci secara acak ketika perintah dikeluarkan. Apakah itu image? Tidak — ini terjadi pada semua image. Apakah ini node komputasi? Tidak — semua node. Apakah instance terkunci? Tidak! Koneksi SSH baru berfungsi dengan baik!

source: Where floating IPs are configured in a deployment, each project will have a limited number of floating IPs controlled by a quota. However, these need to be allocated to the project from the central pool prior to their use—usually by the administrator of the project. To allocate a floating IP to a project, use the :guilabel:`Allocate IP To Project` button on the :guilabel:`Floating IPs` tab of the :guilabel:`Access & Security` page of the dashboard. The command line can also be used:
de: Wenn in einer Bereitstellung Floating IPs konfiguriert sind, hat jedes Projekt eine begrenzte Anzahl von Floating IPs, die durch eine Quote gesteuert werden. Diese müssen jedoch vor ihrer Nutzung - in der Regel durch den Projektverwalter - dem Projekt aus dem zentralen Pool zugeordnet werden. Um eine Floating IP einem Projekt zuzuweisen, verwenden Sie die Schaltfläche :guilabel:`Allocate IP To Project` auf der Registerkarte :guilabel:`Floating IPs` der Seite :guilabel:`Access & Security` des Dashboards. Die Befehlszeile kann auch verwendet werden:

source: Whether access to a specific resource might be granted or not according to the permissions configured for the resource (currently available only for the network resource). The actual authorization policies enforced in an OpenStack service vary from deployment to deployment.
de: Ob der Zugriff auf eine bestimmte Ressource gemäß den für die Ressource konfigurierten Berechtigungen gewährt werden kann oder nicht (derzeit nur für die Netzwerkressource verfügbar). Die tatsächlichen Autorisierungsrichtlinien, die in einem OpenStack-Dienst durchgesetzt werden, variieren von Bereitstellung zu Bereitstellung.

source: Whether you use SQLite or an RDBMS (such as MySQL), SQL interoperability is essential to a functioning OpenStack environment. A large or fragmented SQLite file can cause slowness when using files as a back end. A locked or long-running query can cause delays for most RDBMS services. In this case, do not kill the query immediately, but look into it to see if it is a problem with something that is hung, or something that is just taking a long time to run and needs to finish on its own. The administration of an RDBMS is outside the scope of this document, but it should be noted that a properly functioning RDBMS is essential to most OpenStack services.
de: Unabhängig davon, ob Sie SQLite oder ein RDBMS (z.B. MySQL) verwenden, ist die SQL-Interoperabilität für eine funktionierende OpenStack-Umgebung unerlässlich. Eine große oder fragmentierte SQLite-Datei kann bei der Verwendung von Dateien als Backend zu Verzögerungen führen. Eine gesperrte oder lang laufende Abfrage kann bei den meisten RDBMS-Diensten zu Verzögerungen führen. In diesem Fall beenden Sie die Abfrage nicht sofort, sondern schauen Sie nach, ob es sich um ein Problem mit etwas handelt, das aufgehängt ist, oder um etwas, das nur eine lange Zeit in Anspruch nimmt und von selbst beendet werden muss. Die Verwaltung eines RDBMS liegt außerhalb des Umfangs dieses Dokuments, aber es sollte beachtet werden, dass ein ordnungsgemäß funktionierendes RDBMS für die meisten OpenStack-Dienste unerlässlich ist.
id: Apakah Anda menggunakan SQLite atau RDBMS (seperti MySQL), interoperabilitas SQL sangat penting untuk lingkungan OpenStack yang berfungsi. File SQLite yang besar atau terfragmentasi dapat menyebabkan kelambatan saat menggunakan file sebagai ujung belakang. Kueri yang terkunci atau berjalan lama dapat menyebabkan penundaan untuk sebagian besar layanan RDBMS. Dalam hal ini, jangan langsung membunuh kueri, tetapi periksa ke dalamnya untuk melihat apakah itu adalah masalah dengan sesuatu yang digantung, atau sesuatu yang hanya membutuhkan waktu lama untuk dijalankan dan harus selesai sendiri. Administrasi RDBMS berada di luar ruang lingkup dokumen ini, tetapi harus dicatat bahwa RDBMS yang berfungsi dengan baik sangat penting untuk sebagian besar layanan OpenStack.

source: While OpenStack is composed of many components and moving parts, backing up the critical data is quite simple.
de: Während OpenStack aus vielen Komponenten und beweglichen Teilen besteht, ist die Sicherung der kritischen Daten recht einfach.
id: Sementara OpenStack terdiri dari banyak komponen dan komponen yang bergerak, membuat cadangan data penting cukup sederhana.

source: While bouncing this idea around in our heads, I was randomly typing commands on the compute node:
de: Während ich diese Idee in unseren Köpfen herumwirbelte, gab ich zufällig Befehle auf dem Compute-Knoten ein:
id: Saat memantulkan ide ini di kepala kami, saya mengetik perintah secara acak di compute node:
