Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: ``/var/lib/nova`` is another important directory to back up. The exception to this is the ``/var/lib/nova/instances`` subdirectory on compute nodes. This subdirectory contains the KVM images of running instances. You would want to back up this directory only if you need to maintain backup copies of all instances. Under most circumstances, you do not need to do this, but this can vary from cloud to cloud and your service levels. Also be aware that making a backup of a live KVM instance can cause that instance to not boot properly if it is ever restored from a backup.
de: ``/var/lib/nova`` ist ein weiteres wichtiges Verzeichnis für die Sicherung. Die Ausnahme bildet das Unterverzeichnis ``/var/lib/nova/instances`` auf Compute-Knoten. Dieses Unterverzeichnis enthält die KVM-Images der laufenden Instanzen. Sie möchten dieses Verzeichnis nur sichern, wenn Sie Sicherungskopien aller Instanzen pflegen müssen. In den meisten Fällen müssen Sie dies nicht tun, aber dies kann von Cloud zu Cloud und Ihren Service Levels variieren. Beachten Sie auch, dass die Erstellung eines Backups einer aktiven KVM-Instanz dazu führen kann, dass diese Instanz nicht richtig startet, wenn sie jemals aus einem Backup wiederhergestellt wird.
id: ``/var/lib/nova`` adalah direktori penting lainnya untuk dicadangkan. Pengecualian untuk hal ini adalah subdirektori ``/var/lib/nova/instances`` pada compute node. Subdirektori ini berisi image KVM dari instance yang sedang berjalan. Anda ingin mencadangkan direktori ini hanya jika Anda perlu mempertahankan salinan cadangan dari semua instance. Dalam sebagian besar keadaan, Anda tidak perlu melakukan ini, tetapi ini dapat bervariasi dari cloud ke cloud dan tingkat layanan Anda. Perlu diketahui juga bahwa membuat cadangan instance KVM langsung dapat menyebabkan instance tersebut tidak bisa boot dengan benar jika pernah dipulihkan dari cadangan.

source: ``/var/log/nova`` does not need to be backed up if you have all logs going to a central area. It is highly recommended to use a central logging server or back up the log directory.
de: ``/var/log/nova`` braucht nicht gesichert zu werden, wenn alle Protokolle in einen zentralen Bereich gehen. Es wird dringend empfohlen, einen zentralen Protokollierungsserver zu verwenden oder das Protokollverzeichnis zu sichern.
id: ``/var/log/nova`` tidak perlu dicadangkan jika semua log masuk ke area pusat. Sangat disarankan untuk menggunakan server logging pusat atau membuat cadangan direktori log.

source: ``cert``: authenticates an instance through a TLS certificate. Specify the TLS identity as the IDENTKEY. A valid value is any string up to 64 characters long in the common name (CN) of the certificate. The meaning of a string depends on its interpretation.
de: ``cert``: authentifiziert eine Instanz durch ein TLS-Zertifikat. Geben Sie die TLS-Identität als IDENTKEY an. Ein gültiger Wert ist jede Zeichenkette mit einer Länge von bis zu 64 Zeichen im Common Name (CN) des Zertifikats. Die Bedeutung einer Zeichenkette hängt von ihrer Interpretation ab.

source: ``glance-api.conf`` and ``glance-registry.conf``:
de: ``glance-api.conf`` und ``glance-registry.conf``:

source: ``images``
de: "Abbilder"

source: ``instances``
de: ``Instanzen``

source: ``ip``: authenticates an instance through its IP address. A valid format is XX.XX.XX.XX orXX.XX.XX.XX/XX. For example 0.0.0.0/0.
de: ``ip``: authentifiziert eine Instanz über ihre IP-Adresse. Ein gültiges Format ist XX.XX.XX.XX oder XX.XX.XX.XX./XX. Zum Beispiel 0.0.0.0.0/0.

source: ``nova-api`` services
de: ``nova-api`` Dienstleistungen
id: layanan ``nova-api``

source: ``nova-scheduler`` services
de: ``nova-scheduler`` Dienste
id: Layanan ``nova-scheduler`

source: ``ro:`` read-only (RO) access.
de: ``ro:``Lesezugriff (RO).

source: ``rw``: read and write (RW) access. This is the default value.
de: ``rw``: Lese- und Schreibzugriff (RW). Dies ist der Standardwert.

source: ``user``: authenticates by a specified user or group name. A valid value is an alphanumeric string that can contain some special characters and is from 4 to 32 characters long.
de: ``user``: Authentifizierung durch einen bestimmten Benutzer- oder Gruppennamen. Ein gültiger Wert ist eine alphanumerische Zeichenkette, die einige Sonderzeichen enthalten kann und 4 bis 32 Zeichen lang ist.

source: `admin_or_owner` shows a rule that evaluates successfully if the current user is an administrator or the owner of the resource specified in the request (tenant identifier is equal).
de: `admin_or_owner` zeigt eine Regel, die erfolgreich auswertet, wenn der aktuelle Benutzer ein Administrator oder der Eigentümer der in der Anfrage angegebenen Ressource ist (Mandantenkennung ist gleich).

source: `compute_extension:flavormanage` shows a policy restricting the ability to manipulate flavors to administrators using the Admin API only.
de: `compute_extension:flavormanage` zeigt eine Richtlinie, die die Möglichkeit der Manipulation von Varianten auf Administratoren beschränkt, die nur die Admin-API verwenden.

source: `default` shows the default policy, which is always evaluated if an API operation does not match any of the policies in ``policy.json``.
de: `default` zeigt die Standardrichtlinie an, die immer dann ausgewertet wird, wenn eine API-Operation nicht mit einer der Richtlinien in ``policy.json`` übereinstimmt.

source: `easyOVS <https://github.com/yeasy/easyOVS>`_ is a useful tool when it comes to operating your OpenvSwitch bridges and iptables on your OpenStack platform. It automatically associates the virtual ports with the VM MAC/IP, VLAN tag and namespace information, as well as the iptables rules for VMs.
de: `easyOVS <https://github.com/yeasy/easyOVS>`_ ist ein nützliches Werkzeug, wenn es darum geht, Ihre OpenvSwitch-Brücken und iptables auf Ihrer OpenStack-Plattform zu betreiben. Die virtuellen Ports werden automatisch mit den Informationen zu VM MAC/IP, VLAN-Tag und Namensraum sowie den iptables-Regeln für VMs verknüpft.
id: `easyOVS <https://github.com/yeasy/easyOVS>`_adalah alat yang berguna untuk mengoperasikan jembatan dan iptables OpenvSwitch Anda pada platform OpenStack Anda. Secara otomatis mengaitkan port virtual dengan VM MAC/IP, tag VLAN dan informasi namespace, serta aturan iptables untuk VM.

source: `instances losing IP address while running, due to No DHCPOFFER <https://www.gossamer-threads.com/lists/openstack/dev/14696>`_.
de: `Fälle, in denen die IP-Adresse während des Betriebs verloren geht, da kein DHCPOFFER <https://www.gossamer-threads.com/lists/openstack/dev/14696>`_.

source: and the following log statement into the ``__call__`` method:
de: und die folgende Log-Anweisung in das ``__call__`` Verfahren:
id: dan pernyataan log berikut ke dalam metode ``__call__``:

source: check the share's status:
de: den Status der Freigabe überprüfen:

source: command to reset share state, where state indicates which state to assign the share to. Options include: ``available, error, creating, deleting, error_deleting`` states.
de: Befehl zum Zurücksetzen des Freigabestatus, wobei der Status angibt, welchem Zustand die Freigabe zugeordnet werden soll. Zu den Optionen gehören: ``Verfügbar, Fehler, Erstellen, Löschen, Error_Löschen`` Zustände.

source: direction
de: Richtung

source: gigabytes
de: Gigabyte

source: guest-fsfreeze-thaw
de: gast-fsfsfreeze-thaw

source: img_signature uses the signature called signature_64
de: img_signature verwendet die Signatur signature_64
id: img_signature menggunakan signature yang disebut signature_64

source: img_signature_certificate_uuid uses the value from cert_uuid in section 5 above
de: img_signature_certificate_uuuid verwendet den Wert von cert_uuuid in Abschnitt 5 oben
id: img_signature_certificate_uuid menggunakan nilai dari cert_uuid di bagian 5 di atas

source: img_signature_hash_method matches 'SHA-256' in section 2 above
de: img_signature_hash_method passt zu'SHA-256' in Abschnitt 2 oben
id: img_signature_hash_method cocok dengan 'SHA-256' di bagian 2 di atas

source: img_signature_key_type matches 'RSA-PSS' in section 2 above
de: img_signature_key_type entspricht 'RSA-PSS' in Abschnitt 2 oben
id: img_signature_key_type cocok dengan 'RSA-PSS' di bagian 2 di atas

source: member
de: Mitglied

source: nova-compute servers first need to be updated by the following steps:
de: nova-compute servers müssen zunächst durch die folgenden Schritte aktualisiert werden:
id: server nova-compute terlebih dahulu perlu diperbarui dengan langkah-langkah berikut:

source: or the `Command-Line Interface Reference <https://docs.openstack.org/cli-reference/glance.html>`__.
de: oder die `Command-Line Interface Reference <https://docs.openstack.org/cli-reference/glance.html>`__.
id: atau `Command-Line Interface Reference <https://docs.openstack.org/cli-reference/glance.html>`__.

source: rsyslog client configuration
de: rsyslog Client-Konfiguration
id: konfigurasi klien rsyslog

source: rsyslog server configuration
de: rsyslog server konfiguration
id: konfigurasi server rsyslog

source: showed this particular node in a down state.
de: zeigte diesen speziellen Knoten in einem heruntergefahrenen Zustand an.
id: menunjukkan node khusus ini dalam kondisi turun.

source: size (GB)
de: Größe (GB)

source: snapshot
de: Momentaufnahme

source: snapshots
de: Schattenkopien

source: type
de: Typ

source: vlan20 is the VLAN that the data center gave us for outgoing Internet access. It's a correct VLAN and is also attached to bond0.
de: vlan20 ist das VLAN, das uns das Rechenzentrum für den ausgehenden Internetzugang zur Verfügung gestellt hat. Es ist ein korrektes VLAN und wird auch an bond0 angeschlossen.
id: vlan20 adalah VLAN yang diberikan pusat data kepada kami untuk akses Internet keluar. Ini adalah VLAN yang benar dan juga melekat pada bond0.

source: volumes
de: Datenträger

source: where ``nova`` is the database you want to back up.
de: wobei ``nova`` die Datenbank ist, die Sie sichern möchten.
id: di mana ``nova`` adalah basis data yang ingin Anda buat cadangannya.

source: “The Cloud” has been described as a volatile environment where servers can be created and terminated at will. While this may be true, it does not mean that your servers must be volatile. Ensuring that your cloud's hardware is stable and configured correctly means that your cloud environment remains up and running.
de: "Die Cloud" wurde als eine volatile Umgebung beschrieben, in der Server nach Belieben erstellt und beendet werden können. Dies mag zwar wahr sein, bedeutet aber nicht, dass Ihre Server volatil sein müssen. Die Sicherstellung, dass die Hardware Ihrer Cloud stabil und korrekt konfiguriert ist, bedeutet, dass Ihre Cloud-Umgebung funktionsfähig bleibt.
id: "The Cloud" telah dideskripsikan sebagai lingkungan yang tidak stabil di mana server dapat dibuat dan diakhiri sesuka hati. Meskipun ini mungkin benar, itu tidak berarti bahwa server Anda harus tidak stabil. Memastikan perangkat keras cloud Anda stabil dan terkonfigurasi dengan benar berarti bahwa lingkungan cloud Anda tetap aktif dan berjalan.

source: A critical part of a cloud's scalability is the amount of effort that it takes to run your cloud. To minimize the operational cost of running your cloud, set up and use an automated deployment and configuration infrastructure with a configuration management system, such as :term:`Puppet` or :term:`Chef`. Combined, these systems greatly reduce manual effort and the chance for operator error.
id: Bagian penting dari skalabilitas cloud adalah jumlah upaya yang diperlukan untuk menjalankan cloud Anda. Untuk meminimalkan biaya operasional menjalankan cloud Anda, atur dan gunakan penyebaran otomatis dan infrastruktur konfigurasi dengan sistem manajemen konfigurasi, seperti :term:`Puppet` atau :term:`Chef`. Digabungkan, sistem ini sangat mengurangi upaya manual dan kemungkinan kesalahan operator.

source: A single :term:`API endpoint` for compute, or you require a second level of scheduling.
id: Single :term:`API endpoint` untuk komputasi, atau Anda memerlukan penjadwalan tingkat kedua.

source: Bare metal Deployment (ironic)
id: Penggunaan bare-metal (ironic)

source: Considered experimental. A new service, nova-cells. Each cell has a full nova installation except nova-api.
id: Dianggap eksperimental. Layanan baru, nova-cells. Setiap sel memiliki instalasi nova penuh kecuali nova-api.

source: Down the Rabbit Hole
id: Down the Rabbit Hole (masuk kedalam lubang kelinci)

source: Floating IPs
id: IP mengambang

source: Havana Haunted by the Dead
id: Havana Haunted by the Dead (Havana Dihantui oleh Orang Mati)

source: Once nova is sending notifications, install and configure StackTach. StackTach works for queue consumption and pipeline processing are configured to read these notifications from RabbitMQ servers and store them in a database. Users can inquire on instances, requests, and servers by using the browser interface or command-line tool, `Stacky <https://github.com/rackerlabs/stacky>`_. Since StackTach is relatively new and constantly changing, installation instructions quickly become outdated. Refer to the `StackTach Git repository <https://git.openstack.org/cgit/openstack/stacktach>`_ for instructions as well as a demostration video. Additional details on the latest developments can be discovered at the `official page <http://stacktach.com/>`_
id: Setelah nova mengirim pemberitahuan, instal dan konfigurasikan StackTach. StackTach berfungsi untuk konsumsi antrian dan pemrosesan pipa dikonfigurasikan untuk membaca notifikasi ini dari server RabbitMQ dan menyimpannya dalam database. Pengguna dapat menanyakan instance, permintaan, dan server dengan menggunakan antarmuka browser atau alat command-line, `Stacky <https://github.com/rackerlabs/stacky>` _. Karena StackTach relatif baru dan terus berubah, instruksi instalasi dengan cepat menjadi usang. Lihat repositori `StackTach Git <https://git.openstack.org/cgit/openstack/stacktach>` _ untuk instruksi serta video demostration. Rincian tambahan tentang perkembangan terbaru dapat ditemukan di`official page <http://stacktach.com/>`_

source: OpenStack Compute cells are designed to allow running the cloud in a distributed fashion without having to use more complicated technologies, or be invasive to existing nova installations. Hosts in a cloud are partitioned into groups called *cells*. Cells are configured in a tree. The top-level cell ("API cell") has a host that runs the ``nova-api`` service, but no ``nova-compute`` services. Each child cell runs all of the other typical ``nova-*`` services found in a regular installation, except for the ``nova-api`` service. Each cell has its own message queue and database service and also runs ``nova-cells``, which manages the communication between the API cell and child cells.
id: Sel OpenStack Compute dirancang untuk memungkinkan menjalankan cloud secara terdistribusi tanpa harus menggunakan teknologi yang lebih rumit, atau invasif dengan instalasi nova yang ada. Host di cloud dipartisi ke dalam grup yang disebut *cells *. Sel dikonfigurasikan dalam pohon. Sel top-level ("API cell") memiliki host yang menjalankan layanan ``nova-api``, tetapi tidak ada layanan ``nova-compute``. Setiap sel anak menjalankan semua layanan ``nova- * `` tipikal lainnya yang ditemukan dalam instalasi reguler, kecuali untuk layanan ``nova-api``. Setiap sel memiliki antrian pesan dan layanan basis datanya sendiri dan juga menjalankan ``nova-sel``, yang mengelola komunikasi antara sel API dan sel anak (child cell).

source: Option 1
id: Opsi 1

source: Option 2
id: Opsi 2

source: Option 3
id: Opsi 3

source: Other newer configuration tools include `Juju <https://jujucharms.com/>`_ and `Salt <http://www.saltstack.com/>`_; and more mature configuration management tools include `CFEngine <https://cfengine.com/>`_ and `Bcfg2 <http://bcfg2.org/>`_.
id: Alat konfigurasi baru lainnya termasuk `Juju <https://jujucharms.com/>`_ dan `Salt <http://www.saltstack.com/>`_; dan alat manajemen konfigurasi yang lebih matang meliputi `CFEngine <https://cfengine.com/>`_ dan `Bcfg2 <http://bcfg2.org/>`_.

source: Resources such as memory, disk, and CPU are generic resources that all servers (even non-OpenStack servers) have and are important to the overall health of the server. When dealing with OpenStack specifically, these resources are important for a second reason: ensuring that enough are available to launch instances. There are a few ways you can see OpenStack resource usage. The first is through the :command:`nova` command:
id: Sumber daya seperti memori, disk, dan CPU adalah sumber daya generik yang dimiliki semua server (bahkan server non-OpenStack) dan penting bagi kesehatan server secara keseluruhan. Ketika berhadapan dengan OpenStack secara khusus, sumber daya ini penting untuk alasan kedua: memastikan bahwa cukup tersedia untuk meluncurkan instance. Ada beberapa cara Anda dapat melihat penggunaan sumber daya OpenStack. Yang pertama adalah melalui perintah :command:`nova` :

source: The Valentine's Day Compute Node Massacre
id: The Valentine's Day Compute Node Massacre (Hari Valentine Menghitung Pembantaian Node)

source: These tools also make it possible to test and roll back changes, as they are fully repeatable. Conveniently, a large body of work has been done by the OpenStack community in this space. Puppet, a configuration management tool, even provides official modules for OpenStack projects in an OpenStack infrastructure system known as `Puppet OpenStack <https://wiki.openstack.org/wiki/Puppet>`_. Chef configuration management is provided within `OpenStack Chef Repo <https://git.openstack.org/cgit/openstack/openstack-chef-repo>`_. Additional configuration management systems include Juju, Ansible, and Salt. Also, PackStack is a command-line utility for Red Hat Enterprise Linux and derivatives that uses Puppet modules to support rapid deployment of OpenStack on existing servers over an SSH connection.
id: Alat-alat ini juga memungkinkan untuk menguji dan mengembalikan perubahan, karena sepenuhnya dapat diulang. Dengan mudah, banyak pekerjaan telah dilakukan oleh komunitas OpenStack di ruang ini. Puppet, alat manajemen konfigurasi, bahkan menyediakan modul resmi untuk proyek OpenStack dalam sistem infrastruktur OpenStack yang dikenal sebagai `Puppet OpenStack <https://wiki.openstack.org/wiki/Puppet>` _. Manajemen konfigurasi chef disediakan dalam `OpenStack Chef Repo <https://git.openstack.org/cgit/openstack/openstack-chef-repo>` _. Sistem manajemen konfigurasi tambahan termasuk Juju, Ansible, dan Salt. Selain itu, PackStack adalah utilitas command-line untuk Red Hat Enterprise Linux dan turunannya yang menggunakan modul Puppet untuk mendukung deployment OpenStack yang cepat pada server yang ada melalui koneksi SSH.

source: This allows for a single API server being used to control access to multiple cloud installations. Introducing a second level of scheduling (the cell selection), in addition to the regular ``nova-scheduler`` selection of hosts, provides greater flexibility to control where virtual machines are run.
id: Ini memungkinkan server API tunggal digunakan untuk mengontrol akses ke beberapa instalasi cloud. Memperkenalkan penjadwalan tingkat kedua (pemilihan sel), sebagai tambahan dari pemilihan host `` nova-scheduler`` reguler, memberikan fleksibilitas yang lebih besar untuk mengontrol di mana mesin virtual dijalankan.

source: This infrastructure includes systems to automatically install the operating system's initial configuration and later coordinate the configuration of all services automatically and centrally, which reduces both manual effort and the chance for error. Examples include Ansible, CFEngine, Chef, Puppet, and Salt. You can even use OpenStack to deploy OpenStack, named TripleO (OpenStack On OpenStack).
id: Infrastruktur ini mencakup sistem untuk secara otomatis menginstal konfigurasi awal sistem operasi dan kemudian mengoordinasikan konfigurasi semua layanan secara otomatis dan terpusat, yang mengurangi upaya manual dan kemungkinan kesalahan. Contohnya termasuk Ansible, CFEngine, Chef, Puppet, dan Salt. Anda bahkan dapat menggunakan OpenStack untuk menggunakan OpenStack, bernama TripleO (OpenStack On OpenStack).

source: This output shows that an instance named ``devstack`` was created from an Ubuntu 12.04 image using a flavor of ``m1.small`` and is hosted on the compute node ``c02.example.com``.
id: Output ini menunjukkan bahwa instance bernama ``devstack`` telah dibuat dari image Ubuntu 12.04 menggunakan flavor ``m1.small`` dan di-host pada compute node ``c02.example.com``.

source: To discover how API requests should be structured, read the `OpenStack API Reference <https://developer.openstack.org/api-guide/quick-start/index.html>`_. To chew through the responses using jq, see the `jq Manual <http://stedolan.github.io/jq/manual/>`_.
id: Untuk mengetahui bagaimana permintaan API harus disusun, baca `OpenStack API Reference <https://developer.openstack.org/api-guide/quick-start/index.html>`_. Untuk mengunyah tanggapan menggunakan jq, lihat `jq Manual <http://stedolan.github.io/jq/manual/>`_.

source: To prevent system capacities from being exhausted without notification, you can set up :term:`quotas <quota>`. Quotas are operational limits. For example, the number of gigabytes allowed per tenant can be controlled to ensure that a single tenant cannot consume all of the disk space. Quotas are currently enforced at the tenant (or project) level, rather than the user level.
id: Agar kapasitas sistem tidak kehabisan tanpa pemberitahuan, Anda dapat mengatur :term:`quotas <quota>`. Kuota adalah batasan operasional. Misalnya, jumlah gigabyte yang diizinkan per penyewa dapat dikontrol untuk memastikan bahwa penyewa tunggal tidak dapat mengkonsumsi semua ruang disk. Kuota saat ini ditegakkan di tingkat penyewa (atau proyek), daripada tingkat pengguna.

source: Upgrades
id: Upgrade

source: VCPUs
id: VCPU

source: When your middleware is done, we encourage you to open source it and let the community know on the OpenStack mailing list. Perhaps others need the same functionality. They can use your code, provide feedback, and possibly contribute. If enough support exists for it, perhaps you can propose that it be added to the official swift `middleware <https://git.openstack.org/cgit/openstack/swift/tree/swift/common/middleware>`_.
id: Ketika middleware Anda selesai, kami menganjurkan Anda untuk membuka sumbernya dan memberi tahu komunitas di milis OpenStack. Mungkin orang lain membutuhkan fungsi yang sama. Mereka dapat menggunakan kode Anda, memberikan umpan balik, dan mungkin berkontribusi. Jika ada cukup dukungan untuk itu, mungkin Anda dapat mengusulkan agar ditambahkan ke swift resmi `middleware <https://git.openstack.org/cgit/openstack/swift/tree/swift/common/middleware>`_.

source: When your scheduler is done, we encourage you to open source it and let the community know on the OpenStack mailing list. Perhaps others need the same functionality. They can use your code, provide feedback, and possibly contribute. If enough support exists for it, perhaps you can propose that it be added to the official Compute `schedulers <https://git.openstack.org/cgit/openstack/nova/tree/nova/scheduler>`_.
id: Ketika penjadwal Anda selesai, kami menganjurkan Anda untuk membuka sumbernya dan memberi tahu komunitas di milis OpenStack. Mungkin orang lain membutuhkan fungsi yang sama. Mereka dapat menggunakan kode Anda, memberikan umpan balik, dan mungkin berkontribusi. Jika ada cukup dukungan untuk itu, mungkin Anda dapat mengusulkan agar ditambahkan ke Compute resmi `schedulers <https://git.openstack.org/cgit/openstack/nova/tree/nova/scheduler>`_.
