Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: It is also possible to add and remove security groups when an instance is running. Currently this is only available through the command-line tools. Here is an example:
de: Es ist auch möglich, Sicherheitsgruppen hinzuzufügen und zu entfernen, wenn eine Instanz ausgeführt wird. Dies ist derzeit nur über die Kommandozeilen-Tools möglich. Hier ist ein Beispiel:

source: It is also possible to add project members and adjust the project quotas. We'll discuss those actions later, but in practice, it can be quite convenient to deal with all these operations at one time.
de: Es ist auch möglich, Projektmitglieder hinzuzufügen und die Projektquoten anzupassen. Wir werden diese Aktionen später besprechen, aber in der Praxis kann es sehr bequem sein, alle diese Operationen auf einmal durchzuführen.
id: Dimungkinkan juga untuk menambah anggota proyek dan menyesuaikan kuota proyek. Kami akan membahas tindakan-tindakan itu nanti, tetapi dalam praktiknya, mungkin cukup nyaman untuk menangani semua operasi ini sekaligus.

source: It is important to note that powering off an instance does not terminate it in the OpenStack sense.
de: Es ist wichtig zu beachten, dass das Ausschalten einer Instanz diese nicht im Sinne von OpenStack beendet.

source: It is possible to define other roles, but doing so is uncommon.
de: Es ist möglich, andere Rollen zu definieren, aber das ist ungewöhnlich.

source: It is possible to watch packets on internal interfaces, but it does take a little bit of networking gymnastics. First you need to create a dummy network device that normal Linux tools can see. Then you need to add it to the bridge containing the internal interface you want to snoop on. Finally, you need to tell Open vSwitch to mirror all traffic to or from the internal port onto this dummy port. After all this, you can then run :command:`tcpdump` on the dummy interface and see the traffic on the internal port.
de: Es ist möglich, Pakete auf internen Schnittstellen zu beobachten, aber es braucht ein wenig Netzwerk-Gymnastik. Zuerst müssen Sie ein Dummy-Netzwerkgerät erstellen, das normale Linux-Tools sehen können. Dann müssen Sie es zu der Bridge hinzufügen, die das interne Interface enthält, an dem Sie den Verkehr mitlesen möchten. Schließlich müssen Sie Open vSwitch anweisen, den gesamten Datenverkehr vom oder zum internen Port auf diesen Dummy-Port zu spiegeln. Nach all dem können Sie dann :command:`tcpdump` auf der Dummy-Schnittstelle ausführen und den Traffic auf dem internen Port sehen.
id: Dimungkinkan untuk menonton paket pada antarmuka internal, tetapi dibutuhkan sedikit senam jaringan. Pertama, Anda perlu membuat perangkat jaringan tiruan yang bisa dilihat oleh alat Linux normal. Maka Anda perlu menambahkannya ke jembatan yang berisi antarmuka internal yang ingin Anda sembunyikan. Terakhir, Anda perlu memberi tahu Open vSwitch untuk mencerminkan semua lalu lintas ke atau dari port internal ke port dummy ini. Setelah semua ini, Anda kemudian dapat menjalankan :command: `tcpdump` pada antarmuka dummy dan melihat lalu lintas di port internal.

source: It is quite common for the RabbitMQ service to hang when it is restarted or stopped. Therefore, it is highly recommended that you manually restart RabbitMQ on each controller node.
de: Es ist durchaus üblich, dass der RabbitMQ-Dienst hängt, wenn er neu gestartet oder gestoppt wird. Daher wird dringend empfohlen, RabbitMQ auf jedem Controller-Knoten manuell neu zu starten.
id: Sangat umum bagi layanan RabbitMQ untuk hang ketika dinyalakan kembali atau dihentikan. Oleh karena itu, sangat disarankan agar Anda me-restart RabbitMQ secara manual pada setiap node pengontrol.

source: It turns out the reason that this compute node locked up was a hardware issue. We removed it from the DAIR cloud and called Dell to have it serviced. Dell arrived and began working. Somehow or another (or a fat finger), a different compute node was bumped and rebooted. Great.
de: Es stellt sich heraus, dass der Grund, warum dieser Compute-Knoten gesperrt war, ein Hardwareproblem war. Wir haben es aus der DAIR-Cloud entfernt und Dell angerufen, um es warten zu lassen. Dell kam an und begann mit der Arbeit. Irgendwie oder anders (oder ein dicker Finger) wurde ein anderer Compute-Knoten gestoßen und neu gestartet. Großartig.
id: Ternyata alasan bahwa simpul komputasi ini terkunci adalah masalah perangkat keras. Kami menghapusnya dari cloud DAIR dan memanggil Dell untuk diservis. Dell tiba dan mulai bekerja. Entah bagaimana atau yang lain (atau jari yang gemuk), simpul komputasi yang berbeda dihancurkan (bumped) dan di-boot ulang. Great.

source: It was funny to read the report. It was full of people who had some strange network problem but didn't quite explain it in the same way.
de: Es war lustig, den Bericht zu lesen. Es war voll von Leuten, die ein seltsames Netzwerkproblem hatten, es aber nicht ganz auf die gleiche Weise erklärten.
id: Lucu membaca laporan itu. Itu penuh dengan orang yang memiliki beberapa masalah jaringan aneh tetapi tidak cukup menjelaskannya dengan cara yang sama.

source: It's also helpful to allocate a specific numeric range for custom and private flavors. On UNIX-based systems, nonsystem accounts usually have a UID starting at 500. A similar approach can be taken with custom flavors. This helps you easily identify which flavors are custom, private, and public for the entire cloud.
de: Es ist auch hilfreich, einen bestimmten numerischen Bereich für benutzerdefinierte und private Varianten zuzuweisen. Auf UNIX-basierten Systemen haben Nicht-system-Konten in der Regel eine UID ab 500. Ein ähnlicher Ansatz kann mit kundenspezifischen Varianten verfolgt werden. Auf diese Weise können Sie leicht erkennen, welche Varianten für die gesamte Cloud benutzerdefiniert, privat und öffentlich sind.
id: Ini juga membantu untuk mengalokasikan rentang numerik tertentu untuk flavor kustom dan pribadi. Pada sistem berbasis UNIX, akun nonsistem biasanya memiliki UID mulai dari 500. Pendekatan serupa dapat diambil dengan flavor khusus. Ini membantu Anda dengan mudah mengidentifikasi flavor mana yang khusus, pribadi, dan publik untuk keseluruhan cloud.

source: It's worth mentioning this directory in the context of failed compute nodes. This directory contains the libvirt KVM file-based disk images for the instances that are hosted on that compute node. If you are not running your cloud in a shared storage environment, this directory is unique across all compute nodes.
de: Es ist erwähnenswert, dieses Verzeichnis im Zusammenhang mit fehlgeschlagenen Compute-Knoten zu erwähnen. Dieses Verzeichnis enthält die dateibasierten libvirt KVM-Disk Images für die Instanzen, die auf diesem Compute-Knoten gehostet werden. Wenn Sie Ihre Cloud nicht in einer Shared Storage-Umgebung betreiben, ist dieses Verzeichnis für alle Compute-Knoten eindeutig.
id: Layak disebutkan direktori ini dalam konteks gagal node komputasi. Direktori ini berisi image disk berbasis file KVM libvirt untuk instance yang di-host pada node komputasi itu. Jika Anda tidak menjalankan cloud di lingkungan penyimpanan bersama, direktori ini unik di semua node komputasi.

source: Items to monitor for RabbitMQ include the number of items in each of the queues and the processing time statistics for the server.
de: Zu den zu überwachenden Elementen für RabbitMQ gehören die Anzahl der Elemente in jeder der Warteschlangen und die Verarbeitungszeitstatistiken für den Server.
id: Item yang dipantau untuk RabbitMQ mencakup jumlah item di setiap antrian dan statistik waktu pemrosesan untuk server.

source: Joe has designed and deployed several clouds at Cybera, a nonprofit where they are building e-infrastructure to support entrepreneurs and local researchers in Alberta, Canada. He also actively maintains and operates these clouds as a systems architect, and his experiences have generated a wealth of troubleshooting skills for cloud environments.
de: Joe hat mehrere Clouds bei Cybera entworfen und implementiert, einem gemeinnützigen Unternehmen, das E-Infrastrukturen aufbaut, um Unternehmer und lokale Forscher in Alberta, Kanada, zu unterstützen. Er pflegt und betreibt diese Clouds auch aktiv als Systemarchitekt, und seine Erfahrungen haben eine Fülle von Fähigkeiten zur Fehlerbehebung in Cloud-Umgebungen hervorgebracht.

source: Jon has been piloting an OpenStack cloud as a senior technical architect at the MIT Computer Science and Artificial Intelligence Lab for his researchers to have as much computing power as they need. He started contributing to OpenStack documentation and reviewing the documentation so that he could accelerate his learning.
de: Jon hat als Senior Technical Architect am MIT Computer Science and Artificial Intelligence Lab eine OpenStack-Cloud geflogen, damit seine Forscher so viel Rechenleistung haben, wie sie brauchen. Er begann, an der OpenStack-Dokumentation mitzuwirken und die Dokumentation zu überprüfen, um sein Lernen zu beschleunigen.

source: Jump to the VM specific chain.
de: Springen Sie zur VM-spezifischen Kette.
id: Beralih ke rantai spesifik VM.

source: Just as important as a backup policy is a recovery policy (or at least recovery testing).
de: Genauso wichtig wie eine Backup-Richtlinie ist eine Wiederherstellungsrichtlinie (oder zumindest ein Wiederherstellungstest).
id: Sama pentingnya dengan kebijakan cadangan adalah kebijakan pemulihan (atau setidaknya pengujian pemulihan).

source: Just running ``sync`` is not enough to ensure that the file system is consistent. We recommend that you use the ``fsfreeze`` tool, which halts new access to the file system, and create a stable image on disk that is suitable for snapshotting. The ``fsfreeze`` tool supports several file systems, including ext3, ext4, and XFS. If your virtual machine instance is running on Ubuntu, install the util-linux package to get ``fsfreeze``:
de: Es reicht nicht aus, nur ``sync`` auszuführen, um sicherzustellen, dass das Dateisystem konsistent ist. Wir empfehlen, das Tool ``fsfreeze`` zu verwenden, das den neuen Zugriff auf das Dateisystem unterbindet, und ein stabiles Abbild auf der Festplatte zu erstellen, das für Schattenkopie geeignet ist. Das ``fsfsfreeze`` Werkzeug unterstützt mehrere Dateisysteme, einschließlich ext3, ext4 und XFS. Wenn Ihre Instanz der virtuellen Maschine unter Ubuntu ausgeführt wird, installieren Sie das util-linux-Paket, um ``fsfsfreeze`` zu erhalten:

source: Key pairs
de: Schlüsselpaare
id: Key pairs (pasangan kunci)

source: Keystone is handled a little differently. To modify the logging level, edit the ``/etc/keystone/logging.conf`` file and look at the ``logger_root`` and ``handler_file`` sections.
de: Keystone wird etwas anders behandelt. Um die Protokollierungsstufe zu ändern, bearbeiten Sie die Datei ``/etc/keystone/logging.conf`` und schauen Sie sich die Abschnitte ``logger_root`` und ``handler_file`` an.
id: Keystone ditangani sedikit berbeda. Untuk memodifikasi level logging, edit file ``/etc/keystone/logging.conf`` dan lihat bagian ``logger_root`` dan ``handler_file``.

source: Keystone services
de: Keystone Dienstleistungen
id: Layanan keystone

source: Keystone, All nova services
de: Keystone, Alle nova-Dienstleistungen
id: Keystone, Semua layanan nova

source: L3-agent router namespaces are named ``qrouter-<router_uuid>``, and dhcp-agent name spaces are named ``qdhcp-<net_uuid>``. This output shows a network node with four networks running dhcp-agents, one of which is also running an l3-agent router. It's important to know which network you need to be working in. A list of existing networks and their UUIDs can be obtained by running ``openstack network list`` with administrative credentials.
de: L3-Agenten-Router-Namensräume heißen ``qrouter-<router_uuid>``, und dhcp-Agenten-Namensräume heißen ``qdhcp-<net_uuid>``. Diese Ausgabe zeigt einen Netzwerkknoten mit vier Netzwerken mit DHCP-Agenten, von denen eines auch einen l3-Agenten-Router betreibt. Es ist wichtig zu wissen, in welchem Netzwerk Sie arbeiten müssen. Eine Liste der vorhandenen Netzwerke und ihrer UUIDs erhalten Sie, indem Sie ``openstack network list`` mit administrativen Anmeldeinformationen ausführen.
id: Namespace router agen L3 dinamai ``qrouter- <router_uuid> ``, dan space nama agen dhcp-agent dinamai ``qdhcp- <net_uuid> ``. Output ini menunjukkan node jaringan dengan empat jaringan yang menjalankan dhcp-agent, salah satunya juga menjalankan router l3-agent. Sangat penting untuk mengetahui di jaringan mana Anda perlu bekerja. Daftar jaringan yang ada dan UUIDnya dapat diperoleh dengan menjalankan ``openstack network list`` dengan kredensial administratif.

source: Large instances
de: Große Instanzen
id: Instance besar

source: Launch several neutron ports:
de: Starten Sie mehrere Neutron-Ports:
id: Luncurkan beberapa port neutron:

source: Lay of the Land
de: Die Lage des Landes

source: Learn more about how to contribute to the OpenStack docs at `OpenStack Documentation Contributor Guide <https://docs.openstack.org/doc-contrib-guide/>`_.
de: Erfahren Sie mehr darüber, wie Sie zu den OpenStack-Dokumenten beitragen können, unter `OpenStack Documentation Contributor Guide <https://docs.openstack.org/doc-contrib-guide/>`_.

source: Legal requirements
de: Gesetzliche Anforderungen
id: Persyaratan legal

source: Like all major system upgrades, your upgrade could fail for one or more reasons. You can prepare for this situation by having the ability to roll back your environment to the previous release, including databases, configuration files, and packages. We provide an example process for rolling back your environment in :ref:`rolling_back_a_failed_upgrade`.
de: Wie alle wichtigen System-Upgrades kann auch Ihr Upgrade aus einem oder mehreren Gründen fehlschlagen. Sie können sich auf diese Situation vorbereiten, indem Sie Ihre Umgebung auf die vorherige Version zurücksetzen können, einschließlich Datenbanken, Konfigurationsdateien und Pakete. Wir stellen einen exemplarischen Prozess für das Zurücksetzen Ihrer Umgebung in :ref:`rolling_back_a_failed_upgrade` vor.
id: Seperti semua upgrade sistem utama, upgrade Anda bisa gagal karena satu atau beberapa alasan. Anda dapat mempersiapkan diri untuk situasi ini dengan memiliki kemampuan untuk memutar kembali lingkungan Anda ke rilis sebelumnya, termasuk database, file konfigurasi, dan paket. Kami memberikan contoh proses untuk mengembalikan lingkungan Anda di :ref:`rolling_back_a_failed_upgrade`.

source: Limit the total size (in bytes) or number of objects that can be stored in a single container.
de: Beschränken Sie die Gesamtgröße (in Bytes) oder die Anzahl der Objekte, die in einem einzigen Container gespeichert werden können.
id: Batasi ukuran total (dalam byte) atau jumlah objek yang dapat disimpan dalam satu kontainer.

source: Limit the total size (in bytes) that a user has available in the Object Storage service.
de: Begrenzt die Gesamtgröße (in Bytes), die ein Benutzer im Object Storage Service zur Verfügung hat.
id: Batasi ukuran total (dalam byte) yang telah tersedia pengguna di layanan Object Storage.

source: Linux network namespaces are a kernel feature the networking service uses to support multiple isolated layer-2 networks with overlapping IP address ranges. The support may be disabled, but it is on by default. If it is enabled in your environment, your network nodes will run their dhcp-agents and l3-agents in isolated namespaces. Network interfaces and traffic on those interfaces will not be visible in the default namespace.
de: Linux-Netzwerk-Namensräume sind eine Kernelfunktion, die der Netzwerkdienst verwendet, um mehrere isolierte Layer-2-Netzwerke mit überlappenden IP-Adressbereichen zu unterstützen. Der Support kann deaktiviert sein, ist aber standardmäßig eingeschaltet. Wenn es in Ihrer Umgebung aktiviert ist, führen Ihre Netzwerkknoten ihre dhcp-Agenten und l3-Agenten in isolierten Namensräumen aus. Netzwerkschnittstellen und Datenverkehr auf diesen Schnittstellen sind im Standard-Namensraum nicht sichtbar.
id: Namespace jaringan Linux adalah fitur kernel yang digunakan layanan jaringan untuk mendukung beberapa jaringan layer-2 yang terisolasi dengan rentang alamat IP yang tumpang tindih. Dukungan mungkin dinonaktifkan, tetapi diaktifkan secara default. Jika diaktifkan di lingkungan Anda, node jaringan Anda akan menjalankan agen dhcp dan l3-agen di ruang nama yang terisolasi. Antarmuka jaringan dan lalu lintas pada antarmuka tersebut tidak akan terlihat di namespace default.

source: List all default quotas for all tenants, as follows:
de: Führen Sie alle Standardkontingente für alle Mandanten wie folgt auf:
id: Daftar semua kuota default untuk semua tenant, sebagai berikut:

source: List the currently set quota values for a tenant, as follows:
de: Listen Sie die aktuell eingestellten Quotenwerte für einen Mandanten wie folgt auf:
id: Daftar nilai kuota yang ditetapkan saat ini untuk tenant, sebagai berikut:

source: Live Snapshots
de: Live-Schattenkopien

source: Live snapshots is a feature that allows users to snapshot the running virtual machines without pausing them. These snapshots are simply disk-only snapshots. Snapshotting an instance can now be performed with no downtime (assuming QEMU 1.3+ and libvirt 1.0+ are used).
de: Live-Schattenkopie ist eine Funktion, die es Benutzern ermöglicht, die laufenden virtuellen Maschinen zu Schattenkopie zu machen, ohne sie anzuhalten. Diese Schattenkopien sind einfach nur Festplatten-Schattenkopie. Das Schattenkopieren einer Instanz kann nun ohne Ausfallzeiten durchgeführt werden (vorausgesetzt, QEMU 1.3+ und libvirt 1.0+ werden verwendet).

source: Log in as an administrative user.
de: Melden Sie sich als administrativer Benutzer an.
id: Masuk sebagai pengguna administratif.

source: Log in to each of the controller nodes for the affected environment, and check the ``/var/log/rabbitmq`` log files for any reported issues.
de: Melden Sie sich bei jedem der Steuerungsknoten für die betroffene Umgebung an und überprüfen Sie die Protokolldateien ``/var/log/rabbitmq`` auf gemeldete Probleme.
id: Masuk ke masing-masing node pengontrol untuk lingkungan yang terpengaruh, dan periksa file log ``/var/log/rabbitmq`` untuk masalah yang dilaporkan.

source: Log location
de: Protokollstandort

source: Logging
de: Protokollierung

source: Logging and Monitoring
de: Protokollierung und Überwachung
id: Logging dan Pemantauan

source: Logging for horizon is configured in ``/etc/openstack_dashboard/local_settings.py``. Because horizon is a Django web application, it follows the `Django Logging framework conventions <https://docs.djangoproject.com/en/dev/topics/logging/>`_.
de: Die Protokollierung für den Horizont ist unter ``/etc/openstack_dashboard/local_settings.py`` konfiguriert. Da Horizon eine Django-Webanwendung ist, folgt sie den Konventionen des `Django Logging Frameworks <https://docs.djangoproject.com/en/dev/topics/logging/>`_.
id: Logging untuk horizon dikonfigurasi dalam ``/etc/openstack_dashboard/local_settings.py``. Karena horizon adalah aplikasi web Django, ia mengikuti `Django Logging framework conventions <https://docs.djangoproject.com/en/dev/topics/logging/>`_.

source: Logical separation within your nova deployment for physical isolation or redundancy.
de: Logische Trennung innerhalb Ihrer nova-Bereitstellung für physische Isolierung oder Redundanz.
id: Pemisahan logis dalam penyebaran nova Anda untuk isolasi fisik atau redundansi.

source: Logpusher is a pair of Python scripts that first listens to Jenkins build events, then converts them into Gearman jobs. Gearman provides a generic application framework to farm out work to other machines or processes that are better suited to do the work. It allows you to do work in parallel, to load balance processing, and to call functions between languages. Later, Logpusher performs Gearman jobs to push log files into logstash. Logstash indexer reads these log events, filters them to remove unwanted lines, collapse multiple events together, and parses useful information before shipping them to ElasticSearch for storage and indexing. Kibana is a logstash oriented web client for ElasticSearch.
de: Logpusher ist ein Paar Python-Skripte, die zuerst auf Jenkins Build-Ereignisse hören und sie dann in Gearman-Jobs konvertieren. Gearman bietet ein generisches Anwendungs-Framework, um Arbeiten an andere Maschinen oder Prozesse auszulagern, die besser geeignet sind, diese Arbeiten auszuführen. Es ermöglicht Ihnen, parallel zu arbeiten, die Lastausgleichsverarbeitung durchzuführen und Funktionen zwischen den Sprachen aufzurufen. Später führt Logpusher Gearman-Aufträge aus, um Logdateien in den Logstash zu verschieben. Der Logstash-Indexer liest diese Protokollereignisse, filtert sie, um unerwünschte Zeilen zu entfernen, komprimiert mehrere Ereignisse zusammen und analysiert nützliche Informationen, bevor er sie an ElasticSearch zum Speichern und Indizieren sendet. Kibana ist ein logstashorientierter Webclient für ElasticSearch.
id: Logpusher adalah sepasang skrip Python yang pertama kali mendengarkan Jenkins membuat event, kemudian mengubahnya menjadi pekerjaan Gearman. Gearman menyediakan kerangka kerja aplikasi generik untuk mengolah pekerjaan ke mesin lain atau proses yang lebih cocok untuk melakukan pekerjaan itu. Ini memungkinkan Anda melakukan pekerjaan secara paralel, memuat pemrosesan keseimbangan, dan memanggil fungsi antar bahasa. Kemudian, Logpusher melakukan pekerjaan Gearman untuk mendorong file log ke logstash. Logstash indexer membaca event log ini, memfilternya untuk menghapus baris yang tidak diinginkan, menggabungkan beberapa kejadian bersama, dan mem-parsing informasi yang berguna sebelum mengirimkannya ke ElasticSearch untuk penyimpanan dan pengindeksan. Kibana adalah klien web berorientasi logstash untuk ElasticSearch.

source: Logstash is a high performance indexing and search engine for logs. Logs from Jenkins test runs are sent to logstash where they are indexed and stored. Logstash facilitates reviewing logs from multiple sources in a single test run, searching for errors or particular events within a test run, and searching for log event trends across test runs.
de: Logstash ist eine leistungsstarke Indexierungs- und Suchmaschine für Protokolle. Protokolle aus Jenkins Testläufen werden an logstash gesendet, wo sie indiziert und gespeichert werden. Logstash ermöglicht das Überprüfen von Protokollen aus mehreren Quellen in einem einzigen Testlauf, das Suchen nach Fehlern oder bestimmten Ereignissen innerhalb eines Testlaufs und das Suchen nach Trends bei Protokollereignissen über Testläufe hinweg.
id: Logstash adalah pengindeksan dan mesin pencari kinerja tinggi untuk log. Log dari uji coba Jenkins dikirim ke logstash tempat mereka diindeks dan disimpan. Logstash memfasilitasi peninjauan log dari berbagai sumber dalam satu uji coba, mencari kesalahan atau event tertentu dalam uji coba, dan mencari tren event log di seluruh uji coba.

source: Look at your OpenStack service :term:`catalog`:
de: Schauen Sie sich Ihren OpenStack-Dienst :term:`catalog` an:
id: Lihatlah layanan OpenStack Anda :term:`catalog`:

source: Look for any errors or traces in the log file. For more information, see :doc:`ops-logging-monitoring`.
de: Suchen Sie nach Fehlern oder Spuren in der Protokolldatei. Weitere Informationen finden Sie unter :doc:`ops-logging-monitoring`.
id: Cari kesalahan atau jejak dalam file log. Untuk informasi lebih lanjut, lihat :doc: `ops-logging-monitoring`.

source: Look for connection issues identified in the log files.
de: Suchen Sie nach Verbindungsproblemen, die in den Protokolldateien identifiziert wurden.
id: Cari masalah koneksi yang diidentifikasi dalam file log.
