Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: Copy the code as shown below into ``ip_whitelist.py``. The following code is a middleware example that restricts access to a container based on IP address as explained at the beginning of the section. Middleware passes the request on to another application. This example uses the swift "swob" library to wrap Web Server Gateway Interface (WSGI) requests and responses into objects for swift to interact with. When you're done, save and close the file.
de: Kopieren Sie den Code wie unten gezeigt in ``ip_whitelist.py``. Der folgende Code ist ein Middleware-Beispiel, das den Zugriff auf einen Container basierend auf der IP-Adresse einschränkt, wie am Anfang des Abschnitts erläutert. Die Middleware leitet die Anforderung an eine andere Anwendung weiter. In diesem Beispiel wird die swift "swob"-Bibliothek verwendet, um Web Server Gateway Interface (WSGI)-Anfragen und -Antworten in Objekte zu wickeln, mit denen swift interagieren kann. Wenn Sie fertig sind, speichern und schließen Sie die Datei.
id: Salin kode seperti yang ditunjukkan di bawah ini ke ``ip_whitelist.py``. Kode berikut adalah contoh middleware yang membatasi akses ke sebuah kontainer berdasarkan alamat IP seperti yang dijelaskan di awal bagian. Middleware meneruskan permintaan ke aplikasi lain. Contoh ini menggunakan pustaka "swob" swift untuk membungkus permintaan dan respons Web Server Gateway Interface (WSGI) menjadi objek untuk berinteraksi dengan swift. Setelah selesai, simpan dan tutup file.

source: Corrective controls:
de: Korrekturmaßnahmen:
id: Kontrol korektif:

source: Create Share
de: Freigabe anlegen

source: Create Snapshots
de: Schattenkopien erstellen

source: Create a Share Network
de: Erstellen eines Freigabe-Netzwerks

source: Create a clone of your automated configuration infrastructure with changed package repository URLs.
de: Erstellen Sie einen Klon Ihrer automatisierten Konfigurationsinfrastruktur mit geänderten Paket-Repository URLs.
id: Buat klon dari infrastruktur konfigurasi otomatis Anda dengan URL repositori paket yang diubah.

source: Create a container called ``middleware-test``:
de: Erstellen Sie einen Container mit dem Namen ``Middleware-Test``:
id: Buat kontainer yang disebut ``middleware-test``:

source: Create a port on the ``Public_AGILE`` network:
de: Erstellen Sie einen Port im ``Public_AGILE`` Netzwerk:
id: Buat port di jaringan `` Public_AGILE``:

source: Create a port:
de: Erstellen Sie einen Port:
id: Membuat port:

source: Create a public share using :command:`manila create`.
de: Erstellen Sie eine öffentliche Freigabe mit :command:`manila create`.

source: Create a share network
de: Erstellen eines Freigabe-Netzwerks

source: Create an OpenStack Development Environment
de: Erstellen einer OpenStack-Entwicklungsumgebung
id: Buat Lingkungan Pengembangan OpenStack

source: Create and bring up a dummy interface, ``snooper0``:
de: Erstellen und öffnen Sie eine Dummy-Schnittstelle, ``snooper0``:
id: Membuat dan memunculkan antarmuka dummy, ``snooper0``:

source: Create context
de: Kontext anlegen
id: Buat konteks

source: Create mirror of ``patch-tun`` to ``snooper0`` (returns UUID of mirror port):
de: Erstellt einen Spiegel von ``Patch-Tun`` nach ``Snooper0``` (gibt UUID des Mirror-Ports zurück):
id: Buat mirror dari ``patch-tun`` ke ``snooper0`` (mengembalikan UUID port mirror):

source: Create share
de: Freigabe erstellen

source: Create share networks
de: Erstellen von Freigabenetzwerken
id: Buat jaringan share

source: Create snapshots
de: Schattenkopien erstellen

source: Create the ``ip_scheduler.py`` Python source code file:
de: Erstellen Sie die ``ip_scheduler.py`` Python-Quellcode-Datei:
id: Buat file kode sumber Python ``ip_scheduler.py``:

source: Create the ``ip_whitelist.py`` Python source code file:
de: Erstellen Sie die ``ip_whitelist.py`` Python-Quelltextdatei:
id: Buat file kode sumber Python ``ip_whitelist.py``:

source: Create ways to automatically test these actions.
de: Erstellen Sie Möglichkeiten, diese Aktionen automatisch zu testen.
id: Buat cara untuk menguji tindakan ini secara otomatis.

source: Create, update, delete, and force-delete shares
de: Erstellen, Aktualisieren, Löschen und Erzwingen von Freigaben
id: Buat, perbarui, hapus, dan hapus paksa share

source: Creating New Users
de: Neue Benutzer anlegen

source: Currently, you have a share and would like to control access to this share for other users. For this, you have to perform a number of steps and operations. Before getting to manage access to the share, pay attention to the following important parameters. To grant or deny access to a share, specify one of these supported share access levels:
de: Derzeit haben Sie eine Freigabe und möchten den Zugriff auf diese Freigabe für andere Benutzer steuern. Dazu müssen Sie eine Reihe von Schritten und Operationen durchführen. Bevor Sie den Zugriff auf die Freigabe verwalten, beachten Sie die folgenden wichtigen Parameter. Um den Zugriff auf eine Freigabe zu gewähren oder zu verweigern, geben Sie eine dieser unterstützten Zugriffsebenen an:

source: Customization
de: Anpassung
id: Kustomisasi

source: Customizing Authorization
de: Customizing-Berechtigung

source: Customizing Object Storage (Swift) Middleware
de: Anpassen der Middleware für die Objektspeicherung (Swift)
id: Menyesuaikan Object Storage (Swift) Middleware

source: Customizing the Dashboard (Horizon)
de: Anpassen des Dashboards (Horizon)
id: Menyesuaikan Dasbor (Horizon)

source: Customizing the OpenStack Compute (nova) Scheduler
de: Anpassen des OpenStack Compute (nova) Schedulers
id: Menyesuaikan OpenStack Compute (nova) Scheduler

source: DAIR is hosted at two different data centers across Canada: one in Alberta and the other in Quebec. It consists of a cloud controller at each location, although, one is designated the "master" controller that is in charge of central authentication and quotas. This is done through custom scripts and light modifications to OpenStack. DAIR is currently running Havana.
de: DAIR wird in zwei verschiedenen Rechenzentren in ganz Kanada gehostet: einem in Alberta und einem in Quebec. Es besteht aus einem Cloud-Controller an jedem Standort, wobei einer als "Master"-Controller bezeichnet wird, der für die zentrale Authentifizierung und Quoten zuständig ist. Dies geschieht durch benutzerdefinierte Skripte und leichte Änderungen an OpenStack. DAIR betreibt derzeit Havanna.
id: DAIR di-host di dua pusat data berbeda di Kanada: satu di Alberta dan yang lainnya di Quebec. Ini terdiri dari pengontrol cloud di setiap lokasi, meskipun, satu ditunjuk pengontrol "master" yang bertanggung jawab atas otentikasi pusat dan kuota. Ini dilakukan melalui skrip khusus dan modifikasi ringan ke OpenStack. DAIR saat ini menjalankan Havana.

source: DHCP agents running on OpenStack networks run in namespaces similar to the l3-agents. DHCP namespaces are named ``qdhcp-<uuid>`` and have a TAP device on the integration bridge. Debugging of DHCP issues usually involves working inside this network namespace.
de: DHCP-Agenten, die in OpenStack-Netzwerken ausgeführt werden, laufen in Namensräumen ähnlich den l3-Agenten. DHCP-Namensräume heißen ``qdhcp-<uuid>`` und haben ein TAP-Gerät auf der Integrationsbrücke. Das Debuggen von DHCP-Problemen erfordert in der Regel das Arbeiten innerhalb dieses Netzwerk-Namensraums.
id: Agen DHCP yang berjalan pada jaringan OpenStack dijalankan dalam namespace yang mirip dengan agen l3. Namespace DHCP diberi nama ``qdhcp- <uuid> `` dan memiliki perangkat TAP di jembatan integrasi. Debugging masalah DHCP biasanya melibatkan bekerja di dalam namespace jaringan ini.

source: DHCP traffic uses UDP. The client sends from port 68 to port 67 on the server. Try to boot a new instance and then systematically listen on the NICs until you identify the one that isn't seeing the traffic. To use ``tcpdump`` to listen to ports 67 and 68 on br100, you would do:
de: Der DHCP-Verkehr verwendet UDP. Der Client sendet von Port 68 an Port 67 auf dem Server. Versuchen Sie, eine neue Instanz zu booten und dann systematisch auf die NICs zu hören, bis Sie diejenige identifizieren, die den Traffic nicht sieht. Um ``tcpdump`` zu verwenden, um die Ports 67 und 68 auf br100 zu hören, würden Sie es tun:
id: Lalu lintas DHCP menggunakan UDP. Klien mengirim dari port 68 ke port 67 di server. Cobalah untuk mem-boot instance baru dan kemudian secara sistematis mendengarkan NIC sampai Anda mengidentifikasi yang tidak melihat lalu lintas. Untuk menggunakan ``tcpdump`` untuk mendengarkan port 67 dan 68 di br100, Anda harus:

source: DNS service (designate)
de: DNS Dienst (designate)
id: Layanan DNS (ditunjuk)

source: Daily
de: Täglich
id: Harian

source: Dashboard - In typical environments, updating Dashboard only requires restarting the Apache HTTP service.
de: Dashboard - In typischen Umgebungen erfordert die Aktualisierung des Dashboards nur einen Neustart des Apache HTTP-Dienstes.
id: Dasbor - Dalam lingkungan umum, memperbarui Dasbor hanya membutuhkan restarting layanan HTTP Apache.

source: Dashboard node
de: Dashboard-Knoten

source: Data compliance policies governing certain types of information needing to reside in certain locations due to regulatory issues - and more importantly, cannot reside in other locations for the same reason.
de: Daten-Compliance-Richtlinien für bestimmte Arten von Informationen, die aufgrund von regulatorischen Problemen an bestimmten Orten aufbewahrt werden müssen - und vor allem, aus dem gleichen Grund nicht an anderen Orten aufbewahrt werden dürfen.
id: Kebijakan kepatuhan data yang mengatur jenis informasi tertentu yang perlu berada di lokasi tertentu karena masalah peraturan - dan yang lebih penting, tidak dapat berada di lokasi lain karena alasan yang sama.

source: Data location policies ensuring that the services deployed to the cloud are used according to laws and regulations in place for the employees, foreign subsidiaries, or third parties.
de: Richtlinien zur Datenlokalisierung, die sicherstellen, dass die in der Cloud bereitgestellten Dienste gemäß den für die Mitarbeiter, ausländische Tochtergesellschaften oder Dritte geltenden Gesetzen und Vorschriften genutzt werden.
id: Kebijakan lokasi data yang memastikan bahwa layanan yang digunakan untuk cloud digunakan sesuai dengan hukum dan peraturan yang berlaku untuk karyawan, anak perusahaan asing, atau pihak ketiga.

source: Data ownership policies governing the possession and responsibility for data.
de: Richtlinien zum Datenbesitz, die den Besitz und die Verantwortung für Daten regeln.
id: Kebijakan kepemilikan data yang mengatur kepemilikan dan tanggung jawab atas data.

source: Data processing service for OpenStack (sahara)
de: Datenverarbeitungsdienst für OpenStack (Sahara)
id: Layanan pemrosesan data untuk OpenStack (sahara)

source: Data retention policies ensuring storage of persistent data and records management to meet data archival requirements.
de: Datenhaltungsrichtlinien, die die Speicherung persistenter Daten und das Records Management sicherstellen, um den Anforderungen der Datenarchivierung gerecht zu werden.
id: Kebijakan penyimpanan data memastikan penyimpanan data yang persisten dan manajemen catatan untuk memenuhi persyaratan arsip data.

source: Data security domains
de: Datensicherheitsdomänen
id: Domain keamanan data

source: Data sovereignty policies governing the storage of data in foreign countries or otherwise separate jurisdictions.
de: Richtlinien zur Datenhoheit, die die Speicherung von Daten im Ausland oder in anderen getrennten Jurisdiktionen regeln.
id: Kebijakan kedaulatan data yang mengatur penyimpanan data di negara asing atau yurisdiksi terpisah.

source: Data storage regulations in Europe are currently driven by provisions of the `Data protection board <https://edpb.europa.eu/>`_. `Financial Industry Regulatory Authority <http://finra.complinet.com/>`_ works on this in the United States.
de: Die Datenschutzbestimmungen in Europa richten sich derzeit nach den Bestimmungen der `Datenschutzbehörde <https://edpb.europa.eu/>`_. Die `Financial Industry Regulatory Authority <http://finra.complinet.com/>`_ arbeitet in den Vereinigten Staaten daran.
id: Peraturan penyimpanan data di Eropa saat ini didorong oleh ketentuan `Data protection board <https://edpb.europa.eu/>`_. `Financial Industry Regulatory Authority <http://finra.complinet.com/>`_ bekerja pada ini di Amerika Serikat.

source: Database Backups
de: Datenbank Backups
id: Backup Database

source: Database Connectivity
de: Datenbank-Konnektivität
id: Konektivitas Basis Data

source: Database as a Service (trove)
de: Datenbank als Dienst (trove)

source: Databases
de: Datenbanken

source: Dealing with Network Namespaces
de: Umgang mit Netzwerk-Namensräumen
id: Berurusan dengan Network Namespaces

source: Debugging DHCP Issues with nova-network
de: Debuggen von DHCP-Problemen mit nova-network
id: Debugging Issue DHCP dengan nova-network

source: Debugging DNS Issues
de: Debuggen von DNS-Problemen
id: Mendebug DNS Issues

source: Decrease DHCP timeouts by modifying the :file:`/etc/nova/nova.conf` file on the compute nodes back to the original value for your environment.
de: Verringern Sie die DHCP-Timeouts, indem Sie die Datei :file:`/etc/nova/nova.conf` auf den Compute-Knoten auf den ursprünglichen Wert für Ihre Umgebung zurücksetzen.
id: Kurangi waktu tunggu DHCP dengan memodifikasi file :file:`/etc/nova/nova.conf` pada komputasi nodes kembali ke nilai asli untuk lingkungan Anda.

source: Dedicate entire disks to certain partitions. For example, you could allocate disk one and two entirely to the boot, root, and swap partitions under a RAID 1 mirror. Then, allocate disk three and four entirely to the LVM partition, also under a RAID 1 mirror. Disk I/O should be better because I/O is focused on dedicated tasks. However, the LVM partition is much smaller.
de: Weisen Sie ganze Festplatten bestimmten Partitionen zu. Sie können beispielsweise die Festplatte eins und zwei vollständig den Boot-, Root- und Swap-Partitionen unter einem RAID-1-Spiegel zuordnen. Ordnen Sie dann die Festplatten drei und vier vollständig der LVM-Partition zu, auch unter einem RAID-1-Spiegel. Festplatten-I/O sollte besser sein, da sich die I/O auf dedizierte Aufgaben konzentriert. Die LVM-Partition ist jedoch viel kleiner.
id: Dedikasikan seluruh disk untuk partisi tertentu. Misalnya, Anda bisa mengalokasikan disk satu dan dua seluruhnya untuk partisi boot, root, dan swap di bawah mirror RAID 1. Kemudian, alokasikan disk tiga dan empat seluruhnya ke partisi LVM, juga di bawah mirror RAID 1. Disk I/O harus lebih baik karena I/O fokus pada tugas khusus. Namun, partisi LVM jauh lebih kecil.

source: Default CPU overcommit ratio (``cpu_allocation_ratio`` in the ``nova.conf`` file) of 16:1.
de: Standard CPU Overcommit Ratio (``cpu_allocation_ratio`` in der `nova.conf`` Datei) von 16:1.
id: Rasio overcommit CPU default (``cpu_allocation_ratio`` dalam file ``nova.conf``) dari 16: 1.

source: Default drop rule for unmatched traffic.
de: Standard-Drop-Regel für unübertroffenen Traffic.
id: Aturan penurunan default untuk lalu lintas yang tidak cocok.

source: Define new share types
de: Neue Freigabearten definieren
id: Tentukan jenis share baru

source: Delete Share
de: Freigabe löschen

source: Delete the instance and create a new instance using the ``--nic port-id`` option.
de: Löschen Sie die Instanz und erstellen Sie eine neue Instanz mit der Option ``--nic port-id``.
id: Hapus instance dan buat instance baru menggunakan opsi ``--nic port-id``.

source: Delete the ports that are not needed:
de: Löschen Sie die nicht benötigten Ports:
id: Hapus port yang tidak diperlukan:

source: Deleting Images
de: Löschen von Abbildern
id: Menghapus Image

source: Depending on the type of server, the contents and order of your package list might vary from this example.
de: Je nach Servertyp können Inhalt und Reihenfolge Ihrer Paketliste von diesem Beispiel abweichen.
id: Bergantung pada jenis server, isi dan urutan daftar paket Anda mungkin berbeda dari contoh ini.

source: Depending on your specific configuration, upgrading all packages might restart or break services supplemental to your OpenStack environment. For example, if you use the TGT iSCSI framework for Block Storage volumes and the upgrade includes new packages for it, the package manager might restart the TGT iSCSI services and impact connectivity to volumes.
de: Abhängig von Ihrer spezifischen Konfiguration kann die Aktualisierung aller Pakete einen Neustart oder eine Unterbrechung der Dienste als Ergänzung zu Ihrer OpenStack-Umgebung bewirken. Wenn Sie beispielsweise das TGT iSCSI-Framework für Block Storage-Volumes verwenden und das Upgrade neue Pakete für diese enthält, kann der Paketmanager die TGT iSCSI-Dienste neu starten und die Konnektivität auf Volumes beeinträchtigen.
id: Bergantung pada konfigurasi spesifik Anda, upgrading semua paket mungkin restart atau merusak (break) layanan tambahan ke lingkungan OpenStack Anda. Misalnya, jika Anda menggunakan framework TGT iSCSI untuk volume Block Storage dan upgrade termasuk paket-paket baru untuk itu, manajer paket mungkin restart layanan TGT iSCSI dan berdampak konektivitas ke volume.

source: Deployment
de: Bereitstellung

source: Deprecation of Nova Network
de: Verwerfung des Nova-Netzwerks
id: Penghentian Nova Network

source: Describes a manual installation process, as in, by hand, without automation, for multiple distributions based on a packaging system:
de: Beschreibt einen manuellen Installationsprozess, wie in der manuellen, ohne Automatisierung, für mehrere Distributionen auf der Grundlage eines Verpackungssystems:

source: Describes potential strategies for making your OpenStack services and related controllers and data stores highly available
de: Beschreibt mögliche Strategien, um Ihre OpenStack-Dienste und die damit verbundenen Steuerungen und Datenspeicher hochverfügbar zu machen

source: Description
de: Beschreibung
id: Deskripsi

source: Design and create an architecture for your first nontrivial OpenStack cloud. After you read this guide, you'll know which questions to ask and how to organize your compute, networking, and storage resources and the associated software packages.
de: Entwerfen und erstellen Sie eine Architektur für Ihre erste nicht-triviale OpenStack-Cloud. Nachdem Sie dieses Handbuch gelesen haben, wissen Sie, welche Fragen Sie stellen müssen und wie Sie Ihre Rechen-, Netzwerk- und Speicherressourcen und die zugehörigen Softwarepakete organisieren.

source: Designate a server as the central logging server. The best practice is to choose a server that is solely dedicated to this purpose. Create a file called ``/etc/rsyslog.d/server.conf`` with the following contents:
de: Geben Sie einen Server als zentralen Protokollierungsserver an. Die beste Vorgehensweise ist die Wahl eines Servers, der ausschließlich für diesen Zweck bestimmt ist. Erstellen Sie eine Datei namens ``/etc/rsyslog.d/server.conf`` mit folgendem Inhalt:
id: Tentukan server sebagai server logging pusat. Praktik terbaik adalah memilih server yang semata-mata didedikasikan untuk tujuan ini. Buat file bernama ``/etc/rsyslog.d/server.conf`` dengan konten berikut:

source: Despite only outputting the newly added rule, this operation is additive:
de: Obwohl nur die neu hinzugefügte Regel ausgegeben wird, ist diese Operation additiv:
id: Meskipun hanya mengeluarkan aturan yang baru ditambahkan, operasi ini aditif:

source: Detective controls:
de: Detektivkontrollen:
id: Kontrol detektif:

source: Determine which OpenStack packages are installed on your system. Use the :command:`dpkg --get-selections` command. Filter for OpenStack packages, filter again to omit packages explicitly marked in the ``deinstall`` state, and save the final output to a file. For example, the following command covers a controller node with keystone, glance, nova, neutron, and cinder:
de: Bestimmen Sie, welche OpenStack-Pakete auf Ihrem System installiert sind. Verwenden Sie den Befehl :command:`dpkg --get-selections`. Filtern Sie nach OpenStack-Paketen, filtern Sie erneut, um Pakete auszulassen, die explizit im Zustand ``Deinstallieren`` markiert sind, und speichern Sie die endgültige Ausgabe in einer Datei. Der folgende Befehl umfasst beispielsweise einen Controller-Knoten mit Keystone, glance, nova, neutron und cinder:
id: Tentukan paket OpenStack mana yang diinstal pada sistem Anda. Gunakan perintah :command:`dpkg --get-selections`. Saring untuk paket OpenStack, saring lagi untuk menghilangkan paket yang secara eksplisit ditandai dalam keadaan ``deinstall``, dan simpan hasil akhir ke file. Misalnya, perintah berikut ini mencakup node pengontrol dengan keystone, glance, nova, neutron, dan cinder:

source: Determine which servers the RabbitMQ alarms are coming from.
de: Bestimmen Sie, von welchen Servern die RabbitMQ-Alarme kommen.
id: Tentukan dari server mana alarm RabbitMQ berasal.

source: Determining Which Component Is Broken
de: Bestimmung, welche Komponente beschädigt ist
id: Menentukan Komponen Yang Rusak

source: Determining cloud scalability
de: Bestimmung der Cloud-Skalierbarkeit
id: Menentukan skalabilitas cloud

source: Determining the scalability of your cloud and how to improve it requires balancing many variables. No one solution meets everyone's scalability goals. However, it is helpful to track a number of metrics. You can define virtual hardware templates called "flavors" in OpenStack, which will impact your cloud scaling decisions. These templates define sizes for memory in RAM, root disk size, amount of ephemeral data disk space available, and the number of CPU cores.
de: Um die Skalierbarkeit Ihrer Cloud zu bestimmen und zu verbessern, müssen viele Variablen ausgeglichen werden. Keine einzige Lösung erfüllt die Skalierungsziele aller Beteiligten. Es ist jedoch hilfreich, eine Reihe von Kennzahlen zu verfolgen. Sie können in OpenStack virtuelle Hardware-Vorlagen, sogenannte "Flavors", definieren, die sich auf Ihre Cloud-Skalierungsentscheidungen auswirken. Diese Vorlagen definieren Größen für den Speicher im RAM, die Größe der Root-Festplatte, die Menge des verfügbaren ephemeren Datenspeicherplatzes und die Anzahl der CPU-Kerne.
id: Menentukan skalabilitas cloud Anda dan cara memperbaikinya memerlukan penyeimbangan banyak variabel. Tidak ada solusi yang memenuhi sasaran skalabilitas semua orang. Namun, melacak sejumlah metrik bermanfaat. Anda dapat mendefinisikan template perangkat keras virtual yang disebut "flavors" di OpenStack, yang akan memengaruhi keputusan penskalaan cloud Anda. Template ini menentukan ukuran untuk memori dalam RAM, ukuran disket root, jumlah ruang disk data sementara yang tersedia, dan jumlah core CPU.

source: Deterrent controls:
de: Abschreckende Kontrollen:
id: Kontrol pencegah (deterrent):

source: Develop an upgrade procedure and assess it thoroughly by using a test environment similar to your production environment.
de: Entwickeln Sie ein Upgrade-Verfahren und bewerten Sie es gründlich, indem Sie eine Testumgebung ähnlich Ihrer Produktionsumgebung verwenden.
id: Kembangkan prosedur upgrade dan nilai secara menyeluruh dengan menggunakan lingkungan pengujian yang serupa dengan lingkungan produksi Anda.

source: Diagnose Your Compute Nodes
de: Diagnose Ihrer Compute-Knoten
id: Diagnosis Node Komputasi Anda

source: Diane works on the OpenStack API documentation tirelessly. She helped out wherever she could on this project.
de: Diane arbeitet unermüdlich an der Dokumentation der OpenStack-API. Sie half bei diesem Projekt aus, wo immer sie konnte.

source: Differences Between Various Drivers
de: Unterschiede zwischen verschiedenen Treibern
id: Perbedaan Antara Berbagai Driver
