Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: You can configure some services, such as ``nova-api`` and ``glance-api``, to use multiple processes by changing a flag in their configuration file allowing them to share work between multiple cores on the one machine.
de: Sie können einige Dienste, wie z.B. ``nova-api`` und ``glance-api``, so konfigurieren, dass sie mehrere Prozesse verwenden, indem Sie ein Flag in ihrer Konfigurationsdatei ändern, das es ihnen ermöglicht, die Arbeit zwischen mehreren Kernen auf einer Maschine zu teilen.
id: Anda dapat mengkonfigurasi beberapa layanan, seperti ``nova-api`` dan ``glance-api``, untuk menggunakan beberapa proses dengan mengubah tanda pada file konfigurasi mereka yang memungkinkan mereka untuk berbagi kerja antara beberapa core pada satu mesin.

source: You can create a list of instances that are hosted on the compute node by performing the following command:
de: Sie können eine Liste von Instanzen erstellen, die auf dem Compute-Knoten bereitgestellt werden, indem Sie den folgenden Befehl ausführen:
id: Anda dapat membuat daftar instance yang dihosting di node komputasi dengan melakukan perintah berikut:

source: You can create a share in a network, list shares, and show information for, update, and delete a specified share. You can also create snapshots of shares (see `Share snapshots <https://docs.openstack.org/manila/latest/admin/shared-file-systems-snapshots.html>`__ in OpenStack Manila Administrator Guide).
de: Sie können eine Freigabe in einem Netzwerk erstellen, Freigaben auflisten und Informationen für eine bestimmte Freigabe anzeigen, aktualisieren und löschen. Sie können auch Schnappschüsse von Freigaben erstellen (siehe `Share Schnappschüsse <https://docs.openstack.org/manila/latest/admin/shared-file-systems-snapshots.html>`__ im OpenStack Manila Administrator Guide).
id: Anda dapat membuat share di jaringan, daftar share, dan menampilkan informasi untuk, memperbarui, dan menghapus share yang ditentukan. Anda juga dapat membuat snapshot pembagian (lihat `Share snapshots <https://docs.openstack.org/manila/latest/admin/shared-file-systems-snapshots.html>`__ di OpenStack Manila Administrator Guide).

source: You can create automated alerts for critical processes by using Nagios and NRPE. For example, to ensure that the ``nova-compute`` process is running on the compute nodes, create an alert on your Nagios server:
de: Mit Nagios und NRPE können Sie automatisierte Warnmeldungen für kritische Prozesse erstellen. Um beispielsweise sicherzustellen, dass der Prozess ``nova-compute`` auf den Compute-Knoten läuft, erstellen Sie eine Warnung auf Ihrem Nagios-Server:
id: Anda dapat membuat lansiran otomatis untuk proses kritis dengan menggunakan Nagios dan NRPE. Misalnya, untuk memastikan bahwa proses ``nova-compute`` sedang berjalan di node komputasi, buat peringatan di server Nagios Anda:

source: You can determine the package versions available for reversion by using the ``apt-cache policy`` command. For example:
de: Sie können die für die Reversion verfügbaren Paketversionen mit dem Befehl ``apt-cache policy`` bestimmen. Zum Beispiel:
id: Anda dapat menentukan versi paket yang tersedia untuk pembalikan dengan menggunakan perintah ``apt-cache policy``. Sebagai contoh:

source: You can easily automate this process by creating a cron job that runs the following script once per day:
de: Sie können diesen Prozess einfach automatisieren, indem Sie einen Cron-Job erstellen, der das folgende Skript einmal täglich ausführt:
id: Anda dapat dengan mudah mengotomatiskan proses ini dengan membuat tugas cron yang menjalankan skrip berikut sekali sehari:

source: You can explicitly ask for pending member status to view shared images not yet accepted:
de: Sie können ausdrücklich um den Status eines ausstehenden Mitglieds bitten, um freigegebene Abbilder anzuzeigen, die noch nicht akzeptiert wurden:
id: Anda dapat secara eksplisit meminta status anggota yang ditangguhkan untuk melihat image yang dibagikan yang belum diterima:

source: You can facilitate the horizontal expansion of your cloud by adding nodes. Adding compute nodes is straightforward since they are easily picked up by the existing installation. However, you must consider some important points when you design your cluster to be highly available.
de: Sie können die horizontale Expansion Ihrer Cloud durch Hinzufügen von Knoten erleichtern. Das Hinzufügen von Compute-Knoten ist einfach, da sie von der bestehenden Installation leicht übernommen werden können. Allerdings müssen Sie einige wichtige Punkte berücksichtigen, wenn Sie Ihren Cluster so gestalten, dass er hochverfügbar ist.
id: Anda dapat memfasilitasi ekspansi horisontal cloud Anda dengan menambahkan node. Menambahkan node komputasi sangat mudah karena mudah diambil oleh instalasi yang ada. Namun, Anda harus mempertimbangkan beberapa poin penting ketika Anda mendesain cluster Anda menjadi sangat tersedia.

source: You can find the version of the Compute installation by using the OpenStack command-line client:
de: Die Version der Compute-Installation finden Sie mit dem OpenStack-Kommandozeilen-Client:
id: Anda dapat menemukan versi instalasi Compute dengan menggunakan klien command-line OpenStack:

source: You can follow a similar pattern in other projects that use the Python Paste framework. Simply create a middleware module and plug it in through configuration. The middleware runs in sequence as part of that project's pipeline and can call out to other services as necessary. No project core code is touched. Look for a ``pipeline`` value in the project's ``conf`` or ``ini`` configuration files in ``/etc/<project>`` to identify projects that use Paste.
de: Sie können ein ähnliches Muster in anderen Projekten verfolgen, die das Python Paste Framework verwenden. Erstellen Sie einfach ein Middleware-Modul und schließen Sie es über die Konfiguration an. Die Middleware läuft im Rahmen der Projektpipeline nacheinander und kann bei Bedarf weitere Dienste aufrufen. Es wird kein Projektkern-Code berührt. Suchen Sie nach einem ``Pipeline`` Wert in den Konfigurationsdateien des Projekts ``conf`` oder ``ini`` in `/etc/<project>``, um Projekte zu identifizieren, die Paste verwenden.
id: Anda bisa mengikuti pola serupa di proyek lain yang menggunakan framework Python Paste. Cukup buat modul middleware dan pasang melalui konfigurasi. Middleware berjalan secara berurutan sebagai bagian dari project's pipeline itu dan dapat memanggil layanan lain yang diperlukan. Tidak ada kode inti proyek yang disentuh. Cari nilai ``pipeline`` di file konfigurasi ``conf`` atau ``ini`` proyek di ``/etc/<project>`` untuk mengidentifikasi proyek yang menggunakan Paste.

source: You can follow the progress being made on IPV6 support by watching the `neutron IPv6 Subteam at work <https://wiki.openstack.org/wiki/Meetings/Neutron-IPv6-Subteam>`_.
de: Sie können den Fortschritt beim IPV6-Support verfolgen, indem Sie das `Neutron IPv6 Subteam bei der Arbeit beobachten <https://wiki.openstack.org/wiki/Meetings/Neutron-IPv6-Subteam>`_.
id: Anda dapat mengikuti kemajuan yang dibuat pada dukungan IPV6 dengan melihat `neutron IPv6 Subteam at work <https://wiki.openstack.org/wiki/Meetings/Neutron-IPv6-Subteam>`_.

source: You can modify this example script on each node to handle different services.
de: Sie können dieses Beispielskript auf jedem Knoten ändern, um verschiedene Dienste zu verwalten.
id: Anda dapat memodifikasi skrip contoh ini di setiap node untuk menangani layanan yang berbeda.

source: You can now access the contents of ``/mnt``, which correspond to the first partition of the instance's disk.
de: Sie können nun auf den Inhalt von ``/mnt`` zugreifen, der der ersten Partition der Festplatte der Instanz entspricht.
id: Anda sekarang dapat mengakses konten ``/mnt``, yang sesuai dengan partisi pertama dari disk instance.

source: You can now create a public share with my_share_net network, default share type, NFS shared file systems protocol, and 1 GB size:
de: Sie können nun eine öffentliche Freigabe mit my_share_net-Netzwerk, Standard-Freigabetyp, NFS-Protokoll für gemeinsame Dateisysteme und 1 GB Größe erstellen:

source: You can now get the related floating IP entry:
de: Sie können nun den zugehörigen Floating IP-Eintrag erhalten:
id: Anda sekarang bisa mendapatkan entri IP mengambang terkait:

source: You can obtain extra information about virtual machines that are running—their CPU usage, the memory, the disk I/O or network I/O—per instance, by running the :command:`nova diagnostics` command with a server ID:
de: Sie können zusätzliche Informationen über virtuelle Maschinen, die ausgeführt werden, erhalten - ihre CPU-Auslastung, den Speicher, die Festplatten-I/O oder die Netzwerk-I/O pro Instanz, indem Sie den Befehl :command:`nova diagnostics` mit einer Server-ID ausführen:
id: Anda dapat memperoleh informasi tambahan tentang mesin virtual yang sedang berjalan —their CPU usage, the memory, the disk I/O or network I/O—per instance, dengan menjalankan perintah :command:`nova diagnostics` dengan ID server:

source: You can obtain further statistics by looking for the number of successful requests:
de: Weitere Statistiken erhalten Sie, indem Sie nach der Anzahl der erfolgreichen Anfragen suchen:
id: Anda dapat memperoleh statistik lebih lanjut dengan mencari jumlah permintaan yang berhasil:

source: You can optionally also deallocate the IP from the user's pool:
de: Optional können Sie die IP auch aus dem Pool des Benutzers entfernen:
id: Secara opsional Anda juga dapat membatalkan alokasi IP dari kumpulan pengguna:

source: You can perform a couple of tricks with the database to either more quickly retrieve information or fix a data inconsistency error—for example, an instance was terminated, but the status was not updated in the database. These tricks are discussed throughout this book.
de: Sie können mit der Datenbank ein paar Tricks durchführen, um entweder schneller Informationen abzurufen oder einen Dateninkonsistenzfehler zu beheben, z.B. wurde eine Instanz abgebrochen, aber der Status wurde nicht in der Datenbank aktualisiert. Diese Tricks werden in diesem Buch diskutiert.
id: Anda dapat melakukan beberapa trik dengan database untuk mengambil informasi lebih cepat atau memperbaiki kesalahan inkonsistensi data — misalnya, sebuah instance dihentikan, tetapi statusnya tidak diperbarui dalam database. Trik ini dibahas di seluruh buku ini.

source: You can re-enable the ``nova-compute`` service by undoing the commands:
de: Sie können den Dienst ``nova-compute`` wieder aktivieren, indem Sie die Befehle rückgängig machen:
id: Anda dapat mengaktifkan kembali layanan ``nova-compute`` dengan membatalkan perintah:

source: You can read a small selection of use cases from the OpenStack community with some technical details and further resources.
de: Sie können eine kleine Auswahl von Anwendungsfällen aus der OpenStack-Community mit einigen technischen Details und weiteren Ressourcen lesen.

source: You can restrict a project's image storage by total number of bytes. Currently, this quota is applied cloud-wide, so if you were to set an Image quota limit of 5 GB, then all projects in your cloud will be able to store only 5 GB of images and snapshots.
de: Sie können den Bildspeicher eines Projekts auf die Gesamtzahl der Bytes beschränken. Derzeit wird diese Quote cloud-weit angewendet, d.h. wenn Sie eine Abbild-Quota von 5 GB festlegen, dann können alle Projekte in Ihrer Cloud nur 5 GB Abbilder und Schattenkopien speichern.
id: Anda dapat membatasi penyimpanan image proyek dengan jumlah total byte. Saat ini, kuota ini diterapkan secara cloud-wide, jadi jika Anda menetapkan batas kuota image 5 GB, maka semua proyek di cloud Anda akan dapat menyimpan hanya 5 GB image dan snapshot.

source: You can safely ignore the state of ``virbr0``, which is a default bridge created by libvirt and not used by OpenStack.
de: Sie können den Zustand von ``virbr0`` ignorieren, das ist eine Standardbrücke, die von libvirt erstellt und von OpenStack nicht verwendet wird.
id: Anda dapat dengan aman mengabaikan status ``virbr0``, yang merupakan jembatan default yang dibuat oleh libvirt dan tidak digunakan oleh OpenStack.

source: You can save resources by looking at the best fit for the hardware you have in place already. You might have some high-density storage hardware available. You could format and repurpose those servers for OpenStack Object Storage. All of these considerations and input from users help you build your use case and your deployment plan.
de: Sie können Ressourcen sparen, indem Sie nach der besten Lösung für die Hardware suchen, die Sie bereits installiert haben. Möglicherweise haben Sie eine High-Density-Speicherhardware zur Verfügung. Sie können diese Server für OpenStack Object Storage formatieren und neu verwenden. All diese Überlegungen und Anregungen von Anwendern helfen Ihnen, Ihren Anwendungsfall und Ihren Bereitstellungsplan zu erstellen.
id: Anda dapat menghemat sumber daya dengan melihat yang paling cocok untuk perangkat keras yang Anda miliki. Anda mungkin memiliki beberapa perangkat keras penyimpanan kepadatan tinggi yang tersedia. Anda bisa memformat dan menggunakan kembali server-server itu untuk OpenStack Object Storage. Semua pertimbangan dan masukan dari pengguna ini membantu Anda membangun kasus penggunaan (use case) dan rencana penerapan Anda.

source: You can save time by understanding the use cases for the cloud you want to create. Use cases for OpenStack are varied. Some include object storage only; others require preconfigured compute resources to speed development-environment set up; and others need fast provisioning of compute resources that are already secured per tenant with private networks. Your users may have need for highly redundant servers to make sure their legacy applications continue to run. Perhaps a goal would be to architect these legacy applications so that they run on multiple instances in a cloudy, fault-tolerant way, but not make it a goal to add to those clusters over time. Your users may indicate that they need scaling considerations because of heavy Windows server use.
de: Sie können Zeit sparen, indem Sie die Anwendungsfälle für die zu erstellende Cloud verstehen. Die Anwendungsfälle für OpenStack sind vielfältig. Einige beinhalten nur die Speicherung von Objekten, andere erfordern vorkonfigurierte Compute-Ressourcen, um die Einrichtung der Entwicklungsumgebung zu beschleunigen, und wieder andere benötigen eine schnelle Bereitstellung von Compute-Ressourcen, die bereits pro Mandant mit privaten Netzwerken gesichert sind. Ihre Benutzer benötigen möglicherweise hochredundante Server, um sicherzustellen, dass ihre Legacy-Anwendungen weiterhin ausgeführt werden. Vielleicht wäre es ein Ziel, diese Legacy-Anwendungen so zu gestalten, dass sie auf mehreren Instanzen in einer cloudy, fehlertoleranten Weise laufen, aber es nicht zu einem Ziel machen, diese Cluster im Laufe der Zeit zu erweitern. Ihre Benutzer können angeben, dass sie aufgrund der starken Nutzung des Windows-Servers Skalierungsüberlegungen benötigen.
id: Anda dapat menghemat waktu dengan memahami kasus penggunaan untuk cloud yang ingin Anda buat. Kasus penggunaan untuk OpenStack bervariasi. Beberapa hanya menyertakan penyimpanan objek; yang lain membutuhkan sumber daya komputasi yang telah dikonfigurasikan sebelumnya untuk mempercepat pengaturan lingkungan pengembangan; dan yang lainnya membutuhkan penyediaan sumber daya komputasi yang cepat yang sudah diamankan per penyewa dengan jaringan pribadi. Pengguna Anda mungkin perlu server yang sangat berlebihan untuk memastikan aplikasi lawas mereka terus berjalan. Mungkin tujuannya adalah untuk merancang aplikasi-aplikasi warisan ini sehingga aplikasi-aplikasi tersebut dijalankan pada banyak instance di cloud, secara toleran kesalahan, tetapi tidak menjadikannya suatu tujuan untuk ditambahkan ke kluster-kluster tersebut dari waktu ke waktu. Pengguna Anda mungkin mengindikasikan bahwa mereka perlu pertimbangan penskalaan karena penggunaan server Windows yang berat.

source: You can use availability zones, host aggregates, or both to partition a nova deployment. Both methods are configured and implemented in a similar way.
de: Sie können Verfügbarkeitszonen, Host-Aggregate oder beides verwenden, um eine nova-Bereitstellung zu partitionieren. Beide Methoden werden in ähnlicher Weise konfiguriert und implementiert.
id: Anda dapat menggunakan zona ketersediaan, agregat host, atau keduanya untuk mempartisi penyebaran nova. Kedua metode dikonfigurasikan dan diimplementasikan dengan cara yang serupa.

source: You can use these ratios to determine how much additional infrastructure you need to support your cloud.
de: Anhand dieser Kennzahlen können Sie bestimmen, wie viel zusätzliche Infrastruktur Sie für die Unterstützung Ihrer Cloud benötigen.
id: Anda dapat menggunakan rasio ini untuk menentukan berapa banyak infrastruktur tambahan yang Anda butuhkan untuk mendukung cloud Anda.

source: You could ask, "Do I even need to build a cloud?" If you want to start using a compute or storage service by just swiping your credit card, you can go to eNovance, HP, Rackspace, or other organizations to start using their public OpenStack clouds. Using their OpenStack cloud resources is similar to accessing the publicly available Amazon Web Services Elastic Compute Cloud (EC2) or Simple Storage Solution (S3).
de: Man könnte fragen: "Muss ich überhaupt eine Cloud aufbauen?" Wenn Sie einen Rechen- oder Speicherdienst durch einfaches Durchziehen Ihrer Kreditkarte nutzen möchten, können Sie zu eNovance, HP, Rackspace oder anderen Unternehmen gehen, um mit der Nutzung ihrer öffentlichen OpenStack-Clouds zu beginnen. Die Nutzung ihrer OpenStack-Cloud-Ressourcen ist vergleichbar mit dem Zugriff auf die öffentlich zugänglichen Amazon Web Services Elastic Compute Cloud (EC2) oder Simple Storage Solution (S3).

source: You define the availability zone in which a specified compute host resides locally on each server. An availability zone is commonly used to identify a set of servers that have a common attribute. For instance, if some of the racks in your data center are on a separate power source, you can put servers in those racks in their own availability zone. Availability zones can also help separate different classes of hardware.
de: Sie definieren die Verfügbarkeitszone, in der sich ein bestimmter Rechenhost lokal auf jedem Server befindet. Eine Verfügbarkeitszone wird häufig verwendet, um eine Reihe von Servern zu identifizieren, die ein gemeinsames Attribut haben. Wenn sich beispielsweise einige der Racks in Ihrem Rechenzentrum auf einer separaten Stromquelle befinden, können Sie Server in diesen Racks in einer eigenen Verfügbarkeitszone platzieren. Verfügbarkeitszonen können auch helfen, verschiedene Hardwareklassen zu trennen.
id: Anda menentukan zona ketersediaan tempat host komputasi tertentu berada secara lokal di setiap server. Zona ketersediaan biasanya digunakan untuk mengidentifikasi satu set server yang memiliki atribut umum. Misalnya, jika beberapa rak di pusat data Anda berada di sumber daya yang terpisah, Anda dapat menempatkan server di rak tersebut di zona ketersediaannya sendiri. Zona ketersediaan juga dapat membantu memisahkan berbagai kelas perangkat keras.

source: You may need to explicitly install the ``ipset`` package if your distribution does not install it as a dependency.
de: Möglicherweise müssen Sie das Paket ``ipset`` explizit installieren, wenn Ihre Distribution es nicht als Abhängigkeit installiert.
id: Anda mungkin perlu menginstal paket ``ipset`` secara eksplisit jika distribusi Anda tidak menginstalnya sebagai dependensi.

source: You may notice that all the existing logging messages are preceded by an underscore and surrounded by parentheses, for example:
de: Sie werden feststellen, dass allen vorhandenen Protokollnachrichten ein Unterstrich vorangestellt und z.B. von Klammern umgeben ist:
id: Anda mungkin memperhatikan bahwa semua pesan logging yang ada didahului dengan garis bawah dan dikelilingi oleh tanda kurung, misalnya:

source: You might also see a message such as this:
de: Möglicherweise wird auch eine solche Meldung angezeigt:
id: Anda mungkin juga melihat pesan seperti ini:

source: You must also consider key hardware specifications for the performance of user VMs, as well as budget and performance needs, including storage performance (spindles/core), memory availability (RAM/core), network bandwidth hardware specifications and (Gbps/core), and overall CPU performance (CPU/core).
de: Sie müssen auch die wichtigsten Hardwarespezifikationen für die Leistung von Benutzer-VMs sowie Budget- und Leistungsanforderungen berücksichtigen, einschließlich Speicherleistung (Spindeln/Kern), Speicherverfügbarkeit (RAM/Kern), Netzwerkbandbreiten-Hardware-Spezifikationen und (Gbps/Kern) und Gesamt CPU-Leistung (CPU/Kern).
id: Anda juga harus mempertimbangkan spesifikasi perangkat keras utama untuk kinerja VM pengguna, serta kebutuhan anggaran dan kinerja, termasuk kinerja penyimpanan (spindles/core), ketersediaan memori (RAM/core), spesifikasi perangkat keras bandwidth jaringan dan (Gbps/core), dan kinerja CPU secara keseluruhan (CPU/core).

source: You must complete the following configurations on the server's hard drives:
de: Sie müssen die folgenden Konfigurationen auf den Festplatten des Servers vornehmen:
id: Anda harus menyelesaikan konfigurasi berikut pada hard drive server:
