Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: After finding the instance ID we headed over to ``/var/lib/nova/instances`` to find the ``console.log``:
de: Nachdem wir die Instanz-ID gefunden hatten, gingen wir zu ``/var/lib/nova/instances``, um die ``console.log`` zu finden:
id: Setelah menemukan ID instance kami menuju ke ``/var/lib/nova/instances`` untuk menemukan ``console.log``:

source: After learning about scalability in computing from particle physics experiments, such as ATLAS at the Large Hadron Collider (LHC) at CERN, Tom worked on OpenStack clouds in production to support the Australian public research sector. Tom currently serves as an OpenStack community manager and works on OpenStack documentation in his spare time.
de: Nachdem er von Experimenten der Teilchenphysik, wie z.B. ATLAS am Large Hadron Collider (LHC) am CERN, etwas über die Skalierbarkeit beim Rechnen gelernt hatte, arbeitete Tom an OpenStack-Clouds in der Produktion, um den australischen öffentlichen Forschungssektor zu unterstützen. Tom ist derzeit als OpenStack-Community-Manager tätig und arbeitet in seiner Freizeit an der OpenStack-Dokumentation.

source: After migration, users see different results from :command:`openstack image list` and :command:`glance image-list`. To ensure users see the same images in the list commands, edit the :file:`/etc/glance/policy.json` file and :file:`/etc/nova/policy.json` file to contain ``"context_is_admin": "role:admin"``, which limits access to private images for projects.
de: Nach der Migration sehen die Benutzer unterschiedliche Ergebnisse von :command:`openstack image list` und :command:`glance image-list`. Um sicherzustellen, dass Benutzer die gleichen Abbilder in den Listenbefehlen sehen, bearbeiten Sie die Datei :file:`/etc/glance/policy.json` und die Datei :file:`/etc/nova/policy.json` so, dass sie ``"context_is_admin" enthält: "role:admin"```, die den Zugriff auf private Abbilder für Projekte einschränkt.
id: Setelah migrasi, pengguna melihat hasil yang berbeda dari :command:`openstack image list` dan :command:`glance image-list`. Untuk memastikan pengguna melihat image yang sama dalam perintah daftar, edit file :file:`/etc/glance/policy.json` dan file :file:`/etc/nova/policy.json` yang berisi ``"context_is_admin": "role:admin"``, yang membatasi akses ke image pribadi untuk proyek.

source: After reproducing the problem several times, I came to the unfortunate conclusion that this cloud did indeed have a problem. Even worse, my time was up in Kelowna and I had to return back to Calgary.
de: Nachdem ich das Problem mehrmals reproduziert hatte, kam ich zu dem unglücklichen Schluss, dass diese Cloud tatsächlich ein Problem hatte. Schlimmer noch, meine Zeit war in Kelowna abgelaufen und ich musste zurück nach Calgary.
id: Setelah mereproduksi masalah beberapa kali, saya sampai pada kesimpulan yang tidak menguntungkan bahwa cloud ini memang memiliki masalah. Lebih buruk lagi, waktu saya habis di Kelowna dan saya harus kembali ke Calgary.

source: After restarting the instance, everything was back up and running. We reviewed the logs and saw that at some point, network communication stopped and then everything went idle. We chalked this up to a random occurrence.
de: Nach dem Neustart der Instanz war alles wieder einsatzbereit. Wir überprüften die Protokolle und sahen, dass irgendwann die Netzwerkkommunikation stoppte und dann alles untätig wurde. Wir haben das zu einem zufälligen Ereignis zusammengefasst.
id: Setelah memulai kembali instance, semuanya kembali dan berjalan. Kami meninjau log dan melihat bahwa pada titik tertentu, komunikasi jaringan berhenti dan kemudian semuanya menjadi menganggur. Kami mencatat ini hingga kejadian acak.

source: After running
de: Nach dem Ausführen

source: After that, use the :command:`openstack` command to reboot all instances that were on c01.example.com while regenerating their XML files at the same time:
de: Verwenden Sie anschließend den Befehl :command:`openstack`, um alle Instanzen, die sich auf c01.example.com befanden, neu zu starten und gleichzeitig ihre XML-Dateien zu generieren:
id: Setelah itu, gunakan perintah :command:`openstack` untuk me-reboot semua instance yang ada di c01.example.com saat membuat ulang file XML mereka pada saat yang sama:

source: After the compute node is successfully running, you must deal with the instances that are hosted on that compute node because none of them are running. Depending on your SLA with your users or customers, you might have to start each instance and ensure that they start correctly.
de: Nachdem der Compute-Knoten erfolgreich ausgeführt wurde, müssen Sie sich mit den Instanzen befassen, die auf diesem Compute-Knoten gehostet werden, da keine von ihnen ausgeführt wird. Abhängig von Ihrem SLA mit Ihren Benutzern oder Kunden müssen Sie möglicherweise jede Instanz starten und sicherstellen, dass sie korrekt startet.
id: Setelah simpul komputasi berhasil dijalankan, Anda harus berurusan dengan instance yang dihosting pada simpul komputasi tersebut karena tidak ada satupun yang berjalan. Tergantung pada SLA Anda dengan pengguna atau pelanggan Anda, Anda mungkin harus memulai setiap instance dan memastikan bahwa mereka memulai dengan benar.

source: After the dnsmasq processes start again, check whether DNS is working.
de: Nachdem die dnsmasq-Prozesse erneut gestartet wurden, überprüfen Sie, ob das DNS funktioniert.
id: Setelah proses dnsmasq mulai lagi, periksa apakah DNS berfungsi.

source: After the packet is on this NIC, it transfers to the compute node's default gateway. The packet is now most likely out of your control at this point. The diagram depicts an external gateway. However, in the default configuration with multi-host, the compute host is the gateway.
de: Nachdem sich das Paket auf diesem NIC befindet, wird es an das Standardgateway des Compute-Knotens übertragen. Das Paket befindet sich nun höchstwahrscheinlich außerhalb Ihrer Kontrolle. Das Diagramm stellt ein externes Gateway dar. In der Standardkonfiguration mit Multi-Host ist der Compute Host jedoch das Gateway.
id: Setelah paket berada di NIC ini, ia mentransfer ke gateway default node komputasi. Paket sekarang kemungkinan besar di luar kendali Anda pada saat ini. Diagram menggambarkan gateway eksternal. Namun, dalam konfigurasi default dengan multi-host, host komputasi adalah gateway.

source: After this command it is common practice to call :command:`openstack image create` from your workstation, and once done press enter in your instance shell to unfreeze it. Obviously you could automate this, but at least it will let you properly synchronize.
de: Nach diesem Befehl ist es üblich, den Befehl :command:`openstack image create` von Ihrem Arbeitsplatz aus aufzurufen, und nach Abschluss des Befehls die Eingabetaste in Ihrer Instanz zu drücken, um ihn wieder einzufrieren. Natürlich könnten Sie dies automatisieren, aber zumindest wird es Ihnen ermöglichen, richtig zu synchronisieren.

source: After you consider these factors, you can determine how many cloud controller cores you require. A typical eight core, 8 GB of RAM server is sufficient for up to a rack of compute nodes — given the above caveats.
de: Nachdem Sie diese Faktoren berücksichtigt haben, können Sie bestimmen, wie viele Cloud-Controller-Kerne Sie benötigen. Ein typischer 8-Kern-RAM-Server mit 8 GB reicht für bis zu einem Rack von Compute-Knoten - angesichts der oben genannten Einschränkungen.
id: Setelah Anda mempertimbangkan faktor-faktor ini, Anda dapat menentukan berapa banyak core pengontrol cloud yang Anda butuhkan. Server delapan core, 8 GB RAM biasanya cukup untuk satu rak node komputasi - mengingat peringatan di atas.

source: After you establish that the instance booted properly, the task is to figure out where the failure is.
de: Nachdem Sie festgestellt haben, dass die Instanz richtig gebootet hat, besteht die Aufgabe darin, herauszufinden, wo der Fehler liegt.
id: Setelah Anda memastikan bahwa instance boot dengan benar, tugasnya adalah mencari tahu di mana kegagalannya.

source: After you have the list, you can use the :command:`openstack` command to start each instance:
de: Nachdem Sie die Liste haben, können Sie den Befehl :command:`openstack` verwenden, um jede Instanz zu starten:
id: Setelah Anda memiliki daftar, Anda dapat menggunakan perintah :command:`openstack` untuk memulai setiap instance:

source: Again, it turns out that the image was a snapshot. The three other instances that successfully started were standard cloud images. Was it a problem with snapshots? That didn't make sense.
de: Auch hier stellt sich heraus, dass das Abbild eine Schattenkopie war. Die drei anderen Instanzen, die erfolgreich gestartet wurden, waren Standard-Cloud-Abilder. War es ein Problem mit Schattenkopien? Das ergab keinen Sinn.
id: Sekali lagi, ternyata image itu adalah snapshot. Tiga instance lain yang berhasil dimulai adalah image cloud standar. Apakah itu masalah dengan foto? Itu tidak masuk akal.

source: Again, the right answer depends on your environment. You have to make your decision based on the trade-offs between space utilization, simplicity, and I/O performance.
de: Auch hier hängt die richtige Antwort von Ihrer Umgebung ab. Sie müssen Ihre Entscheidung auf der Grundlage der Kompromisse zwischen Raumnutzung, Einfachheit und I/O-Leistung treffen.
id: Sekali lagi, jawaban yang tepat tergantung pada lingkungan Anda. Anda harus membuat keputusan berdasarkan pertukaran antara pemanfaatan ruang, kesederhanaan, dan kinerja I/O.

source: Ah-hah! So OpenStack was deleting it. But why?
de: Ah-hah! Also löschte OpenStack es. Aber warum?
id: Ah-hah! Jadi OpenStack menghapusnya. Tapi kenapa?

source: All files and directories in ``/var/lib/nova/instances`` are uniquely named. The files in \_base are uniquely titled for the glance image that they are based on, and the directory names ``instance-xxxxxxxx`` are uniquely titled for that particular instance. For example, if you copy all data from ``/var/lib/nova/instances`` on one compute node to another, you do not overwrite any files or cause any damage to images that have the same unique name, because they are essentially the same file.
de: Alle Dateien und Verzeichnisse in ``/var/lib/nova/instances`` sind eindeutig benannt. Die Dateien in \_base sind eindeutig für das glance image benannt, auf dem sie basieren, und die Verzeichnisnamen ``instance-xxxxxxxxxxxx`` sind eindeutig für diese spezielle Instanz benannt. Wenn Sie beispielsweise alle Daten von ``/var/lib/nova/instances`` auf einem Compute-Knoten in einen anderen kopieren, überschreiben Sie keine Dateien und richten keinen Schaden an Abbildern mit demselben eindeutigen Namen an, da es sich im Wesentlichen um die gleiche Datei handelt.
id: Semua file dan direktori di ``/var/lib/nova/instances`` diberi nama unik. File-file di \_base secara unik berjudul untuk glance image yang menjadi dasarnya, dan nama direktori ``instance-xxxxxxxx`` secara unik berjudul untuk instance tertentu. Misalnya, jika Anda menyalin semua data dari ``/var/lib/nova/instances`` pada satu node komputasi ke yang lain, Anda tidak menimpa file apa pun atau menyebabkan kerusakan pada image yang memiliki nama unik yang sama, karena mereka adalah dasarnya file yang sama.

source: All in all, just issue the :command:`reboot` command. The operating system cleanly shuts down services and then automatically reboots. If you want to be very thorough, run your backup jobs just before you reboot.
de: Alles in allem geben Sie einfach den Befehl :command:`reboot` ein. Das Betriebssystem fährt die Dienste sauber herunter und startet dann automatisch neu. Wenn Sie sehr gründlich sein möchten, führen Sie Ihre Backup-Aufträge kurz vor dem Neustart aus.
id: Secara keseluruhan, cukup terbitkan perintah :command:`reboot` . Sistem operasi dengan bersih mematikan layanan dan kemudian secara otomatis reboot. Jika Anda ingin sangat teliti, jalankan pekerjaan cadangan Anda tepat sebelum Anda reboot.

source: All interfaces on the ``br-tun`` are internal to Open vSwitch. To monitor traffic on them, you need to set up a mirror port as described above for ``patch-tun`` in the ``br-int`` bridge.
de: Alle Schnittstellen des ``br-tun`` sind intern zu Open vSwitch. Um den Datenverkehr auf ihnen zu überwachen, müssen Sie einen Mirror-Port einrichten, wie vorstehend für ``patch-tun`` in der ``br-int`` Brücke beschrieben.
id: Semua antarmuka pada ``br-tun`` bersifat internal ke Open vSwitch. Untuk memantau lalu lintas, Anda perlu mengatur port mirror seperti dijelaskan di atas untuk ``patch-tun`` di jembatan ``br-int``.

source: All nodes
de: Alle Knoten

source: All of the alert types mentioned earlier can also be used for trend reporting. Some other trend examples include:
de: Alle zuvor genannten Alarmtypen können auch für das Trendberichtswesen verwendet werden. Einige andere Trendbeispiele sind:
id: Semua jenis peringatan yang disebutkan sebelumnya juga dapat digunakan untuk pelaporan tren. Beberapa contoh tren lainnya termasuk:

source: All of the code for OpenStack lives in ``/opt/stack``. Go to the swift directory in the ``shell`` screen and edit your middleware module.
de: Der gesamte Code für OpenStack lebt in ``/opt/stack``. Gehen Sie in das Swift-Verzeichnis im ``shell`` Bildschirm und bearbeiten Sie Ihr Middleware-Modul.
id: Semua kode untuk OpenStack hidup di ``/opt/stack``. Buka direktori swift di layar ``shell`` dan edit modul middleware Anda.

source: All sites are based on Ubuntu 14.04, with KVM as the hypervisor. The OpenStack version in use is typically the current stable version, with 5 to 10 percent back-ported code from trunk and modifications.
de: Alle Seiten basieren auf Ubuntu 14.04, mit KVM als Hypervisor. Die verwendete OpenStack-Version ist typischerweise die aktuelle stabile Version mit 5 bis 10 Prozent Back-Ported-Code aus dem Trunk und Modifikationen.
id: Semua situs didasarkan pada Ubuntu 14.04, dengan KVM sebagai hypervisor. Versi OpenStack yang digunakan biasanya adalah versi stabil saat ini, dengan 5 hingga 10 persen kode porting belakang dari trunk dan modifikasi.

source: All translation of GRE tunnels to and from internal VLANs happens on this bridge.
de: Alle Übersetzungen von GRE-Tunneln zu und von internen VLANs erfolgen auf dieser Brücke.
id: Semua terjemahan terowongan GRE ke dan dari VLAN internal terjadi di jembatan ini.

source: Allow DHCP client traffic.
de: DHCP-Client-Verkehr zulassen.
id: Izinkan lalu lintas klien DHCP.

source: Allow IPv6 ICMP traffic to allow RA packets.
de: Erlauben Sie IPv6 ICMP-Datenverkehr, um RA-Pakete zuzulassen.
id: Izinkan lalu lintas ICMP IPv6 untuk memungkinkan paket RA.

source: Allow access to the share with IP access type and 10.254.0.4 IP address:
de: Zugriff auf die Freigabe mit IP-Zugriffstyp und 10.254.0.4 IP-Adresse erlauben:

source: Allow traffic from defined IP/MAC pairs.
de: Erlauben Sie Traffic von definierten IP/MAC-Paaren.
id: Izinkan lalu lintas dari pasangan IP/MAC yang ditentukan.

source: Almost all OpenStack components have an underlying database to store persistent information. Usually this database is MySQL. Normal MySQL administration is applicable to these databases. OpenStack does not configure the databases out of the ordinary. Basic administration includes performance tweaking, high availability, backup, recovery, and repairing. For more information, see a standard MySQL administration guide.
de: Fast alle OpenStack-Komponenten haben eine zugrundeliegende Datenbank, um persistente Informationen zu speichern. Normalerweise ist diese Datenbank MySQL. Auf diese Datenbanken ist die normale MySQL-Administration anwendbar. OpenStack konfiguriert die Datenbanken nicht aus dem Rahmen. Die grundlegende Verwaltung umfasst Leistungssteigerung, Hochverfügbarkeit, Backup, Wiederherstellung und Reparatur. Weitere Informationen finden Sie in einem Standard MySQL-Administrationsleitfaden.
id: Hampir semua komponen OpenStack memiliki basis data untuk menyimpan informasi yang persisten. Biasanya database ini adalah MySQL. Administrasi MySQL normal berlaku untuk database ini. OpenStack tidak mengkonfigurasi basis data yang tidak biasa. Administrasi dasar mencakup penyesuaian kinerja, ketersediaan tinggi, cadangan, pemulihan, dan perbaikan. Untuk informasi lebih lanjut, lihat panduan administrasi MySQL standar.

source: Also check that all services are functioning. The following set of commands sources the ``openrc`` file, then runs some basic glance, nova, and openstack commands. If the commands work as expected, you can be confident that those services are in working condition:
de: Überprüfen Sie auch, ob alle Dienste funktionieren. Der folgende Befehlssatz liefert die Datei ``openrc``, führt dann einige grundlegende Glance-, nova- und openstack-Befehle aus. Wenn die Befehle wie erwartet funktionieren, können Sie sicher sein, dass sich diese Dienste in einem funktionierenden Zustand befinden:
id: Periksa juga apakah semua layanan berfungsi. Set perintah berikut sumber file ``openrc``, kemudian menjalankan beberapa perintah dasar glance, nova, dan openstack. Jika perintah berfungsi seperti yang diharapkan, Anda dapat yakin bahwa layanan tersebut dalam kondisi kerja:

source: Also check that it is functioning:
de: Überprüfen Sie auch, ob es funktioniert:
id: Juga periksa apakah berfungsi:

source: Also ensure that it has successfully connected to the AMQP server:
de: Stellen Sie auch sicher, dass er sich erfolgreich mit dem AMQP-Server verbunden hat:
id: Juga memastikan bahwa ia telah berhasil terhubung ke server AMQP:

source: Also, in practice, the ``nova-compute`` services on the compute nodes do not always reconnect cleanly to rabbitmq hosted on the controller when it comes back up after a long reboot; a restart on the nova services on the compute nodes is required.
de: Auch in der Praxis stellen die ``nova-compute`` Dienste auf den Compute-Knoten nicht immer eine saubere Verbindung zu rabbitmq her, das auf dem Controller gehostet wird, wenn es nach einem langen Neustart wieder hochkommt; ein Neustart der nova Dienste auf den Compute-Knoten ist erforderlich.
id: Juga, dalam praktiknya, layanan ``nova-compute`` pada node komputasi tidak selalu terhubung kembali dengan bersih ke rabbitmq yang dihosting pada pengontrol ketika ia kembali setelah boot ulang yang panjang; diperlukan restart layanan nova pada node komputasi.

source: Alter the configuration until it works.
de: Ändern Sie die Konfiguration, bis sie funktioniert.
id: Ubah konfigurasi hingga berfungsi.

source: Alternatively, if you want someone to help guide you through the decisions about the underlying hardware or your applications, perhaps adding in a few features or integrating components along the way, consider contacting one of the system integrators with OpenStack experience, such as Mirantis or Metacloud.
de: Alternativ, wenn Sie möchten, dass jemand Ihnen bei den Entscheidungen über die zugrunde liegende Hardware oder Ihre Anwendungen hilft, vielleicht ein paar Funktionen hinzufügt oder Komponenten integriert, sollten Sie einen der Systemintegratoren mit OpenStack-Erfahrung wie Mirantis oder Metacloud kontaktieren.

source: Alternatively, it is possible to configure VLAN-based networks to use external routers rather than the l3-agent shown here, so long as the external router is on the same VLAN:
de: Alternativ ist es möglich, VLAN-basierte Netzwerke so zu konfigurieren, dass sie anstelle des hier gezeigten l3-Agenten externe Router verwenden, sofern sich der externe Router im selben VLAN befindet:
id: Atau, dimungkinkan untuk mengkonfigurasi jaringan berbasis VLAN untuk menggunakan router eksternal daripada agen l3 yang ditunjukkan di sini, selama router eksternal berada di VLAN yang sama:

source: Although the title of this story is much more dramatic than the actual event, I don't think, or hope, that I'll have the opportunity to use "Valentine's Day Massacre" again in a title.
de: Obwohl der Titel dieser Geschichte viel dramatischer ist als das eigentliche Ereignis, denke oder hoffe ich nicht, dass ich die Gelegenheit haben werde, "Valentinstag-Massaker" wieder in einem Titel zu verwenden.
id: Meskipun judul cerita ini jauh lebih dramatis daripada peristiwa yang sebenarnya, saya tidak berpikir, atau berharap, bahwa saya akan memiliki kesempatan untuk menggunakan "Valentine's Day Massacre" lagi dalam sebuah judul.

source: Although this method is not documented or supported, you can use it when your compute node is permanently offline but you have instances locally stored on it.
de: Obwohl diese Methode nicht dokumentiert oder unterstützt wird, können Sie sie verwenden, wenn Ihr Compute-Knoten permanent offline ist, aber Sie lokal gespeicherte Instanzen haben.
id: Meskipun metode ini tidak didokumentasikan atau didukung, Anda dapat menggunakannya saat node komputasi Anda offline secara permanen tetapi Anda memiliki instance yang disimpan secara lokal di dalamnya.

source: Among the log statements you'll see the lines:
de: Unter den Protokollanweisungen sehen Sie die Zeilen:
id: Di antara pernyataan log Anda akan melihat baris:

source: An OpenStack cloud does not have much value without users. This chapter covers topics that relate to managing users, projects, and quotas. This chapter describes users and projects as described by version 2 of the OpenStack Identity API.
de: Eine OpenStack-Cloud hat ohne Benutzer nicht viel Wert. In diesem Kapitel werden Themen behandelt, die sich auf die Verwaltung von Benutzern, Projekten und Quoten beziehen. In diesem Kapitel werden Benutzer und Projekte beschrieben, wie sie in Version 2 der OpenStack Identity API beschrieben sind.
id: Cloud OpenStack tidak memiliki banyak nilai tanpa pengguna. Bab ini mencakup topik yang berhubungan dengan mengelola pengguna, proyek, dan kuota. Bab ini menjelaskan pengguna dan proyek sebagaimana dijelaskan oleh versi 2 dari OpenStack Identity API.

source: An academic turned software-developer-slash-operator, Lorin worked as the lead architect for Cloud Services at Nimbis Services, where he deploys OpenStack for technical computing applications. He has been working with OpenStack since the Cactus release. Previously, he worked on high-performance computing extensions for OpenStack at University of Southern California's Information Sciences Institute (USC-ISI).
de: Lorin, ein akademischer Softwareentwickler und -betreiber, arbeitete als leitender Architekt für Cloud Services bei Nimbis Services, wo er OpenStack für technische Computeranwendungen einsetzt. Er arbeitet seit der Veröffentlichung von Cactus mit OpenStack zusammen. Zuvor arbeitete er für OpenStack am Information Sciences Institute (USC-ISI) der University of Southern California an High-Performance-Computing-Erweiterungen.

source: An administrative super user, which has full permissions across all projects and should be used with great care
de: Ein administrativer Superuser, der über volle Berechtigungen für alle Projekte verfügt und mit großer Sorgfalt verwendet werden sollte
