Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: At the time of writing, OpenStack has more than 3,000 configuration options. You can see them documented at the `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/config-overview.html>`_. This chapter cannot hope to document all of these, but we do try to introduce the important concepts so that you know where to go digging for more information.
de: Zum Zeitpunkt der Erstellung verfügt OpenStack über mehr als 3.000 Konfigurationsoptionen. Sie können sie in der `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/config-overview.html>`_ dokumentiert sehen. Dieses Kapitel kann nicht hoffen, all dies zu dokumentieren, aber wir versuchen, die wichtigen Konzepte vorzustellen, damit Sie wissen, wo Sie nach weiteren Informationen suchen müssen.
id: Pada saat penulisan, OpenStack memiliki lebih dari 3.000 opsi konfigurasi. Anda dapat melihatnya didokumentasikan di `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/config-overview.html>`_. Bab ini tidak dapat berharap untuk mendokumentasikan semua ini, tetapi kami mencoba memperkenalkan konsep-konsep penting sehingga Anda tahu ke mana harus mencari informasi lebih lanjut.

source: At the very base of any operating system are the hard drives on which the operating system (OS) is installed.
de: An der Basis eines jeden Betriebssystems befinden sich die Festplatten, auf denen das Betriebssystem (OS) installiert ist.
id: Di bagian paling dasar dari setiap sistem operasi adalah hard drive tempat sistem operasi (OS) diinstal.

source: Attaching Block Storage
de: Blockspeicher anbringen

source: Attack vectors increase further in a public facing OpenStack deployment. For example, the API endpoints and the software behind it become vulnerable to hostile entities attempting to gain unauthorized access or prevent access to services. You should provide appropriate filtering and periodic security auditing.
de: Die Angriffsvektoren nehmen in einer öffentlich zugänglichen OpenStack-Bereitstellung weiter zu. So werden beispielsweise die API-Endpunkte und die dahinter stehende Software anfällig für feindliche Unternehmen, die versuchen, sich unbefugten Zugriff zu verschaffen oder den Zugriff auf Dienste zu verhindern. Sie sollten für eine angemessene Filterung und eine regelmäßige Sicherheitsüberprüfung sorgen.
id: Vektor serangan meningkat lebih lanjut di publik yang menghadapi penyebaran OpenStack. Misalnya, endpoint API dan perangkat lunak di belakangnya menjadi rentan terhadap entitas yang bermusuhan yang berusaha mendapatkan akses tidak sah atau mencegah akses ke layanan. Anda harus memberikan penyaringan yang sesuai dan audit keamanan berkala.

source: Attempt to boot a nova instance in the affected environment.
de: Versuch, eine nova-Instanz in der betroffenen Umgebung zu starten.
id: Mencoba mem-boot instance nova di lingkungan yang terpengaruh.

source: Attempt to list the objects in the ``middleware-test`` container:
de: Versuchen Sie, die Objekte im Container ``Middleware-Test`` aufzulisten:
id: Cobalah untuk membuat daftar objek dalam kontainer ``middleware-test``:

source: Automated configuration
de: Automatisierte Konfiguration
id: Konfigurasi otomatis

source: Automated deployment
de: Automatisierte Bereitstellung
id: Penyebaran otomatis

source: Availability zone
de: Verfügbarkeitszone
id: Zona ketersediaan

source: Availability zones
de: Verfügbarkeitszone

source: Availability zones and host aggregates
de: Verfügbarkeitszonen und Hostaggregate
id: Zona ketersediaan dan agregat host

source: Available vCPUs
de: Verfügbare vCPUs

source: Back in your DevStack instance on the shell screen, add some metadata to your container to allow the request from the remote machine:
de: Fügen Sie in Ihrer DevStack-Instanz auf dem Shell-Bildschirm einige Metadaten zu Ihrem Container hinzu, um die Anforderung von der entfernten Maschine zu ermöglichen:
id: Kembali ke instance DevStack Anda pada layar shell, tambahkan beberapa metadata ke kontainer Anda untuk memungkinkan permintaan dari mesin jarak jauh:

source: Back up HOT template ``yaml`` files, and the ``/etc/heat/`` directory containing Orchestration configuration files.
de: Sichern Sie die HOT-Template-Dateien ``yaml`` und das Verzeichnis ``/etc/heat/`` mit den Orchestrierungs-Konfigurationsdateien.
id: Buat cadangan file templat HOT ``yaml``, dan direktori ``/etc/heat/`` yang berisi file konfigurasi Orchestration.

source: Back up the ``/etc/ceilometer`` directory containing Telemetry configuration files.
de: Sichern Sie das Verzeichnis ``/etc/ceilometer`` mit den Konfigurationsdateien der Telemetrie.
id: Cadangkan direktori ``/etc/ceilometer`` yang berisi file konfigurasi Telemetry.

source: Backing storage services
de: Unterstützung von Speicherdiensten
id: Mendukung layanan penyimpanan

source: Backup and Recovery
de: Sicherung und Wiederherstellung
id: Cadangan dan Pemulihan

source: Backup and subsequent recovery is one of the first tasks system administrators learn. However, each system has different items that need attention. By taking care of your database, image service, and appropriate file system locations, you can be assured that you can handle any event requiring recovery.
de: Backup und anschließende Wiederherstellung ist eine der ersten Aufgaben, die Systemadministratoren lernen. Allerdings hat jedes System unterschiedliche Elemente, die Aufmerksamkeit erfordern. Indem Sie sich um Ihre Datenbank, Ihren Bildservice und die entsprechenden Dateisystemstandorte kümmern, können Sie sicher sein, dass Sie mit jedem Ereignis umgehen können, das eine Wiederherstellung erfordert.
id: Pencadangan dan pemulihan selanjutnya adalah salah satu tugas pertama yang dipelajari oleh administrator sistem. Namun, setiap sistem memiliki item berbeda yang perlu diperhatikan. Dengan menjaga basis data, layanan gambar, dan lokasi sistem file yang sesuai, Anda dapat yakin bahwa Anda dapat menangani segala peristiwa yang membutuhkan pemulihan.

source: Baremetal security
de: Baremetal-Sicherheit
id: Keamanan baremetal

source: Be mindful of consistency when utilizing third party clouds to explore authentication options.
de: Achten Sie auf Konsistenz, wenn Sie Clouds von Drittanbietern zur Untersuchung von Authentifizierungsoptionen verwenden.
id: Berhati-hatilah terhadap konsistensi saat menggunakan cloud pihak ketiga untuk menjelajahi opsi otentikasi.

source: Be sure that the instance has successfully booted and is at a login screen before doing the above.
de: Stellen Sie sicher, dass die Instanz erfolgreich gebootet hat und sich auf einem Anmeldebildschirm befindet, bevor Sie die oben genannten Schritte ausführen.
id: Pastikan instance telah berhasil di-boot dan berada di layar login sebelum melakukan hal di atas.

source: Because it is recommended to not use partitions on a swift disk, simply format the disk as a whole:
de: Da es nicht empfohlen ist, Partitionen auf einer Swift DIsk zu benutzen, formatieren SIe sie im Ganzen:
id: Karena disarankan untuk tidak menggunakan partisi pada swift disk, cukup format disk secara keseluruhan:

source: Because network troubleshooting is especially difficult with virtual resources, this chapter is chock-full of helpful tips and tricks for tracing network traffic, finding the root cause of networking failures, and debugging related services, such as DHCP and DNS.
de: Da die Fehlersuche im Netzwerk mit virtuellen Ressourcen besonders schwierig ist, enthält dieses Kapitel eine Fülle hilfreicher Tipps und Tricks, um den Netzwerkverkehr zu verfolgen, die Ursache von Netzwerkausfällen zu finden und verwandte Dienste wie DHCP und DNS zu debuggen.

source: Because of the high redundancy of Object Storage, dealing with object storage node issues is a lot easier than dealing with compute node issues.
de: Aufgrund der hohen Redundanz von Object Storage, ist es einfacher mit Problem bei Object Storage Node umzugehen als bei Compute Node Problemen.
id: Karena redundansi yang tinggi dari Object Storage, berurusan dengan masalah node penyimpanan objek jauh lebih mudah daripada berurusan dengan masalah node komputasi.

source: Because without sensible quotas a single tenant could use up all the available resources, default quotas are shipped with OpenStack. You should pay attention to which quota settings make sense for your hardware capabilities.
de: Da ohne vernünftige Quoten ein einzelner Mandant alle verfügbaren Ressourcen verbrauchen könnte, werden mit OpenStack Standardquoten ausgeliefert. Sie sollten darauf achten, welche Quoteneinstellungen für Ihre Hardwarefähigkeiten sinnvoll sind.
id: Karena tanpa kuota yang masuk akal penyewa tunggal dapat menggunakan semua sumber daya yang tersedia, kuota default dikirimkan dengan OpenStack. Anda harus memperhatikan pengaturan kuota yang masuk akal untuk kemampuan perangkat keras Anda.

source: Because your cloud is most likely composed of many servers, you must check logs on each of those servers to properly piece an event together. A better solution is to send the logs of all servers to a central location so that they can all be accessed from the same area.
de: Da Ihre Cloud höchstwahrscheinlich aus vielen Servern besteht, müssen Sie die Protokolle auf jedem dieser Server überprüfen, um ein Ereignis richtig zusammenzusetzen. Eine bessere Lösung ist es, die Protokolle aller Server an einen zentralen Ort zu senden, so dass auf sie alle aus dem gleichen Bereich zugegriffen werden kann.
id: Karena cloud Anda kemungkinan besar terdiri dari banyak server, Anda harus memeriksa log pada masing-masing server untuk menyatukan acara dengan benar. Solusi yang lebih baik adalah dengan mengirim log dari semua server ke lokasi pusat sehingga semuanya dapat diakses dari area yang sama.

source: Before you start, make sure that Shared File Systems service is installed on your OpenStack cluster and is ready to use.
de: Bevor Sie beginnen, stellen Sie sicher, dass der Dienst Shared File Systems auf Ihrem OpenStack-Cluster installiert und einsatzbereit ist.

source: Below is the same whole procedure described step by step and in more detail.
de: Im Folgenden wird das gleiche ganze Verfahren Schritt für Schritt und im Detail beschrieben.

source: Betsy Hagemeier, a Fanatical Executive Assistant, took care of a room reshuffle and helped us settle in for the week.
de: Betsy Hagemeier, eine fanatische Assistentin der Geschäftsleitung, kümmerte sich um eine Raumumstellung und half uns, uns für die Woche einzuleben.
id: Betsy Hagemeier, Asisten Eksekutif Fanatik, mengurus perombakan kamar dan membantu kami menetap selama seminggu.

source: Block Storage
de: Block Speicher

source: Block Storage Creation Failures
de: Fehler bei der Erstellung von Blockspeichern
id: Kegagalan Pembuatan Block Storage

source: Block Storage Improvements
de: Verbesserungen bei der Blockspeicherung
id: Peningkatan Block Storage

source: Block Storage is considered a stable project, with wide uptake and a long track record of quality drivers. The team has discussed many areas of work at the summits, including better error reporting, automated discovery, and thin provisioning features.
de: Block Storage gilt als ein stabiles Projekt mit einer breiten Akzeptanz und einer langen Erfolgsgeschichte von Qualitätsfaktoren. Das Team hat auf den Summits viele Arbeitsbereiche diskutiert, darunter bessere Fehlerberichte, automatisierte Erkennung und Thin Provisioning-Funktionen.
id: Block Storage dianggap sebagai proyek yang stabil, dengan serapan luas dan rekam jejak yang panjang mengenai driver berkualitas. Tim telah membahas banyak bidang pekerjaan di puncak, termasuk pelaporan kesalahan yang lebih baik, penemuan otomatis, dan fitur thin provisioning.

source: Block Storage nodes
de: Blockspeicher-Knoten

source: Block Storage service
de: Blockspeicherdienst (cinder)
id: Layanan Block Storage

source: Block Storage service - Updating the Block Storage service only requires restarting the service.
de: Blockspeicherdienst - Die Aktualisierung des Blockspeicherdienstes erfordert nur einen Neustart des Dienstes.
id: Layanan Block Storage - Update layanan Block Storage hanya membutuhkan restarting layanan.

source: Boolean value that indicates whether the flavor is available to all users or private. Private flavors do not get the current tenant assigned to them. Defaults to ``True``.
de: Boolescher Wert, der angibt, ob die Variante für alle Benutzer oder privat verfügbar ist. Private Varianten erhalten nicht den aktuellen Mandanten, der ihnen zugeordnet ist. Standardwert ist ``True``.
id: Nilai Boolean yang menunjukkan apakah flavor tersedia untuk semua pengguna atau pribadi. Flavors pribadi tidak membuat penyewa saat ini ditugaskan untuk mereka. Default ke ``True ``.

source: Boot a test server:
de: Starten Sie einen Testserver:
id: Boot server uji:

source: Both Compute and Block Storage rely on schedulers to determine where to place virtual machines or volumes. In Havana, the Compute scheduler underwent significant improvement, while in Icehouse it was the scheduler in Block Storage that received a boost. Further down the track, an effort started this cycle that aims to create a holistic scheduler covering both will come to fruition. Some of the work that was done in Kilo can be found under the `Gantt project <https://wiki.openstack.org/wiki/Gantt/kilo>`_.
de: Sowohl Compute als auch Block Storage verlassen sich auf Scheduler, um festzulegen, wo virtuelle Maschinen oder Volumes platziert werden sollen. In Havanna wurde der Compute Scheduler deutlich verbessert, während in Icehouse der Scheduler im Block Storage einen Schub erhielt. Weiter unten auf der Strecke begann eine Anstrengung diesen Zyklus, der darauf abzielt, einen ganzheitlichen Planer zu schaffen, der beides abdeckt. Einige der Arbeiten, die in Kilo durchgeführt wurden, finden Sie unter dem `Gantt-Projekt <https://wiki.openstack.org/wiki/Gantt/kilo>`_.
id: Compute dan Block Storage keduanya bergantung pada penjadwal untuk menentukan di mana menempatkan mesin atau volume virtual. Di Havana, penjadwal Compute mengalami peningkatan yang signifikan, sedangkan di Icehouse itu penjadwal di Block Storage yang menerima dorongan. Lebih jauh ke bawah jalur, upaya memulai siklus ini yang bertujuan untuk membuat penjadwal holistik yang mencakup keduanya akan membuahkan hasil. Beberapa pekerjaan yang dilakukan di Kilo dapat ditemukan di bawah `Gantt project <https://wiki.openstack.org/wiki/Gantt/kilo>`_.

source: Both Ubuntu and Red Hat Enterprise Linux include mechanisms for configuring the operating system, including preseed and kickstart, that you can use after a network boot. Typically, these are used to bootstrap an automated configuration system. Alternatively, you can use an image-based approach for deploying the operating system, such as systemimager. You can use both approaches with a virtualized infrastructure, such as when you run VMs to separate your control services and physical infrastructure.
de: Sowohl Ubuntu als auch Red Hat Enterprise Linux enthalten Mechanismen zur Konfiguration des Betriebssystems, einschließlich Preseed und Kickstart, die Sie nach einem Netzwerkstart verwenden können. Typischerweise werden diese verwendet, um ein automatisiertes Konfigurationssystem zu starten. Alternativ können Sie auch einen abbildbasierten Ansatz für die Bereitstellung des Betriebssystems verwenden, z.B. den Systemimager. Sie können beide Ansätze mit einer virtualisierten Infrastruktur verwenden, z. B. wenn Sie VMs ausführen, um Ihre Kontrolldienste und die physische Infrastruktur zu trennen.
id: Ubuntu dan Red Hat Enterprise Linux menyertakan mekanisme untuk mengkonfigurasi sistem operasi, termasuk preseed dan kickstart, yang dapat Anda gunakan setelah boot jaringan. Biasanya, ini digunakan untuk mem-bootstrap sistem konfigurasi otomatis. Atau, Anda dapat menggunakan pendekatan berbasis image untuk menggunakan sistem operasi, seperti systemimager. Anda dapat menggunakan kedua pendekatan dengan infrastruktur tervirtualisasi, seperti ketika Anda menjalankan VM untuk memisahkan layanan kontrol dan infrastruktur fisik Anda.

source: Burn-in Testing
de: Burn-In-Tests

source: But how can you tell whether images are being successfully uploaded to the Image service? Maybe the disk that Image service is storing the images on is full or the S3 back end is down. You could naturally check this by doing a quick image upload:
de: Aber woher wissen Sie, ob Abbilder erfolgreich in den Abbilddienst hochgeladen werden? Vielleicht ist die Festplatte, auf der der Abbilddienst die Abbilder speichert, voll oder das S3-Backend ist ausgefallen. Sie können dies natürlich durch einen schnellen Abbildupload überprüfen:
id: Tetapi bagaimana Anda bisa tahu apakah image berhasil diunggah ke layanan Image? Mungkin disk tempat layanan Image menyimpan image pada penuh atau S3 back end turun. Anda secara alami dapat memeriksanya dengan melakukan unggahan image cepat:

source: By comparing a tenant's hard limit with their current resource usage, you can see their usage percentage. For example, if this tenant is using 1 floating IP out of 10, then they are using 10 percent of their floating IP quota. Rather than doing the calculation manually, you can use SQL or the scripting language of your choice and create a formatted report:
de: Wenn Sie das harte Limit eines Mandanten mit seinem aktuellen Ressourcenverbrauch vergleichen, können Sie seinen prozentualen Verbrauch erkennen. Wenn dieser Mandant zum Beispiel 1 von 10 Floating IP verwendet, dann nutzt er 10 Prozent seiner Floating IP-Quoten. Anstatt die Berechnung manuell durchzuführen, können Sie SQL oder die Skriptsprache Ihrer Wahl verwenden und einen formatierten Bericht erstellen:
id: Dengan membandingkan batas keras penyewa dengan penggunaan sumber daya mereka saat ini, Anda dapat melihat persentase penggunaannya. Misalnya, jika penyewa ini menggunakan 1 IP mengambang dari 10, maka mereka menggunakan 10 persen kuota IP mengambang mereka. Daripada melakukan perhitungan secara manual, Anda dapat menggunakan SQL atau bahasa scripting pilihan Anda dan membuat laporan yang diformat:

source: By default, Object Storage logs to syslog.
de: Standardmäßig protokolliert die Objektspeicherung in syslog.
id: Secara default, Object Storage mencatat log ke syslog.

source: By default, there are no share types defined in Shared File Systems service, so you can check if a required one has been already created:
de: Standardmäßig sind im Dienst Shared File Systems keine Freigabearten definiert, so dass Sie überprüfen können, ob ein erforderlicher bereits erstellt wurde:

source: By mistake, I configured OpenStack to attach all tenant VLANs to vlan20 instead of bond0 thereby stacking one VLAN on top of another. This added an extra 4 bytes to each packet and caused a packet of 1504 bytes to be sent out which would cause problems when it arrived at an interface that only accepted 1500.
de: Versehentlich habe ich OpenStack konfiguriert, um alle Mandanten-VLANs an vlan20 statt an bond0 anzuschließen und so ein VLAN übereinander zu stapeln. Dadurch wurden jedem Paket zusätzliche 4 Bytes hinzugefügt und ein Paket von 1504 Bytes gesendet, was Probleme verursachen würde, wenn es an einer Schnittstelle ankam, die nur 1500 akzeptiert.
id: Secara tidak sengaja, saya mengkonfigurasi OpenStack untuk melampirkan semua tenant VLAN ke vlan20 dan bukannya bond0 sehingga menumpuk satu VLAN di atas yang lain. Ini menambahkan 4 byte tambahan untuk setiap paket dan menyebabkan paket 1504 byte dikirim yang akan menyebabkan masalah ketika tiba di antarmuka yang hanya menerima 1500.

source: By modifying your configuration setup, you can set up IPv6 when using ``nova-network`` for networking, and a tested setup is documented for FlatDHCP and a multi-host configuration. The key is to make ``nova-network`` think a ``radvd`` command ran successfully. The entire configuration is detailed in a Cybera blog post, `“An IPv6 enabled cloud” <http://www.cybera.ca/news-and-events/tech-radar/an-ipv6-enabled-cloud/>`_.
de: Durch die Änderung Ihrer Konfigurationseinstellungen können Sie IPv6 einrichten, wenn Sie ``nova-network`` für das Netzwerk verwenden, und ein getestetes Setup ist für FlatDHCP und eine Multi-Host-Konfiguration dokumentiert. Der Schlüssel ist, dass ``nova-network`` denken lässt, dass ein ``radvd`` Befehl erfolgreich ausgeführt wurde. Die gesamte Konfiguration ist in einem Cybera-Blogbeitrag beschrieben, `"An IPv6 enabled cloud" <http://www.cybera.ca/news-and-events/tech-radar/an-ipv6-enabled-cloud/>`_.
id: Dengan memodifikasi pengaturan konfigurasi Anda, Anda dapat mengatur IPv6 saat menggunakan ``nova-network`` untuk jaringan, dan pengaturan yang diuji didokumentasikan untuk FlatDHCP dan konfigurasi multi-host. Kuncinya adalah membuat ``nova-network`` berpikir perintah ``radvd`` berhasil dijalankan. Seluruh konfigurasi dirinci dalam posting blog Cybera, `“An IPv6 enabled cloud” <http://www.cybera.ca/news-and-events/tech-radar/an-ipv6-enabled-cloud/>`_.

source: By running this command periodically and keeping a record of the result, you can create a trending report over time that shows whether your ``nova-api`` usage is increasing, decreasing, or keeping steady.
de: Indem Sie diesen Befehl regelmäßig ausführen und das Ergebnis protokollieren, können Sie einen Trendbericht erstellen, der zeigt, ob Ihre ``nova-api`` Nutzung zunimmt, abnimmt oder konstant bleibt.
id: Dengan menjalankan perintah ini secara berkala dan menyimpan catatan hasilnya, Anda dapat membuat laporan trending dari waktu ke waktu yang menunjukkan apakah penggunaan ``nova-api`` Anda meningkat, menurun, atau tetap stabil.

source: By taking this script and rolling it into an alert for your monitoring system (such as Nagios), you now have an automated way of ensuring that image uploads to the Image Catalog are working.
de: Indem Sie dieses Skript in eine Warnung für Ihr Überwachungssystem (z.B. Nagios) verwandeln, haben Sie nun eine automatisierte Möglichkeit, sicherzustellen, dass Abbilduploads in den Image Catalog funktionieren.
id: Dengan mengambil skrip ini dan mengubahnya menjadi peringatan untuk sistem pemantauan Anda (seperti Nagios), Anda sekarang memiliki cara otomatis untuk memastikan bahwa unggahan image ke Image Catalog berfungsi.

source: CONF.node_availability_zone has been renamed to CONF.default_availability_zone and is used only by the ``nova-api`` and ``nova-scheduler`` services.
de: Die CONF.node_availability_zone wurde in CONF.default_availability_zone umbenannt und wird nur von den Diensten ``nova-api`` und ``nova-scheduler`` verwendet.
id: CONF.node_available_zone telah diubah namanya menjadi CONF.default_available_zone dan hanya digunakan oleh layanan ``nova-api`` dan ``nova-scheduler``.

source: CONF.node_availability_zone still works but is deprecated.
de: CONF.node_availability_zone funktioniert noch, ist aber veraltet.
id: CONF.node_avilities_zone masih berfungsi tetapi sudah usang.

source: Can instances launch and be destroyed?
de: Können Instanzen gestartet und zerstört werden?
id: Bisakah instance diluncurkan dan dihancurkan?

source: Can objects be stored and deleted?
de: Können Objekte gespeichert und gelöscht werden?
id: Bisakah benda disimpan dan dihapus?

source: Can users be created?
de: Können Benutzer angelegt werden?
id: Bisakah pengguna dibuat?

source: Can volumes be created and destroyed?
de: Können Datenträger erstellt und vernichtet werden?
id: Bisakah volume dibuat dan dimusnahkan?

source: Capacity Planning
de: Kapazitätsplanung
id: Perencanaan Kapasitas

source: Capacity planning and scaling
de: Kapazitätsplanung und -skalierung
id: Perencanaan dan penskalaan kapasitas

source: Cells
de: Zellen

source: Cells and regions
de: Zellen und Regionen
id: Sel dan daerah
