Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: Imagine a scenario where you have public access to one of your containers, but what you really want is to restrict access to that to a set of IPs based on a whitelist. In this example, we'll create a piece of middleware for swift that allows access to a container from only a set of IP addresses, as determined by the container's metadata items. Only those IP addresses that you explicitly whitelist using the container's metadata will be able to access the container.
de: Stellen Sie sich ein Szenario vor, in dem Sie öffentlichen Zugriff auf einen Ihrer Container haben, aber was Sie wirklich wollen, ist, den Zugriff darauf auf eine Reihe von IPs basierend auf einer Whitelist zu beschränken. In diesem Beispiel erstellen wir eine Middleware für Swift, die den Zugriff auf einen Container nur von einer Reihe von IP-Adressen aus ermöglicht, wie sie durch die Metadatenelemente des Containers bestimmt werden. Nur die IP-Adressen, die Sie explizit mit den Metadaten des Containers auf die Whitelist setzen, können auf den Container zugreifen.
id: Bayangkan sebuah skenario di mana Anda memiliki akses publik ke salah satu kontainer Anda, tetapi yang Anda inginkan adalah membatasi akses ke satu set IP berdasarkan daftar putih. Dalam contoh ini, kami akan membuat sepotong middleware untuk swift yang memungkinkan akses ke sebuah kontainer dari hanya satu set alamat IP, seperti yang ditentukan oleh item metadata dari kontainer. Hanya alamat IP yang Anda daftar putih secara eksplisit menggunakan metadata kontainer yang akan dapat mengakses kontainer.

source: Immediately after create, the security group has only an allow egress rule. To make it do what we want, we need to add some rules:
de: Unmittelbar nach dem Erstellen hat die Sicherheitsgruppe nur eine Zulassungsaustrittsregel. Damit es das tut, was wir wollen, müssen wir einige Regeln hinzufügen:
id: Segera setelah dibuat, grup keamanan hanya memiliki aturan egress yang diizinkan. Untuk membuatnya melakukan apa yang kita inginkan, kita perlu menambahkan beberapa aturan:

source: Implementing Periodic Tasks
de: Implementierung periodischer Aufgaben
id: Menerapkan Tugas Berkala

source: In OpenStack user interfaces and documentation, a group of users is referred to as a :term:`project` or :term:`tenant`. These terms are interchangeable.
de: In OpenStack-Benutzeroberflächen und -Dokumentation wird eine Gruppe von Benutzern als :term:`project` oder :term:`tenant` bezeichnet. Diese Begriffe sind austauschbar.
id: Dalam antarmuka pengguna dan dokumentasi OpenStack, sekelompok pengguna disebut sebagai :term:`project` atau :term:`tenant`. Ketentuan-ketentuan ini dapat dipertukarkan.

source: In ``nova.conf``, ``vlan_interface`` specifies what interface OpenStack should attach all VLANs to. The correct setting should have been:
de: In ``nova.conf``, ``vlan_interface`` gibt an, an welche Schnittstelle OpenStack alle VLANs anschließen soll. Die richtige Einstellung hätte sein müssen:
id: Dalam ``nova.conf``, ``vlan_interface`` menentukan antarmuka apa yang harus diikat (attach) OpenStack dengan semua VLAN. Pengaturan yang benar seharusnya:

source: In a multi-tenant cloud environment, users sometimes want to share their personal images or snapshots with other projects. This can be done on the command line with the ``glance`` tool by the owner of the image.
de: In einer mandantenfähigen Cloud-Umgebung möchten Benutzer manchmal ihre persönlichen Abbilder oder Schattenkopien mit anderen Projekten teilen. Dies kann auf der Kommandozeile mit dem Tool ``glance`` vom Besitzer des Abbildes erfolgen.
id: Dalam lingkungan cloud multi-tenant, pengguna terkadang ingin berbagi image pribadi atau snapshot dengan proyek lain. Ini dapat dilakukan pada command line dengan alat ``glance`` oleh pemilik image.

source: In addition, consider remote power control as well. While IPMI usually controls the server's power state, having remote access to the PDU that the server is plugged into can really be useful for situations when everything seems wedged.
de: Darüber hinaus sollten Sie auch die Fernsteuerung in Betracht ziehen. Während IPMI normalerweise den Stromversorgungszustand des Servers steuert, kann der Fernzugriff auf die PDU, an die der Server angeschlossen ist, wirklich nützlich sein, wenn alles verkeilt erscheint.
id: Selain itu, pertimbangkan juga kendali daya jarak jauh. Sementara IPMI biasanya mengontrol status daya server, memiliki akses jarak jauh ke PDU yang tersambung ke server benar-benar dapat berguna untuk situasi ketika semuanya tampak terjepit (wedged).

source: In addition, database migrations are now tested with the Turbo Hipster tool. This tool tests database migration performance on copies of real-world user databases.
de: Darüber hinaus werden nun Datenbankmigrationen mit dem Turbo Hipster Tool getestet. Dieses Tool testet die Leistung der Datenbankmigration auf Kopien von realen Benutzerdatenbanken.
id: Selain itu, migrasi basis data sekarang diuji dengan alat Turbo Hipster. Alat ini menguji kinerja migrasi basis data pada salinan basis data pengguna dunia nyata.

source: In addition, many sites write custom tools for local needs to enforce local policies and provide levels of self-service to users that are not currently available with packaged tools.
de: Darüber hinaus schreiben viele Websites benutzerdefinierte Tools für lokale Anforderungen, um lokale Richtlinien durchzusetzen und Benutzern, die derzeit nicht mit verpackten Tools verfügbar sind, ein Niveau an Selbstbedienung zu bieten.

source: In an OpenStack cloud, the dnsmasq process acts as the DNS server for the instances in addition to acting as the DHCP server. A misbehaving dnsmasq process may be the source of DNS-related issues inside the instance. As mentioned in the previous section, the simplest way to rule out a misbehaving dnsmasq process is to kill all the dnsmasq processes on the machine and restart ``nova-network``. However, be aware that this command affects everyone running instances on this node, including tenants that have not seen the issue. As a last resort, as root:
de: In einer OpenStack-Cloud fungiert der dnsmasq-Prozess neben dem DHCP-Server auch als DNS-Server für die Instanzen. Ein fehlerhafter dnsmasq-Prozess kann die Ursache für DNS-Probleme innerhalb der Instanz sein. Wie im vorherigen Abschnitt erwähnt, ist der einfachste Weg, einen fehlerhaften dnsmasq-Prozess auszuschließen, alle dnsmasq-Prozesse auf der Maschine zu beenden und ``Nova-Netzwerk`` neu zu starten. Beachten Sie jedoch, dass dieser Befehl alle Instanzen auf diesem Knoten betrifft, einschließlich Mandanten, die das Problem nicht gesehen haben. Als letztes Mittel, als root:
id: Dalam cloud OpenStack, proses dnsmasq bertindak sebagai server DNS untuk instance selain bertindak sebagai server DHCP. Proses dnsmasq yang keliru mungkin menjadi sumber masalah terkait DNS di dalam instance. Seperti disebutkan di bagian sebelumnya, cara paling sederhana untuk mengesampingkan proses dnsmasq yang rusak adalah dengan mematikan semua proses dnsmasq pada mesin dan memulai kembali ``nova-network``. Namun, perlu diketahui bahwa perintah ini mempengaruhi semua orang yang menjalankan instance pada node ini, termasuk penyewa yang belum melihat masalah. Sebagai upaya terakhir, sebagai root:

source: In an elastic cloud environment using the ``Public_AGILE`` network, each instance has a publicly accessible IPv4 & IPv6 address. It does not support the concept of OpenStack floating IP addresses that can easily be attached, removed, and transferred between instances. However, there is a workaround using neutron ports which contain the IPv4 & IPv6 address.
de: In einer elastischen Cloud-Umgebung mit dem Netzwerk "Public_AGILE" verfügt jede Instanz über eine öffentlich zugängliche IPv4 & IPv6-Adresse. Es unterstützt nicht das Konzept der OpenStack Floating IP-Adressen, die leicht angehängt, entfernt und zwischen Instanzen übertragen werden können. Es gibt jedoch einen Workaround mit Neutronen-Ports, die die IPv4 & IPv6-Adresse enthalten.
id: Dalam lingkungan cloud yang elastis menggunakan jaringan ``Public_AGILE``, setiap instance memiliki alamat IPv4 & IPv6 yang dapat diakses publik. Itu tidak mendukung konsep alamat IP mengambang OpenStack yang dapat dengan mudah dilampirkan, dihapus, dan ditransfer antar instance. Namun, ada solusi menggunakan port neutron yang berisi alamat IPv4 & IPv6.

source: In most cases, the error is the result of something in libvirt's XML file (``/etc/libvirt/qemu/instance-xxxxxxxx.xml``) that no longer exists. You can enforce re-creation of the XML file as well as rebooting the instance by running the following command:
de: In den meisten Fällen ist der Fehler das Ergebnis von etwas in der XML-Datei von libvirt (``/etc/libvirt/qemu/instance-xxxxxxxxxxxx.xml``), das nicht mehr existiert. Sie können die Neuerstellung der XML-Datei sowie den Neustart der Instanz erzwingen, indem Sie den folgenden Befehl ausführen:
id: Dalam kebanyakan kasus, kesalahan adalah hasil dari sesuatu dalam file XML libvirt (``/etc/libvirt/qemu/instance-xxxxxxxx.xml``) yang tidak lagi ada. Anda dapat memberlakukan kembali penciptaan file XML serta me-reboot instance dengan menjalankan perintah berikut:

source: In our experience, most operators don't sit right next to the servers running the cloud, and many don't necessarily enjoy visiting the data center. OpenStack should be entirely remotely configurable, but sometimes not everything goes according to plan.
de: Nach unserer Erfahrung sitzen die meisten Betreiber nicht direkt neben den Servern, auf denen die Cloud läuft, und viele besuchen nicht unbedingt gerne das Rechenzentrum. OpenStack sollte vollständig fernkonfigurierbar sein, aber manchmal läuft nicht alles nach Plan.
id: Dalam pengalaman kami, sebagian besar operator tidak duduk tepat di sebelah server yang menjalankan cloud, dan banyak yang tidak selalu menikmati mengunjungi pusat data. OpenStack harus sepenuhnya dapat dikonfigurasi dari jarak jauh, tetapi terkadang tidak semuanya berjalan sesuai rencana.

source: In releases prior to Mitaka, select the equivalent :guilabel:`Terminate instance` action.
de: In Releases vor Mitaka wählen Sie die entsprechende Aktion :guilabel:`Terminate instance`.

source: In some cases, some operations should be restricted to administrators only. Therefore, as a further example, let us consider how this sample policy file could be modified in a scenario where we enable users to create their own flavors:
de: In einigen Fällen sollten einige Vorgänge auf Administratoren beschränkt sein. Daher sollten wir als weiteres Beispiel betrachten, wie diese Beispieldatei für Richtlinien in einem Szenario geändert werden könnte, in dem wir es den Benutzern ermöglichen, ihre eigenen Varianten zu erstellen:

source: In some scenarios, instances are running but are inaccessible through SSH and do not respond to any command. The VNC console could be displaying a boot failure or kernel panic error messages. This could be an indication of file system corruption on the VM itself. If you need to recover files or inspect the content of the instance, qemu-nbd can be used to mount the disk.
de: In einigen Szenarien laufen Instanzen, sind aber über SSH nicht erreichbar und reagieren nicht auf Befehle. Die VNC-Konsole könnte einen Boot-Fehler oder Fehlermeldungen von Kernel-Panik anzeigen. Dies könnte ein Hinweis auf eine Beschädigung des Dateisystems auf der VM selbst sein. Wenn Sie Dateien wiederherstellen oder den Inhalt der Instanz überprüfen müssen, kann qemu-nbd verwendet werden, um die Festplatte zu mounten.
id: Dalam beberapa skenario, instance berjalan tetapi tidak dapat diakses melalui SSH dan tidak menanggapi perintah apa pun. Konsol VNC dapat menampilkan pesan kegagalan boot atau kesalahan panik kernel. Ini bisa menjadi indikasi kerusakan sistem file pada VM itu sendiri. Jika Anda perlu memulihkan file atau memeriksa konten instance, qemu-nbd dapat digunakan untuk me-mount disk.

source: In the very common case where the underlying snapshot is done via LVM, the filesystem freeze is automatically handled by LVM.
de: In dem sehr häufigen Fall, dass der zugrundeliegende Schattenkopie über LVM gemacht wird, wird das Einfrieren des Dateisystems automatisch von LVM behandelt.

source: In this case, ``gre-1`` is a tunnel from IP 10.10.128.21, which should match a local interface on this node, to IP 10.10.128.16 on the remote side.
de: In diesem Fall ist ``gre-1`` ein Tunnel von IP 10.10.128.21, der einer lokalen Schnittstelle auf diesem Knoten entsprechen sollte, bis IP 10.10.128.16 auf der entfernten Seite.
id: Dalam hal ini, ``gre-1`` adalah terowongan dari IP 10.10.128.21, yang harus cocok dengan antarmuka lokal pada node ini, ke IP 10.10.128.16 di sisi jarak jauh (remote side).

source: In this case, looking at the ``fault`` message shows ``NoValidHost``, indicating that the scheduler was unable to match the instance requirements.
de: In diesem Fall zeigt die Meldung ``Fehler`` die Meldung ``NoValidHost`` an, die anzeigt, dass der Scheduler nicht in der Lage war, die Instanzanforderungen zu erfüllen.

source: In this error, a nova service has failed to connect to the RabbitMQ server because it got a connection refused error.
de: In diesem Fehler konnte sich ein nova-Dienst nicht mit dem RabbitMQ-Server verbinden, weil er einen Fehler erhalten hat, der die Verbindung verweigert hat.
id: Dalam kesalahan ini, layanan nova telah gagal terhubung ke server RabbitMQ karena mendapat koneksi menolak kesalahan.

source: In this example, ``cinder-volumes`` failed to start and has provided a stack trace, since its volume back end has been unable to set up the storage volume—probably because the LVM volume that is expected from the configuration does not exist.
de: In diesem Beispiel konnte ``cinder-volumes`` nicht gestartet werden und hat eine Stapelverfolgung bereitgestellt, da sein Volume Backend das Speichervolumen nicht einrichten konnte - wahrscheinlich, weil das LVM-Volume, das von der Konfiguration erwartet wird, nicht existiert.
id: Dalam contoh ini, ``cinder-volume`` gagal untuk memulai dan telah menyediakan jejak stack (stack trace), karena volume back end-nya tidak dapat mengatur volume penyimpanan— mungkin karena volume LVM yang diharapkan dari konfigurasi tidak ada .

source: In this example, these locations have the following IP addresses:
de: In diesem Beispiel haben diese Standorte die folgenden IP-Adressen:
id: Dalam contoh ini, lokasi ini memiliki alamat IP berikut:

source: In this guide, we assume that you have successfully deployed an OpenStack cloud and are able to perform basic operations such as adding images, booting instances, and attaching volumes.
de: In diesem Leitfaden gehen wir davon aus, dass Sie eine OpenStack-Cloud erfolgreich bereitgestellt haben und grundlegende Funktionen wie das Hinzufügen von Abbildern, das Booten von Instanzen und das Anhängen von Datenträgern ausführen können.
id: Dalam panduan ini, kami mengasumsikan bahwa Anda telah berhasil menggunakan cloud OpenStack dan dapat melakukan operasi dasar seperti menambahkan image, mem-boot instance, dan mengkaitkan volume.

source: In this instance, having an out-of-band access into nodes running OpenStack components is a boon. The IPMI protocol is the de facto standard here, and acquiring hardware that supports it is highly recommended to achieve that lights-out data center aim.
de: In diesem Fall ist es ein Segen, einen Out-of-Band-Zugriff auf Knoten mit OpenStack-Komponenten zu haben. Das IPMI-Protokoll ist hier der De-facto-Standard, und die Anschaffung von Hardware, die es unterstützt, wird dringend empfohlen, um das Ziel eines ausgeleuchteten Rechenzentrums zu erreichen.
id: Dalam instance ini, memiliki akses out-of-band ke node yang menjalankan komponen OpenStack adalah suatu anugerah. Protokol IPMI adalah standar de facto di sini, dan memperoleh perangkat keras yang mendukungnya sangat disarankan untuk mencapai tujuan pusat data yang padam (lights-out).

source: In this section, we examine the process of creating a simple share. It consists of several steps:
de: In diesem Abschnitt untersuchen wir den Prozess der Erstellung einer einfachen Freigabe. Sie besteht aus mehreren Schritten:

source: Industry standards policy governing additional requirements on what type of cardholder data may or may not be stored and how it is to be protected.
de: Richtlinie über Industrienormen, die zusätzliche Anforderungen festlegt, welche Art von Karteninhaberdaten gespeichert werden dürfen oder nicht und wie sie zu schützen sind.
id: Kebijakan standar industri yang mengatur persyaratan tambahan tentang jenis data pemegang kartu yang dapat disimpan atau tidak dan bagaimana data itu harus dilindungi.

source: Influencing the Roadmap
de: Beeinflussung der Roadmap
id: Mempengaruhi Roadmap

source: Information Available to You
de: Informationen, die Ihnen zur Verfügung stehen
id: Informasi Tersedia untuk Anda

source: Injected file content bytes
de: Bytes des injizierten Dateiinhalts
id: Byte konten file yang disuntikkan

source: Injected file path bytes
de: Eingespeiste Dateipfad-Bytes
id: Byte jalur file yang disuntikkan

source: Injected files
de: Eingespeiste Dateien
id: File yang disuntikkan

source: Inside the book sprint room with us each day was our book sprint facilitator Adam Hyde. Without his tireless support and encouragement, we would have thought a book of this scope was impossible in five days. Adam has proven the book sprint method effectively again and again. He creates both tools and faith in collaborative authoring at `www.booksprints.net <https://www.booksprints.net/>`_.
de: Im Buchsprintraum befand sich jeden Tag mit uns unser Buchsprintmoderator Adam Hyde. Ohne seine unermüdliche Unterstützung und Ermutigung hätten wir gedacht, dass ein Buch dieses Umfangs in fünf Tagen unmöglich wäre. Adam hat die Buchsprintmethode immer wieder effektiv bewiesen. Er schafft sowohl Werkzeuge als auch den Glauben an kollaboratives Authoring unter `www.booksprints.net <https://www.booksprints.net/>`_.
id: Di dalam ruang sprint buku bersama kami setiap hari adalah fasilitator sprint buku kami, Adam Hyde. Tanpa dukungan dan dorongannya yang tak kenal lelah, kami akan mengira sebuah buku tentang lingkup ini tidak mungkin dalam lima hari. Adam telah membuktikan metode sprint buku secara efektif berulang kali. Ia menciptakan alat dan keyakinan dalam penulisan kolaboratif pada `www.booksprints.net <https://www.booksprints.net/>`_.

source: Inspecting API Calls
de: API-Aufrufe prüfen
id: Memeriksa Panggilan API

source: Inspecting and Recovering Data from Failed Instances
de: Überprüfen und Wiederherstellen von Daten aus fehlerhaften Instanzen
id: Memeriksa dan Memulihkan Data dari Instance Gagal

source: Install OpenStack command-line clients
de: OpenStack Befehlszeilen-Clients installieren
id: Instal klien command-line OpenStack

source: Install the ``keystone`` and ``swift`` clients on your local machine:
de: Installieren Sie die Clients ``keystone`` und ``swift`` auf Ihrem lokalen Rechner:
id: Instal klien ``keystone`` dan ``swift`` di mesin lokal Anda:

source: Installation Tutorials and Guides
de: Installations-Tutorien und Anleitungen

source: Instance "ignores" the response and re-sends the renewal request.
de: Die Instanz "ignoriert" die Antwort und sendet die Verlängerungsanforderung erneut.
id: Instance "ignores" respons dan mengirim kembali permintaan pembaruan.

source: Instance Boot Failures
de: Instanz Boot-Fehler

source: Instance begins sending a renewal request to ``255.255.255.255`` since it hasn't heard back from the cloud controller.
de: Instance beginnt, eine Verlängerungsanfrage an ``255.255.255.255`` zu senden, da sie keine Rückmeldung vom Cloud-Controller erhalten hat.
id: Mesin virtual mulai mengirim permintaan pembaruan ke `` 255.255.255.255`` karena belum mendapat balasan dari pengendali cloud.

source: Instance metadata
de: Instanz-Metadaten

source: Instance tries to renew IP.
de: Die Instanz versucht, die IP zu erneuern.
id: Instance mencoba memperbarui IP.

source: Instance user data
de: Instanz Benutzerdaten

source: Instances
de: Instanz
id: Instance

source: Instances are the running virtual machines within an OpenStack cloud. This section deals with how to work with them and their underlying images, their network properties, and how they are represented in the database.
de: Instanzen sind die laufenden virtuellen Maschinen innerhalb einer OpenStack-Cloud. In diesem Abschnitt erfahren Sie, wie Sie mit ihnen und den zugrunde liegenden Abbildern, ihren Netzwerkeigenschaften und ihrer Darstellung in der Datenbank arbeiten.

source: Instances in the Database
de: Instanzen in der Datenbank

source: Intelligent Alerting
de: Intelligente Alarmierung
id: Peringatan Intelligent

source: Intelligent alerting can be thought of as a form of continuous integration for operations. For example, you can easily check to see whether the Image service is up and running by ensuring that the ``glance-api`` and ``glance-registry`` processes are running or by seeing whether ``glance-api`` is responding on port 9292.
de: Intelligente Alarmierung kann als eine Form der kontinuierlichen Integration für den Betrieb betrachtet werden. Sie können beispielsweise leicht überprüfen, ob der Abbilddienst betriebsbereit ist, indem Sie sicherstellen, dass die Prozesse ``glance-api`` und ``glance-registry`` laufen, oder indem Sie sehen, ob ``glance-api`` auf Port 9292 reagiert.
id: Peringatan intelligent dapat dianggap sebagai bentuk integrasi berkelanjutan untuk operasi. Misalnya, Anda dapat dengan mudah memeriksa untuk melihat apakah layanan Image sudah berjalan dan berjalan dengan memastikan bahwa proses ``glance-api`` dan ``glance-registry`` sedang berjalan atau dengan melihat apakah ``glance-api`` merespons pada port 9292.

source: Intelligent alerting takes considerably more time to plan and implement than the other alerts described in this chapter. A good outline to implement intelligent alerting is:
de: Die intelligente Alarmierung benötigt wesentlich mehr Zeit für die Planung und Umsetzung als die anderen in diesem Kapitel beschriebenen Alarme. Ein guter Überblick zur Implementierung von intelligenter Alarmierung ist:
id: Peringatan intelligent membutuhkan jauh lebih banyak waktu untuk merencanakan dan mengimplementasikan daripada peringatan lain yang dijelaskan dalam bab ini. Outline yang baik untuk menerapkan peringatan Intelligent adalah:

source: Intended to detect and react appropriately to any incidents that occur. System and network security monitoring, including intrusion detection and prevention arrangements, are typically employed to detect attacks on cloud systems and the supporting communications infrastructure.
de: Sie ist dazu bestimmt, auftretende Vorfälle zu erkennen und angemessen darauf zu reagieren. Die Überwachung der System- und Netzwerksicherheit, einschließlich Intrusion Detection und Prevention, wird typischerweise eingesetzt, um Angriffe auf Cloud-Systeme und die unterstützende Kommunikationsinfrastruktur zu erkennen.
id: Dimaksudkan untuk mendeteksi dan bereaksi secara tepat terhadap setiap insiden yang terjadi. Pemantauan keamanan sistem dan jaringan, termasuk deteksi intrusi dan pengaturan pencegahan, biasanya digunakan untuk mendeteksi serangan pada sistem cloud dan infrastruktur komunikasi pendukung.

source: Interacting with share networks.
de: Interaktion mit Freigabe-Netzwerken.

source: Internal network connectivity
de: Interne Netzwerkkonnektivität
id: Konektivitas jaringan internal

source: Introduction to OpenStack
de: Einführung in OpenStack
