Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: While it is important for an operator to be familiar with the steps involved in deploying OpenStack, we also strongly encourage you to evaluate `OpenStack deployment tools <https://docs.openstack.org/rocky/deploy/>`_ and configuration-management tools, such as :term:`Puppet` or :term:`Chef`, which can help automate this deployment process.
id: Meskipun penting bagi operator untuk memahami langkah-langkah yang terlibat dalam penerapan OpenStack, kami juga sangat menyarankan Anda untuk mengevaluasi `OpenStack deployment tools <https://docs.openstack.org/rocky/deploy/>`_ dan alat manajemen konfigurasi, seperti :term:`Puppet` or :term:`Chef`, yang dapat membantu mengotomatiskan proses penyebaran ini.

source: You may find that you can automate the partitioning itself. For example, MIT uses `Fully Automatic Installation (FAI) <http://fai-project.org/>`_ to do the initial PXE-based partition and then install using a combination of min/max and percentage-based partitioning.
id: Anda mungkin menemukan bahwa Anda dapat mengotomatisasi partisi itu sendiri. Sebagai contoh, MIT menggunakan `Fully Automatic Installation (FAI) <http://fai-project.org/>` _ untuk melakukan partisi awal berbasis PXE dan kemudian menginstal menggunakan kombinasi dari partisi min/max dan berbasis persentase.

source: will keep the RPC version locked across the specified services to the RPC version used in X+1. As all instances of a particular service are upgraded to the newer version, the corresponding line can be removed from ``nova.conf``.
id: akan membuat versi RPC terkunci di seluruh layanan yang ditentukan ke versi RPC yang digunakan dalam X+1. Karena semua instance layanan tertentu ditingkatkan (upgraded) ke versi yang lebih baru, baris yang sesuai dapat dihapus dari ``nova.conf``.
