Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: A quick way to check whether DNS is working is to resolve a hostname inside your instance by using the :command:`host` command. If DNS is working, you should see:
de: Eine schnelle Möglichkeit, um zu überprüfen, ob DNS funktioniert, besteht darin, einen Hostnamen innerhalb Ihrer Instanz mit dem Befehl :command:`host` aufzulösen. Wenn DNS funktioniert, sollten Sie es sehen:
id: Cara cepat untuk memeriksa apakah DNS berfungsi adalah dengan menyelesaikan nama host di dalam instance Anda dengan menggunakan perintah :command:`host`. Jika DNS berfungsi, Anda akan melihat:

source: A report came in: VMs were launching slowly, or not at all. Cue the standard checks—nothing on the Nagios, but there was a spike in network towards the current master of our RabbitMQ cluster. Investigation started, but soon the other parts of the queue cluster were leaking memory like a sieve. Then the alert came in—the master Rabbit server went down and connections failed over to the slave.
de: Ein Bericht kam rein: VMs starteten langsam oder gar nicht. Cue the standard checks - nichts auf den Nagios, aber es gab einen Anstieg im Netzwerk zum aktuellen Master unseres RabbitMQ-Clusters. Die Untersuchung begann, aber bald leckten die anderen Teile des Warteschlangenclusters wie ein Sieb. Dann kam der Alarm - der Master Rabbit Server ging aus und die Verbindungen zum Slave fielen aus.
id: Sebuah laporan muncul: VM diluncurkan perlahan, atau tidak sama sekali. Beri tanda pada pemeriksaan standar — tidak ada apa pun di Nagios, tetapi ada lonjakan jaringan terhadap master saat ini dari kluster RabbitMQ kami. Investigasi dimulai, tetapi segera bagian-bagian lain dari antrian cluster membocorkan memori seperti saringan (sieve). Kemudian peringatan datang — server master Kelinci down dan koneksi gagal ke slave.

source: A security domain comprises of users, applications, servers or networks that share common trust requirements and expectations within a system. Typically they have the same authentication and authorization requirements and users.
de: Eine Sicherheitsdomäne umfasst Benutzer, Anwendungen, Server oder Netzwerke, die gemeinsame Vertrauensanforderungen und Erwartungen innerhalb eines Systems teilen. In der Regel haben sie die gleichen Authentifizierungs- und Autorisierungsanforderungen und Benutzer.
id: Domain keamanan terdiri dari pengguna, aplikasi, server atau jaringan yang berbagi persyaratan dan harapan kepercayaan bersama dalam suatu sistem. Biasanya mereka memiliki persyaratan dan pengguna otentikasi dan otorisasi yang sama.

source: A security service stores configuration information for clients for authentication and authorization. Inside Manila a share network can be associated with up to three security types (for detailed information see `Security services <https://docs.openstack.org/manila/latest/admin/shared-file-systems-security-services.html>`__ in OpenStack Manila Administrator Guide).
de: Ein Sicherheitsdienst speichert Konfigurationsinformationen für Clients zur Authentifizierung und Autorisierung. Innerhalb von Manila kann ein Freigabe-Netzwerk mit bis zu drei Sicherheitsarten verknüpft werden (für detaillierte Informationen siehe `Sicherheitsdienste <https://docs.openstack.org/manila/latest/admin/shared-file-systems-security-services.html>`__ im OpenStack Manila Administrator Guide).
id: Layanan keamanan menyimpan informasi konfigurasi untuk klien untuk otentikasi dan otorisasi. Di Manila, jaringan berbagi dapat dikaitkan dengan hingga tiga jenis keamanan (untuk informasi rinci, lihat `Security services <https://docs.openstack.org/manila/latest/admin/shared-file-systems-security-services.html>`__ dalam OpenStack Manila Administrator Guide).

source: A service to provide queues of messages and notifications was released.
de: Ein Dienst zum Bereitstellen von Warteschlangen von Nachrichten und Benachrichtigungen wurde freigegeben.
id: Layanan untuk menyediakan antrian pesan dan pemberitahuan dirilis.

source: A shell where you can get some work done
de: Eine Shell, in der Sie etwas Arbeit erledigen können
id: Shell tempat Anda bisa menyelesaikan pekerjaan

source: A similar pattern can be followed in other projects that use the driver architecture. Simply create a module and class that conform to the driver interface and plug it in through configuration. Your code runs when that feature is used and can call out to other services as necessary. No project core code is touched. Look for a "driver" value in the project's ``.conf`` configuration files in ``/etc/<project>`` to identify projects that use a driver architecture.
de: Ein ähnliches Muster kann in anderen Projekten, die die Treiberarchitektur verwenden, verfolgt werden. Erstellen Sie einfach ein Modul und eine Klasse, die der Treiberoberfläche entsprechen, und schließen Sie es über die Konfiguration an. Ihr Code läuft bei Verwendung dieser Funktion und kann bei Bedarf andere Dienste aufrufen. Es wird kein Projektkern-Code berührt. Suchen Sie nach einem "Treiber"-Wert in den Konfigurationsdateien des Projekts unter ``/etc/<project>``, um Projekte zu identifizieren, die eine Treiberarchitektur verwenden.
id: Pola serupa dapat diikuti dalam proyek lain yang menggunakan arsitektur driver. Cukup buat modul dan kelas yang sesuai dengan antarmuka driver dan hubungkan melalui konfigurasi. Kode Anda berjalan ketika fitur itu digunakan dan dapat memanggil layanan lain yang diperlukan. Tidak ada kode core proyek yang disentuh. Cari nilai "driver" di file konfigurasi ``.conf`` proyek di ``/etc/<project>`` untuk mengidentifikasi proyek yang menggunakan arsitektur driver.

source: A single-site cloud with equipment fed by separate power supplies.
de: Eine Single-Site-Cloud mit Geräten, die von separaten Stromversorgungen gespeist werden.
id: Single-site cloud dengan peralatan yang diumpankan oleh catu daya terpisah.

source: A snapshot captures the state of the file system, but not the state of the memory. Therefore, to ensure your snapshot contains the data that you want, before your snapshot you need to ensure that:
de: Eine Schattenkopie erfasst den Zustand des Dateisystems, nicht aber den Zustand des Speichers. Um sicherzustellen, dass Ihre Schattenkopie die gewünschten Daten enthält, müssen Sie dies vor Ihrer Schattenkopie sicherstellen:

source: A tangible example of this is the ``nova-compute`` process. In order to manage the image cache with libvirt, ``nova-compute`` has a periodic process that scans the contents of the image cache. Part of this scan is calculating a checksum for each of the images and making sure that checksum matches what ``nova-compute`` expects it to be. However, images can be very large, and these checksums can take a long time to generate. At one point, before it was reported as a bug and fixed, ``nova-compute`` would block on this task and stop responding to RPC requests. This was visible to users as failure of operations such as spawning or deleting instances.
de: Ein konkretes Beispiel dafür ist der Prozess des ``nova-compute``. Um den Image-Cache mit libvirt zu verwalten, hat ``nova-compute`` einen periodischen Prozess, der den Inhalt des Image-Cache scannt. Ein Teil dieses Scans ist das Berechnen einer Prüfsumme für jedes der Abbilder und das Sicherstellen, dass die Prüfsumme mit dem übereinstimmt, was ``nova-compute`` erwartet. Allerdings können Abbilder sehr groß sein, und diese Prüfsummen können lange Zeit in Anspruch nehmen. An einem Punkt, bevor er als Fehler gemeldet und behoben wurde, würde ``nova-compute`` diese Aufgabe blockieren und nicht mehr auf RPC-Anfragen reagieren. Dies war für die Benutzer als Ausfall von Operationen wie Spawning oder Löschen von Instanzen sichtbar.
id: Contoh nyata dari ini adalah proses ``nova-compute``. Untuk mengelola cache image dengan libvirt, ``nova-compute`` memiliki proses periodik yang memindai isi cache image. Bagian dari pemindaian ini menghitung checksum untuk setiap image dan memastikan bahwa checksum cocok dengan apa yang diharapkan oleh ``nova-compute``. Namun, image bisa sangat besar, dan checksum ini dapat memakan waktu lama untuk dibuat. Pada satu titik, sebelum dilaporkan sebagai bug dan diperbaiki, ``nova-compute`` akan memblokir tugas ini dan berhenti merespons permintaan RPC. Ini terlihat oleh pengguna sebagai kegagalan operasi seperti memijah atau menghapus instance.

source: A tool such as **collectd** can be used to store this information. While collectd is out of the scope of this book, a good starting point would be to use collectd to store the result as a COUNTER data type. More information can be found in `collectd's documentation <https://collectd.org/wiki/index.php/Data_source>`_.
de: Ein Tool wie **collectd** kann verwendet werden, um diese Informationen zu speichern. Obwohl collectd außerhalb des Umfangs dieses Buches liegt, wäre ein guter Ausgangspunkt, collectd zu verwenden, um das Ergebnis als COUNTER-Datentyp zu speichern. Weitere Informationen finden Sie in der Dokumentation von `collectd <https://collectd.org/wiki/index.php/Data_source>`_.
id: Alat seperti **collectd ** dapat digunakan untuk menyimpan informasi ini. Meskipun collectd berada di luar cakupan buku ini, titik awal yang baik adalah menggunakan collectd untuk menyimpan hasilnya sebagai tipe data COUNTER. Informasi lebih lanjut dapat ditemukan di `collectd's documentation <https://collectd.org/wiki/index.php/Data_source>`_.

source: A typical user
de: Ein typischer Benutzer

source: A user might need a custom flavor that is uniquely tuned for a project she is working on. For example, the user might require 128 GB of memory. If you create a new flavor as described above, the user would have access to the custom flavor, but so would all other tenants in your cloud. Sometimes this sharing isn't desirable. In this scenario, allowing all users to have access to a flavor with 128 GB of memory might cause your cloud to reach full capacity very quickly. To prevent this, you can restrict access to the custom flavor using the :command:`nova flavor-access-add` command:
de: Ein Benutzer benötigt möglicherweise eine benutzerdefinierte Variante, die speziell auf ein Projekt abgestimmt ist, an dem er gerade arbeitet. So kann der Benutzer beispielsweise 128 GB Speicherplatz benötigen. Wenn Sie wie oben beschrieben eine neue Variante anlegen, hat der Benutzer Zugriff auf den benutzerdefinierten Variante, aber auch alle anderen Mandanten in Ihrer Cloud. Manchmal ist diese Freigabe nicht erwünscht. In diesem Szenario kann es in diesem Fall sehr schnell dazu führen, dass Ihre Cloud die volle Kapazität erreicht, wenn alle Benutzer Zugriff auf eine Variante mit 128 GB Speicher haben. Um dies zu verhindern, können Sie den Zugriff auf den benutzerdefinierten Variante mit dem Befehl ' command:`nova flavor-access-add` einschränken:
id: Seorang pengguna mungkin membutuhkan flavor khusus yang disesuaikan secara unik untuk proyek yang sedang dikerjakannya. Misalnya, pengguna mungkin membutuhkan memori 128 GB. Jika Anda membuat flavor baru seperti dijelaskan di atas, pengguna akan memiliki akses ke flavor kustom, tetapi demikian juga semua penyewa lain di cloud Anda. Terkadang berbagi ini tidak diinginkan. Dalam skenario ini, memungkinkan semua pengguna memiliki akses ke flavor dengan memori 128 GB dapat menyebabkan cloud Anda mencapai kapasitas penuh dengan sangat cepat. Untuk mencegah hal ini, Anda dapat membatasi akses ke flavor kustom menggunakan perintah :command:`nova flavor-access-add` :

source: A user recently tried launching a CentOS instance on that node
de: Ein Benutzer hat kürzlich versucht, eine CentOS-Instanz auf diesem Knoten zu starten
id: Seorang pengguna baru-baru ini mencoba meluncurkan instance CentOS pada node itu

source: Absolute limits
de: Absolute Grenzwerte

source: Abstract
de: Abstrakt
id: Abstrak

source: Account quotas
de: Kontingente
id: Kuota akun

source: Acknowledgements
de: Danksagungen
id: Ucapan Terima Kasih

source: Adam Powell in Racker IT supplied us with bandwidth each day and second monitors for those of us needing more screens.
de: Adam Powell von Racker IT stellte uns täglich Bandbreite und zweite Monitore für diejenigen von uns zur Verfügung, die mehr Bildschirme benötigen.
id: Adam Powell di Racker IT memberi kami bandwidth setiap hari dan monitor kedua bagi kami yang membutuhkan lebih banyak layar.

source: Adam facilitated this book sprint. He also founded the book sprint methodology and is the most experienced book-sprint facilitator around. See `BookSprints <https://www.booksprints.net>`_ for more information. Adam founded FLOSS Manuals—a community of some 3,000 individuals developing Free Manuals about Free Software. He is also the founder and project manager for Booktype, an open source project for writing, editing, and publishing books online and in print.
de: Adam ermöglichte diesen Buchsprint. Er gründete auch die Methodik des Buchsprints und ist der erfahrenste Buchdruck-Moderator überhaupt. Siehe `BookSprints <https://www.booksprints.net>`_ für weitere Informationen. Adam gründete FLOSS Manuals - eine Gemeinschaft von rund 3.000 Personen, die kostenlose Handbücher über Freie Software entwickeln. Er ist auch Gründer und Projektleiter von Buchtyp, einem Open-Source-Projekt zum Schreiben, Bearbeiten und Veröffentlichen von Büchern online und im Druck.

source: Add all raw disks to one large RAID array, either hardware or software based. You can partition this large array with the boot, root, swap, and LVM areas. This option is simple to implement and uses all partitions. However, disk I/O might suffer.
de: Fügen Sie alle Rohdatenträger zu einem großen RAID-Array hinzu, entweder hardware- oder softwarebasiert. Sie können dieses große Array mit den Bereichen boot, root, swap und LVM partitionieren. Diese Option ist einfach zu implementieren und verwendet alle Partitionen. Allerdings kann es bei der Festplatten-I/O zu Problemen kommen.
id: Tambahkan semua disk baku ke satu array RAID besar, baik berbasis perangkat keras atau perangkat lunak. Anda dapat mempartisi array besar ini dengan area boot, root, swap, dan LVM. Opsi ini mudah diterapkan dan menggunakan semua partisi. Namun, disk I/O mungkin terbebani.

source: Add device ``snooper0`` to bridge ``br-int``:
de: Gerät ``snooper0`` zur Brücke ``br-int`` hinzufügen:
id: Tambahkan perangkat ``snooper0`` untuk menjembatani ``br-int``:

source: Add metadata to the container to allow the IP:
de: Fügen Sie dem Container Metadaten hinzu, um die IP zu ermöglichen:
id: Tambahkan metadata ke kontainer untuk memungkinkan IP:

source: Add the repository for the new release packages.
de: Fügen Sie das Repository für die neuen Release-Pakete hinzu.
id: Tambahkan repositori untuk paket rilis baru.

source: Adding Custom Logging Statements
de: Hinzufügen von benutzerdefinierten Protokollierungsanweisungen
id: Menambahkan Pernyataan Logging Kustom

source: Adding Images
de: Hinzufügen vonAbbildern
id: Menambahkan Images

source: Adding Projects
de: Projekte hinzufügen
id: Menambahkan Proyek

source: Adding Signed Images
de: Hinzufügen von signierten Abbildern
id: Menambahkan Signed Images

source: Adding a Compute Node
de: Hinzufügen eines Compute-Knotens
id: Menambahkan Node Komputasi

source: Adding a new object storage node is different from adding compute or block storage nodes. You still want to initially configure the server by using your automated deployment and configuration-management systems. After that is done, you need to add the local disks of the object storage node into the object storage ring. The exact command to do this is the same command that was used to add the initial disks to the ring. Simply rerun this command on the object storage proxy server for all disks on the new object storage node. Once this has been done, rebalance the ring and copy the resulting ring files to the other storage nodes.
de: Das Hinzufügen eines neuen Objektspeicherknotens unterscheidet sich vom Hinzufügen von Compute- oder Blockspeicherknoten. Sie möchten den Server weiterhin zunächst mit Ihren automatisierten Bereitstellungs- und Konfigurationsmanagementsystemen konfigurieren. Danach müssen Sie die lokalen Festplatten des Objektspeicherknotens in den Objektspeicherring einfügen. Der genaue Befehl dazu ist derselbe Befehl, mit dem auch die ersten Festplatten zum Ring hinzugefügt wurden. Führen Sie diesen Befehl einfach auf dem Objektspeicher-Proxyserver für alle Festplatten auf dem neuen Objektspeicherknoten erneut aus. Sobald dies geschehen ist, balancieren Sie den Ring neu aus und kopieren Sie die resultierenden Ringdateien auf die anderen Speicherknoten.
id: Menambahkan node penyimpanan objek baru berbeda dari menambahkan komputasi atau memblokir node penyimpanan. Anda masih ingin mengkonfigurasi server dengan menggunakan sistem manajemen konfigurasi dan penyebaran otomatis Anda. Setelah itu selesai, Anda perlu menambahkan disk lokal dari node penyimpanan objek ke dalam ring penyimpanan objek. Perintah yang tepat untuk melakukan ini adalah perintah yang sama yang digunakan untuk menambahkan disk awal ke ring. Cukup jalankan kembali perintah ini pada server proxy penyimpanan objek untuk semua disk pada node penyimpanan objek baru. Setelah ini selesai, menyeimbangkan ulang ring dan menyalin file ring yang dihasilkan ke node penyimpanan lainnya.

source: Adding an Object Storage Node
de: Hinzufügen eines Objektspeicherknotens
id: Menambahkan node penyimpanan objek ( Object Storage node)

source: Adding cloud controller nodes
de: Hinzufügen von Cloud-Controller-Knoten
id: Menambahkan node pengontrol cloud

source: Adding security groups is typically done on instance boot. When launching from the dashboard, you do this on the :guilabel:`Access & Security` tab of the :guilabel:`Launch Instance` dialog.
de: Das Hinzufügen von Sicherheitsgruppen erfolgt üblicherweise beim Booten der Instanz. Wenn Sie aus dem Dashboard starten, tun Sie dies auf der Registerkarte :guilabel:`Access & Security` des Dialogs :guilabel:`Launch Instance`.

source: Adding to a RAID array (RAID stands for redundant array of independent disks), based on the number of disks you have available, so that you can add capacity as your cloud grows. Some options are described in more detail below.
de: Hinzufügen zu einem RAID-Array (RAID steht für redundantes Array unabhängiger Festplatten), basierend auf der Anzahl der verfügbaren Festplatten, so dass Sie Kapazität hinzufügen können, wenn Ihre Cloud wächst. Einige Optionen werden im Folgenden näher beschrieben.
id: Menambah array RAID (RAID adalah singkatan dari redundant array of independent disks), berdasarkan jumlah disk yang Anda miliki, sehingga Anda dapat menambah kapasitas saat cloud Anda tumbuh. Beberapa opsi dijelaskan secara lebih rinci di bawah ini.

source: Additional optional restrictions on which compute nodes the flavor can run on. This is implemented as key-value pairs that must match against the corresponding key-value pairs on compute nodes. Can be used to implement things like special resources (such as flavors that can run only on compute nodes with GPU hardware).
de: Zusätzliche optionale Einschränkungen, auf welchen Compute-Knoten der Flavor laufen kann. Dies ist als Schlüssel-Wert-Paare implementiert, die mit den entsprechenden Schlüssel-Wert-Paaren auf Compute-Knoten übereinstimmen müssen. Kann verwendet werden, um Dinge wie spezielle Ressourcen zu implementieren (z.B. Varianten, die nur auf Compute-Knoten mit GPU-Hardware laufen können).
id: Pembatasan opsional tambahan di mana node komputasi flavor dapat berjalan. Ini diimplementasikan sebagai pasangan nilai kunci yang harus cocok dengan pasangan nilai kunci yang sesuai pada node komputasi. Dapat digunakan untuk mengimplementasikan hal-hal seperti sumber daya khusus (seperti flavor yang hanya dapat berjalan pada komputasi node dengan perangkat keras GPU).

source: Additionally, for Identity-related issues, try the tips in :ref:`sql_backend`.
de: Zusätzlich können Sie bei identitätsbezogenen Problemen die Tipps in :ref:`sql_backend` ausprobieren.
id: Selain itu, untuk masalah yang berkaitan dengan Identitas, cobalah kiat di :ref:`sql_backend`.

source: Additionally, this instance in question was responsible for a very, very large backup job each night. While "The Issue" (as we were now calling it) didn't happen exactly when the backup happened, it was close enough (a few hours) that we couldn't ignore it.
de: Außerdem war diese fragliche Instanz jede Nacht für einen sehr, sehr großen Backup-Job verantwortlich. Während "Das Problem" (wie wir es jetzt nannten) nicht genau zum Zeitpunkt des Backups passierte, war es nah genug (ein paar Stunden), dass wir es nicht ignorieren konnten.
id: Selain itu, instance ini bertanggung jawab atas pekerjaan backup yang sangat, sangat besar setiap malam. Sementara "The Issue" (seperti yang kita sebut sekarang) tidak terjadi tepat ketika backup terjadi, itu cukup dekat (beberapa jam) sehingga kami tidak bisa mengabaikannya.

source: Additionally, you can refer to `neutron client <https://docs.openstack.org/python-neutronclient/latest/>`_ for more options.
de: Zusätzlich können Sie unter `neutron client <https://docs.openstack.org/python-neutronclient/latest/>`_ weitere Optionen finden.
id: Selain itu, Anda dapat merujuk `neutron client <https://docs.openstack.org/python-neutronclient/latest/>`_ untuk opsi lainnya.

source: Additionally, you should also specify one of these supported authentication methods:
de: Zusätzlich sollten Sie auch eine dieser unterstützten Authentifizierungsmethoden angeben:

source: Adjust the appropriate limits in the ``/etc/security/limits.conf`` configuration file.
de: Passen Sie die entsprechenden Grenzwerte in der Konfigurationsdatei ``/etc/security/limits.conf`` an.
id: Sesuaikan batas yang sesuai dalam file konfigurasi ``/etc/security/limits.conf``.

source: Administrative Command-Line Tools
de: Administrative Befehlszeilen-Tools
id: Alat Command-Line Administratif

source: Advanced Configuration
de: Erweiterte Konfiguration - Ausschlüsse
id: Konfigurasi Lanjutan

source: After a Compute Node Reboots
de: Nach einem Neustart des Compute-Knotens
id: Setelah node komputasi, reboot

source: After a cloud controller reboots, ensure that all required services were successfully started. The following commands use :command:`ps` and :command:`grep` to determine if nova, glance, and keystone are currently running:
de: Stellen Sie nach einem Neustart eines Cloud-Controllers sicher, dass alle erforderlichen Dienste erfolgreich gestartet wurden. Die folgenden Befehle verwenden :command:`ps` und :command:`grep`, um festzustellen, ob nova, glance und keystone gerade laufen:
id: Setelah pengontrol cloud dinyalakan ulang, pastikan semua layanan yang diperlukan berhasil dimulai. Perintah berikut menggunakan :command:`ps` dan :command:`grep` untuk menentukan apakah nova, glance, dan keystone saat ini sedang berjalan:

source: After a few minutes of troubleshooting, I saw the following details:
de: Nach ein paar Minuten der Fehlersuche sah ich die folgenden Details:
id: Setelah beberapa menit pemecahan masalah, saya melihat detail berikut:

source: After digging into the nova (OpenStack Compute) code, I noticed two areas in ``api/ec2/cloud.py`` potentially impacting my system:
de: Nachdem ich in den nova (OpenStack Compute) Code gegraben hatte, bemerkte ich zwei Bereiche in ``api/ec2/cloud.py``, die sich auf mein System auswirken könnten:
id: Setelah menggali kode nova (OpenStack Compute), saya perhatikan dua area di ``api/ec2/cloud.py`` yang berpotensi memengaruhi sistem saya:
