Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: Cells and regions, which segregate an entire cloud and result in running separate Compute deployments.
de: Zellen und Regionen, die eine ganze Cloud trennen und dazu führen, dass separate Compute-Implementierungen ausgeführt werden.
id: Sel dan wilayah, yang memisahkan seluruh cloud dan menghasilkan menjalankan penyebaran Compute yang terpisah.

source: Centrally Managing Logs
de: Zentrale Verwaltung von Protokollen
id: Mengelola Log Secara terpusat

source: Certain locations might require local vendors to provide support and services for each site which may vary with the licensing agreement in place.
de: Bestimmte Standorte können von lokalen Anbietern verlangen, dass sie für jeden Standort Support und Dienstleistungen anbieten, die von der bestehenden Lizenzvereinbarung abweichen können.
id: Lokasi tertentu mungkin memerlukan vendor lokal untuk memberikan dukungan dan layanan untuk setiap situs yang mungkin berbeda dengan perjanjian lisensi yang berlaku.

source: Change access rules for shares, reset share state
de: Zugriffsregeln für Freigaben ändern, Freigabestatus zurücksetzen
id: Ubah aturan akses untuk share, setel ulang status share

source: Change to the directory where Object Storage is installed:
de: Wechseln Sie in das Verzeichnis, in dem der Objektspeicher installiert ist:
id: Ubah ke direktori tempat Object Storage diinstal:

source: Check cloud usage:
de: Überprüfen Sie die Nutzung der Cloud:
id: Periksa penggunaan cloud:

source: Check for instances in a failed or weird state and investigate why.
de: Überprüfen Sie, ob es sich um Instanzen in einem fehlerhaften oder seltsamen Zustand handelt und untersuchen Sie, warum.
id: Periksa instance dalam keadaan gagal atau aneh dan selidiki mengapa.

source: Check for operator accounts that should be removed.
de: Überprüfen Sie, ob Betreiberkonten, die entfernt werden sollen.
id: Periksa akun operator yang harus dihapus.

source: Check for security patches and apply them as needed.
de: Überprüfen Sie auf Sicherheitspatches und wenden Sie diese bei Bedarf an.
id: Periksa patch keamanan dan terapkan seperlunya.

source: Check for user accounts that should be removed.
de: Überprüfen Sie, ob es Benutzerkonten gibt, die entfernt werden sollen.
id: Periksa akun pengguna yang harus dihapus.

source: Check if there is an appropriate share type defined in the Shared File Systems service
de: Überprüfen Sie, ob im Dienst Shared File Systems ein geeigneter Share Type definiert ist

source: Check memory consumption:
de: Überprüfen Sie den Speicherverbrauch:
id: Periksa konsumsi memori:

source: Check the attributes of the updated Share1:
de: Überprüfen Sie die Attribute des aktualisierten Share1:

source: Check the port connection using the netcat utility:
de: Überprüfen Sie die Portverbindung mit dem Dienstprogramm netcat:
id: Periksa koneksi port menggunakan utilitas netcat:

source: Check the ports for the lost IP address and update the name:
de: Überprüfen Sie die Ports auf die verlorene IP-Adresse und aktualisieren Sie den Namen:
id: Periksa port untuk alamat IP yang hilang dan perbarui namanya:

source: Check the share status and see the share export location. After creation, the share status should become ``available``:
de: Überprüfen Sie den Freigabestatus und sehen Sie den Exportort der Freigabe. Nach der Erstellung sollte der Freigabestatus ``verfügbar``werden:

source: Check usage and trends over the past month.
de: Überprüfen Sie die Nutzung und die Trends des letzten Monats.
id: Periksa penggunaan dan tren selama sebulan terakhir.

source: Check your monitoring system for alerts and act on them.
de: Überprüfen Sie Ihr Überwachungssystem auf Alerts und handeln Sie daraufhin.
id: Periksa sistem pemantauan Anda untuk peringatan dan menindaklanjutinya.

source: Check your ticket queue for new tickets.
de: Überprüfen Sie Ihre Ticketwarteschlange auf neue Tickets.
id: Periksa antrean tiket Anda untuk tiket baru.

source: Clean up after an OpenStack upgrade (any unused or new services to be aware of?).
de: Bereinigung nach einem OpenStack-Upgrade (unbenutzte oder neue Dienste, auf die man achten sollte?).
id: Bersihkan setelah upgrade OpenStack (layanan apa pun yang tidak digunakan atau baru untuk diperhatikan?).

source: Clean up by clearing all mirrors on ``br-int`` and deleting the dummy interface:
de: Bereinigung durch Löschen aller Spiegel auf ``br-int`` und Löschen der Dummy-Schnittstelle:
id: Bersihkan dengan menghapus semua mirror di ``br-int`` dan menghapus antarmuka dummy:

source: Click the :guilabel:`Create Project` button.
de: Klicken Sie auf die Schaltfläche :guilabel:`Create Project`.
id: Klik tombol :guilabel:`Create Project`.

source: Cloud (General)
de: Cloud (allgemein)
id: Cloud (Umum)

source: Cloud Controller and Storage Proxy Failures and Maintenance
de: Ausfälle und Wartung von Cloud Controllern und Storage-Proxys
id: Kegagalan Pengontrol Cloud dan Proksi Penyimpanan dan Pemeliharaan

source: Cloud computing is quite an advanced topic, and this book requires a lot of background knowledge. However, if you are fairly new to cloud computing, we recommend that you make use of the :doc:`common/glossary` at the back of the book, as well as the online documentation for OpenStack and additional resources mentioned in this book in :doc:`app-resources`.
de: Cloud Computing ist ein sehr fortgeschrittenes Thema, und dieses Buch erfordert viel Hintergrundwissen. Wenn Sie jedoch noch relativ neu im Cloud Computing sind, empfehlen wir Ihnen, das :doc:`common /glossary` auf der Rückseite des Buches sowie die Online-Dokumentation zu OpenStack und weitere in diesem Buch erwähnte Ressourcen unter :doc:`app-resources` zu verwenden.

source: Cloud controller receives the renewal request and sends a response.
de: Der Cloud-Controller empfängt den Verlängerungsantrag und sendet eine Antwort.
id: Pengontrol cloud menerima permintaan pembaruan dan mengirim respons.

source: Cloud controller receives the second request and sends a new response.
de: Die Cloud-Steuerung empfängt die zweite Anforderung und sendet eine neue Antwort.
id: Pengontrol cloud menerima permintaan kedua dan mengirimkan respons baru.

source: Cloud security architecture
de: Cloud-Sicherheitsarchitektur
id: Arsitektur keamanan cloud

source: Cloud security architecture should recognize the issues that arise with security management, which addresses these issues with security controls. Cloud security controls are put in place to safeguard any weaknesses in the system, and reduce the effect of an attack.
de: Die Cloud-Sicherheitsarchitektur sollte die Probleme erkennen, die beim Sicherheitsmanagement auftreten, das diese Probleme mit Sicherheitskontrollen angeht. Cloud-Sicherheitskontrollen werden eingerichtet, um Schwachstellen im System zu schützen und die Auswirkungen eines Angriffs zu reduzieren.
id: Arsitektur keamanan cloud harus mengenali masalah yang muncul dengan manajemen keamanan, yang mengatasi masalah ini dengan kontrol keamanan. Kontrol keamanan cloud diterapkan untuk melindungi segala kelemahan dalam sistem, dan mengurangi efek serangan.

source: Cloud-based applications typically request more discrete hardware (horizontal scaling) as opposed to traditional applications, which require larger hardware to scale (vertical scaling).
de: Cloud-basierte Anwendungen erfordern typischerweise diskretere Hardware (horizontale Skalierung) als herkömmliche Anwendungen, die größere Hardware zur Skalierung benötigen (vertikale Skalierung).
id: Aplikasi berbasis cloud biasanya meminta lebih banyak perangkat keras diskrit (penskalaan horizontal) sebagai kebalikan dari aplikasi tradisional, yang membutuhkan perangkat keras yang lebih besar untuk skala (penskalaan vertikal).

source: Command-Line Tools
de: Befehlszeilen-Tools

source: Common areas of regulation include:
de: Zu den gemeinsamen Regelungsbereichen gehören:
id: Area regulasi yang umum meliputi:

source: Compare an attribute in the resource with an attribute extracted from the user's security credentials and evaluates successfully if the comparison is successful. For instance, ``"tenant_id:%(tenant_id)s"`` is successful if the tenant identifier in the resource is equal to the tenant identifier of the user submitting the request.
de: Vergleichen Sie ein Attribut in der Ressource mit einem Attribut, das aus den Sicherheitsdaten des Benutzers extrahiert wurde, und werten Sie erfolgreich aus, wenn der Vergleich erfolgreich ist. Beispielsweise ist ``"tenant_id:%(tenant_id)s"`` erfolgreich, wenn die Mandantenkennung in der Ressource gleich der Mandantenkennung des anfragenden Benutzers ist.

source: Compute Node Failures and Maintenance
de: Compute-Knotenausfällen und Wartung
id: Compute Node Failures dan Maintenance

source: Compute nodes
de: Compute-Knoten

source: Compute nodes can fail the same way a cloud controller can fail. A motherboard failure or some other type of hardware failure can cause an entire compute node to go offline. When this happens, all instances running on that compute node will not be available. Just like with a cloud controller failure, if your infrastructure monitoring does not detect a failed compute node, your users will notify you because of their lost instances.
de: Compute-Knoten können genauso ausfallen wie ein Cloud-Controller. Ein Mainboard-Ausfall oder eine andere Art von Hardware-Ausfall kann dazu führen, dass ein ganzer Compute-Knoten offline geht. In diesem Fall sind alle Instanzen, die auf diesem Compute-Knoten ausgeführt werden, nicht verfügbar. Genau wie bei einem Ausfall eines Cloud-Controllers, wenn Ihre Infrastrukturüberwachung keinen ausgefallenen Compute-Knoten erkennt, werden Ihre Benutzer Sie wegen ihrer verlorenen Instanzen benachrichtigen.
id: Compute Node bisa gagal dengan cara yang sama seperti cloud controller bisa gagal. Kegagalan motherboard atau beberapa jenis kegagalan perangkat keras lainnya dapat menyebabkan seluruh compute Nodei offline. Ketika ini terjadi, semua instance yang berjalan pada compute Node itu tidak akan tersedia. Seperti halnya kegagalan pengontrol cloud, jika pemantauan infrastruktur Anda tidak mendeteksi compute Node yang gagal, pengguna Anda akan memberi tahu Anda karena instans mereka yang hilang.

source: Compute nodes have 24 to 48 cores, with at least 4 GB of RAM per core and approximately 40 GB of ephemeral storage per core.
de: Compute-Knoten haben 24 bis 48 Kerne, mit mindestens 4 GB RAM pro Kern und etwa 40 GB ephemeren Speicher pro Kern.
id: Compute nodes memiliki 24 hingga 48 core, dengan setidaknya 4 GB RAM per core dan sekitar 40 GB penyimpanan sesaat per core.

source: Compute quota descriptions
de: Beschreibung Compute-Quota
id: Deskripsi kuota Compute

source: Compute service - Edit the configuration file and restart the service.
de: Compute Service - Bearbeiten Sie die Konfigurationsdatei und starten Sie den Dienst neu.
id: Layanan Compute - Edit file konfigurasi dan restart layanan.

source: Compute service, including networking components.
de: Rechendienst, einschließlich Netzwerkkomponenten.
id: Layanan Compute, termasuk komponen jaringan.

source: Conclusion
de: Schlussfolgerung
id: Kesimpulan

source: Configuration Management
de: Konfigurationsmanagement
id: Configuration Management (manajemen konfigurasi)

source: Configuration changes to ``nova.conf``.
de: Die Konfiguration ändert sich zu ``nova.conf``.
id: Konfigurasi berubah menjadi ``nova.conf``.

source: Connect the qemu-nbd device to the disk.
de: Verbinden Sie das qemu-nbd Gerät mit der Festplatte.
id: Hubungkan perangkat qemu-nbd ke disk.

source: Connect the qemu-nbd device to the disk:
de: Verbinden Sie das qemu-nbd Gerät mit der Festplatte:
id: Hubungkan perangkat qemu-nbd ke disk:

source: Consider adopting structure and options from the service configuration files and merging them with existing configuration files. The `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/>`_ contains new, updated, and deprecated options for most services.
de: Erwägen Sie, Struktur und Optionen aus den Service-Konfigurationsdateien zu übernehmen und sie mit bestehenden Konfigurationsdateien zu verschmelzen. Die `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/>`_ enthält neue, aktualisierte und veraltete Optionen für die meisten Dienste.
id: Pertimbangkan untuk mengadopsi struktur dan opsi dari file konfigurasi layanan dan menggabungkannya dengan file konfigurasi yang ada. `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/>` _ berisi opsi baru, yang diperbarui, dan tidak digunakan lagi untuk sebagian besar layanan.

source: Consider security implications and requirements before designing the physical and logical network topologies. Make sure that the networks are properly segregated and traffic flows are going to the correct destinations without crossing through locations that are undesirable. Consider the following factors:
de: Berücksichtigen Sie Sicherheitsimplikationen und -anforderungen, bevor Sie die physischen und logischen Netzwerktopologien entwerfen. Stellen Sie sicher, dass die Netzwerke ordnungsgemäß getrennt sind und die Verkehrsströme zu den richtigen Zielen gelangen, ohne unerwünschte Orte zu passieren. Berücksichtigen Sie die folgenden Faktoren:
id: Pertimbangkan implikasi dan persyaratan keamanan sebelum merancang topologi jaringan fisik dan logis. Pastikan bahwa jaringan dipisahkan dengan baik dan arus lalu lintas menuju ke tujuan yang benar tanpa melintasi lokasi yang tidak diinginkan. Pertimbangkan faktor-faktor berikut:

source: Consider the approach to upgrading your environment. You can perform an upgrade with operational instances, but this is a dangerous approach. You might consider using live migration to temporarily relocate instances to other compute nodes while performing upgrades. However, you must ensure database consistency throughout the process; otherwise your environment might become unstable. Also, don't forget to provide sufficient notice to your users, including giving them plenty of time to perform their own backups.
de: Berücksichtigen Sie den Ansatz für die Aktualisierung Ihrer Umgebung. Sie können ein Upgrade mit operativen Instanzen durchführen, aber das ist ein gefährlicher Ansatz. Sie können die Live-Migration verwenden, um Instanzen während der Durchführung von Upgrades vorübergehend auf andere Compute-Knoten zu verschieben. Sie müssen jedoch die Konsistenz der Datenbank während des gesamten Prozesses sicherstellen, da Ihre Umgebung sonst instabil werden könnte. Vergessen Sie auch nicht, Ihre Benutzer ausreichend zu informieren, einschließlich der Zeit, die sie benötigen, um ihre eigenen Backups durchzuführen.
id: Pertimbangkan pendekatan untuk upgrade lingkungan Anda. Anda dapat melakukan upgrade dengan instance operasional, tetapi ini adalah pendekatan yang berbahaya. Anda mungkin mempertimbangkan menggunakan migrasi langsung untuk memindahkan sementara instance ke node komputasi lain saat melakukan upgrade. Namun, Anda harus memastikan konsistensi database selama proses berlangsung; jika tidak, lingkungan Anda mungkin menjadi tidak stabil. Juga, jangan lupa untuk memberikan pemberitahuan yang cukup kepada pengguna Anda, termasuk memberi mereka banyak waktu untuk melakukan backup sendiri.

source: Consider the example where you want to take a snapshot of a persistent block storage volume, detected by the guest operating system as ``/dev/vdb`` and mounted on ``/mnt``. The fsfreeze command accepts two arguments:
de: Betrachten Sie das Beispiel, wo Sie eine Schattenkopie eines persistenten Blockspeicherdatenträgers machen möchten, das vom Gastbetriebssystem als ``/dev/vdb`` erkannt und auf ``/mnt`` gemountet wird. Der Befehl fsfreeze akzeptiert zwei Argumente:

source: Consider the following example:
de: Betrachten Sie das folgende Beispiel:
id: Perhatikan contoh berikut:

source: Consider the following security implications and requirements:
de: Berücksichtigen Sie die folgenden Sicherheitsimplikationen und -anforderungen:
id: Pertimbangkan implikasi dan persyaratan keamanan berikut:

source: Consider the impact of an upgrade to users. The upgrade process interrupts management of your environment including the dashboard. If you properly prepare for the upgrade, existing instances, networking, and storage should continue to operate. However, instances might experience intermittent network interruptions.
de: Berücksichtigen Sie die Auswirkungen eines Upgrades auf die Benutzer. Der Upgrade-Prozess unterbricht die Verwaltung Ihrer Umgebung einschließlich des Dashboards. Wenn Sie sich richtig auf das Upgrade vorbereiten, sollten bestehende Instanzen, Netzwerke und Speicher weiterhin funktionieren. In Einzelfällen kann es jedoch zu intermittierenden Netzwerkunterbrechungen kommen.
id: Pertimbangkan dampak upgrade ke pengguna. Proses upgrade mengganggu manajemen lingkungan Anda termasuk dasbor. Jika Anda mempersiapkan upgrade dengan benar, instance yang ada, jaringan, dan penyimpanan harus terus beroperasi. Namun, instance mungkin mengalami gangguan jaringan terputus putus (intermittent).

source: Consider updating your SQL server configuration as described in the `Installation Tutorials and Guides <https://docs.openstack.org/rocky/install/>`_.
de: Erwägen Sie, Ihre SQL-Serverkonfiguration zu aktualisieren, wie in den `Installations-Tutorials und Anleitungen <https://docs.openstack.org/rocky/install/>`_ beschrieben.
id: Pertimbangkan memperbarui konfigurasi server SQL Anda seperti yang dijelaskan dalam `Installation Tutorials and Guides <https://docs.openstack.org/rocky/install/>`_.

source: Consider using a public cloud to test the scalability limits of your cloud controller configuration. Most public clouds bill by the hour, which means it can be inexpensive to perform even a test with many nodes.
de: Erwägen Sie die Verwendung einer Public Cloud, um die Skalierbarkeitsgrenzen Ihrer Cloud-Controller-Konfiguration zu testen. Die meisten Public Clouds rechnen stundenweise ab, was bedeutet, dass es kostengünstig sein kann, selbst einen Test mit vielen Knoten durchzuführen.
id: Pertimbangkan untuk menggunakan cloud publik untuk menguji batas skalabilitas konfigurasi pengontrol cloud Anda. Sebagian besar awan publik menagih per jam, yang berarti tidak mahal untuk melakukan bahkan pengujian dengan banyak node.

source: Console (boot up messages) for VM instances:
de: Konsole (Boot-Up-Meldungen) für VM-Instanzen:

source: Container quotas
de: Containerquoten
id: Kuota kontainer

source: Contains a reference listing of all configuration options for core and integrated OpenStack services by release version
de: Enthält eine Referenzliste aller Konfigurationsoptionen für Kern- und integrierte OpenStack-Dienste nach Release-Version

source: Contains each floating IP address that was added to Compute. This table is related to the ``fixed_ips`` table by way of the ``floating_ips.fixed_ip_id`` column.
de: Enthält jede freie IP-Adresse, die zu Compute hinzugefügt wurde. Diese Tabelle bezieht sich auf die Tabelle ``fixed_ips`` über die Spalte ``floating_ips.fixed_ip_id``.
id: Berisi setiap alamat IP mengambang (floating IP) yang ditambahkan ke Compute. Tabel ini terkait dengan tabel ``fix_ips`` melalui kolom ``floating_ips.fixed_ip_id``.

source: Contains each possible IP address for the subnet(s) added to Compute. This table is related to the ``instances`` table by way of the ``fixed_ips.instance_uuid`` column.
de: Enthält jede mögliche IP-Adresse für die Subnetze, die zu Compute hinzugefügt wurden. Diese Tabelle bezieht sich auf die Tabelle ``instances`` über die Spalte `fixed_ips.instance_uuuid``.
id: Berisi setiap kemungkinan alamat IP untuk subnet yang ditambahkan ke Compute. Tabel ini terkait dengan tabel ``instance`` melalui kolom ``fixed_ips.instance_uuid``.

source: Contains guidelines for designing an OpenStack cloud
de: Enthält Richtlinien für das Design einer OpenStack-Cloud

source: Contains how-to information for managing an OpenStack cloud as needed for your use cases, such as storage, computing, or software-defined-networking
de: Enthält Anleitungsinformationen für die Verwaltung einer OpenStack-Cloud, die für Ihre Anwendungsfälle wie Speicher, Computer oder softwaredefinierte Netzwerke erforderlich sind

source: Contents
de: Inhalt
id: Isi

source: Continuing the diagnosis the next morning was kick started by another identical failure. We quickly got the message queue running again, and tried to work out why Rabbit was suffering from so much network traffic. Enabling debug logging on nova-api quickly brought understanding. A ``tail -f /var/log/nova/nova-api.log`` was scrolling by faster than we'd ever seen before. CTRL+C on that and we could plainly see the contents of a system log spewing failures over and over again - a system log from one of our users' instances.
de: Die Fortsetzung der Diagnose am nächsten Morgen wurde durch einen weiteren identischen Fehler ausgelöst. Wir haben schnell die Nachrichtenwarteschlange wieder in Betrieb genommen und versucht herauszufinden, warum Rabbit unter so viel Netzwerkverkehr litt. Die Aktivierung der Debug-Protokollierung auf nova-api brachte schnell Verständnis. Ein ``tail -f /var/log/nova/nova/nova-api.log`` scrollte schneller als wir es je zuvor gesehen hatten. STRG+C daraufhin und wir konnten den Inhalt eines Systemprotokolls, das Fehler aufwies, immer wieder deutlich sehen - ein Systemprotokoll aus einer der Instanzen unserer Benutzer.
id: Melanjutkan diagnosis keesokan paginya tendangan dimulai (kick started) oleh kegagalan lain yang identik. Kami dengan cepat menjalankan antrean pesan lagi, dan mencoba mencari tahu mengapa Rabbit menderita begitu banyak lalu lintas jaringan. Mengaktifkan debug logging di nova-api dengan cepat membawa pemahaman. ``tail -f /var/log/nova/nova-api.log`` bergulir lebih cepat dari yang pernah kami lihat sebelumnya. CTRL+C untuk itu dan kita bisa melihat dengan jelas isi dari kegagalan log sistem yang memuntahkan berulang-ulang - log sistem dari salah satu instance pengguna kami.

source: Copy contents of configuration backup directories that you created during the upgrade process back to ``/etc/<service>`` directory.
de: Kopieren Sie den Inhalt der Konfigurations-Backup-Verzeichnisse, die Sie während des Upgrade-Prozesses erstellt haben, zurück in das Verzeichnis ``/etc/<service>``.
id: Salin konten direktori cadangan konfigurasi yang Anda buat selama proses upgrade kembali ke ``/etc/<service>`` directory.
