Repository: openstack/operations-guide
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: de, id

source: While instance information is stored in a number of database tables, the table you most likely need to look at in relation to user instances is the instances table.
de: Während Instanzinformationen in einer Reihe von Datenbanktabellen gespeichert sind, ist die Tabelle, die Sie am ehesten in Bezug auf Benutzerinstanzen betrachten müssen, die Instanztabelle.

source: While monitoring system resources, I noticed a significant increase in memory consumption while the EC2 API processed this request. I thought it wasn't handling memory properly—possibly not releasing memory. If the API received several of these requests, memory consumption quickly grew until the system ran out of RAM and began using swap. Each node has 48 GB of RAM and the "nova-api" process would consume all of it within minutes. Once this happened, the entire system would become unusably slow until I restarted the nova-api service.
de: Während der Überwachung der Systemressourcen bemerkte ich einen signifikanten Anstieg des Speicherverbrauchs, während die EC2-API diese Anfrage verarbeitete. Ich dachte, es handhabt den Speicher nicht richtig - möglicherweise wird der Speicher nicht freigegeben. Wenn die API mehrere dieser Anfragen erhielt, wuchs der Speicherverbrauch schnell, bis dem System der Arbeitsspeicher ausging und Swap zu verwenden begann. Jeder Knoten verfügt über 48 GB RAM und der "nova-api"-Prozess würde ihn innerhalb von Minuten vollständig verbrauchen. Dann würde das gesamte System unbrauchbar langsam werden, bis ich den nova-api-Dienst neu gestartet habe.
id: Saat memantau sumber daya sistem, saya melihat peningkatan konsumsi memori yang signifikan sementara EC2 API memproses permintaan ini. Saya pikir itu tidak menangani memori dengan benar — mungkin tidak melepaskan memori. Jika API menerima beberapa permintaan ini, konsumsi memori cepat tumbuh hingga sistem kehabisan RAM dan mulai menggunakan swap. Setiap node memiliki 48 GB RAM dan proses "nova-api" akan menghabiskan semuanya dalam beberapa menit. Setelah ini terjadi, seluruh sistem akan menjadi sangat lambat sampai saya me-restart layanan nova-api.

source: While several resources already exist to help with deploying and installing OpenStack, it's very important to make sure that you have your deployment planned out ahead of time. This guide presumes that you have set aside a rack for the OpenStack cloud but also offers suggestions for when and what to scale.
de: Obwohl es bereits mehrere Ressourcen gibt, die bei der Bereitstellung und Installation von OpenStack helfen, ist es sehr wichtig, sicherzustellen, dass Sie Ihre Bereitstellung frühzeitig planen lassen. Dieser Leitfaden geht davon aus, dass Sie ein Rack für die OpenStack-Cloud reserviert haben, bietet aber auch Vorschläge, wann und was Sie skalieren sollten.
id: Sementara beberapa sumber daya sudah ada untuk membantu dalam menggunakan dan menginstal OpenStack, sangat penting untuk memastikan bahwa Anda memiliki penyebaran yang direncanakan sebelumnya. Panduan ini mengandaikan bahwa Anda telah menyiapkan rak untuk cloud OpenStack tetapi juga menawarkan saran kapan dan apa untuk skala.

source: While the command should work with any hypervisor that is controlled through libvirt (KVM, QEMU, or LXC), it has been tested only with KVM. Here is the example output when the hypervisor is KVM:
de: Der Befehl sollte zwar mit jedem Hypervisor funktionieren, der über libvirt gesteuert wird (KVM, QEMU oder LXC), wurde aber nur mit KVM getestet. Hier ist die exemplarische Ausgabe, wenn der Hypervisor KVM ist:
id: Sementara perintah harus bekerja dengan hypervisor apa pun yang dikontrol melalui libvirt (KVM, QEMU, atau LXC), itu telah diuji hanya dengan KVM. Berikut adalah contoh output ketika hypervisor adalah KVM:

source: While we'd always recommend using your automated deployment system to reinstall systems from scratch, sometimes you do need to remove OpenStack from a system the hard way. Here's how:
de: Obwohl wir immer empfehlen würden, Ihr automatisiertes Bereitstellungssystem zu verwenden, um Systeme von Grund auf neu zu installieren, müssen Sie OpenStack manchmal auf die harte Tour aus einem System entfernen. Hier ist die Vorgehensweise:
id: Meskipun kami selalu merekomendasikan menggunakan sistem penyebaran otomatis Anda untuk menginstal ulang sistem dari awal, kadang-kadang Anda harus menghapus OpenStack dari sistem dengan cara yang sulit. Begini caranya:

source: While you might end up with unused partitions, such as partition 1 in disk three and four of this example, this option allows for maximum utilization of disk space. I/O performance might be an issue as a result of all disks being used for all tasks.
de: Während Sie in diesem Beispiel mit unbenutzten Partitionen enden können, wie z.B. Partition 1 in Laufwerk drei und vier, ermöglicht diese Option eine maximale Nutzung des Festplattenspeichers. Die I/O-Leistung kann ein Problem darstellen, da alle Festplatten für alle Aufgaben verwendet werden.
id: Meskipun Anda mungkin berakhir dengan partisi yang tidak digunakan, seperti partisi 1 di disk tiga dan empat dari contoh ini, opsi ini memungkinkan pemanfaatan ruang disk secara maksimal. Kinerja I/O mungkin menjadi masalah karena semua disk digunakan untuk semua tugas.

source: Who This Book Is For
de: Für wen dieses Buch bestimmt ist

source: Who uses it: DAIR is an integrated virtual environment that leverages the CANARIE network to develop and test new information communication technology (ICT) and other digital technologies. It combines such digital infrastructure as advanced networking and cloud computing and storage to create an environment for developing and testing innovative ICT applications, protocols, and services; performing at-scale experimentation for deployment; and facilitating a faster time to market.
de: Wer es benutzt: DAIR ist eine integrierte virtuelle Umgebung, die das CANARIE-Netzwerk nutzt, um neue Informations- und Kommunikationstechnologien (ICT) und andere digitale Technologien zu entwickeln und zu testen. Es kombiniert digitale Infrastrukturen wie fortschrittliche Netzwerke und Cloud Computing und Storage, um eine Umgebung für die Entwicklung und den Test innovativer IKT-Anwendungen, -Protokolle und -Dienste zu schaffen, maßstabsgetreue Experimente zur Bereitstellung durchzuführen und eine schnellere Markteinführung zu ermöglichen.
id: Siapa yang menggunakannya: DAIR adalah lingkungan virtual terintegrasi yang memanfaatkan jaringan CANARIE untuk mengembangkan dan menguji t information communication technology (ICT) dan teknologi digital lainnya. Ini menggabungkan infrastruktur digital seperti jaringan dan komputasi awan serta penyimpanan canggih untuk menciptakan lingkungan untuk mengembangkan dan menguji aplikasi ICT, protokol, dan layanan yang inovatif; melakukan eksperimen at-scale untuk pengerahan; dan memfasilitasi waktu yang lebih cepat ke pasar.

source: Who uses it: researchers at CERN (European Organization for Nuclear Research) conducting high-energy physics research.
de: Wer es benutzt: Forscher am CERN (European Organization for Nuclear Research), die Hochenergiephysik forschen.
id: Siapa yang menggunakannya: peneliti di CERN (European Organization for Nuclear Research) yang melakukan penelitian fisika energi tinggi.

source: Who uses it: researchers from the Australian publicly funded research sector. Use is across a wide variety of disciplines, with the purpose of instances ranging from running simple web servers to using hundreds of cores for high-throughput computing.
de: Wer es nutzt: Forscher aus dem australischen öffentlich finanzierten Forschungssektor. Die Nutzung erfolgt in einer Vielzahl von Disziplinen, mit dem Ziel, Fälle zu vermeiden, die vom Betrieb einfacher Webserver bis hin zur Nutzung Hunderter von Kernen für Hochdurchsatz-Computing reichen.
id: Siapa yang menggunakannya: peneliti dari sektor penelitian yang didanai publik Australia. Penggunaannya melintasi berbagai disiplin ilmu, dengan tujuan mulai dari menjalankan server web sederhana hingga menggunakan ratusan core untuk komputasi high-throughput.

source: Who uses it: researchers from the MIT Computer Science and Artificial Intelligence Lab.
de: Wer es benutzt: Forscher vom MIT Computer Science and Artificial Intelligence Lab.
id: Siapa yang menggunakannya: peneliti dari MIT Computer Science and Artificial Intelligence Lab.

source: Why and How We Wrote This Book
de: Warum und wie wir dieses Buch geschrieben haben

source: Windows XP and later releases include a Volume Shadow Copy Service (VSS) which provides a framework so that compliant applications can be consistently backed up on a live filesystem. To use this framework, a VSS requestor is run that signals to the VSS service that a consistent backup is needed. The VSS service notifies compliant applications (called VSS writers) to quiesce their data activity. The VSS service then tells the copy provider to create a snapshot. Once the snapshot has been made, the VSS service unfreezes VSS writers and normal I/O activity resumes.
de: Windows XP und spätere Versionen enthalten einen Volume Shadow Copy Service (VSS), der ein Framework bietet, mit dem konforme Anwendungen konsistent auf einem Live-Dateisystem gesichert werden können. Um dieses Framework zu nutzen, wird ein VSS-Requester ausgeführt, der dem VSS-Dienst signalisiert, dass ein konsistentes Backup benötigt wird. Der VSS-Dienst benachrichtigt konforme Anwendungen (sogenannte VSS-Schreiber), um ihre Datenaktivität zu unterbinden. Der VSS-Dienst weist den Kopierdienstleister dann an, eine Schattenkopie zu erstellen. Sobald die Schattenkopie erstellt wurde, deaktiviert der VSS-Dienst die VSS-Schreiber und setzt die normale I/O-Aktivität fort.

source: With ``nova-network``, the nova database table contains a few tables with networking information:
de: Bei ``nova-network`` enthält die nova-Datenbanktabelle einige Tabellen mit Netzwerkinformationen:
id: Dengan ``nova-network``, tabel database nova berisi beberapa tabel dengan informasi jaringan:

source: With our upgrade to Grizzly in August 2013, we moved to OpenStack Networking, neutron (quantum at the time). Compute nodes have two-gigabit network interfaces and a separate management card for IPMI management. One network interface is used for node-to-node communications. The other is used as a trunk port for OpenStack managed VLANs. The controller node uses two bonded 10g network interfaces for its public IP communications. Big pipes are used here because images are served over this port, and it is also used to connect to iSCSI storage, back-ending the image storage and database. The controller node also has a gigabit interface that is used in trunk mode for OpenStack managed VLAN traffic. This port handles traffic to the dhcp-agent and metadata-proxy.
de: Mit unserem Upgrade auf Grizzly im August 2013 wechselten wir zu OpenStack Networking, Neutron (damals noch Quantum). Compute-Knoten verfügen über zwei Gigabit-Netzwerkschnittstellen und eine separate Management-Karte für das IPMI-Management. Eine Netzwerkschnittstelle wird für die Knoten-zu-Knoten-Kommunikation verwendet. Der andere wird als Trunk-Port für OpenStack-verwaltete VLANs verwendet. Der Steuerungsknoten verwendet für seine öffentliche IP-Kommunikation zwei verbundene 10g-Netzwerkschnittstellen. Big Pipes werden hier verwendet, weil Abbilder über diesen Port bereitgestellt werden, und es wird auch verwendet, um eine Verbindung zum iSCSI-Speicher herzustellen und den Abbildspeicher und die Datenbank zu hinterlegen. Der Controller-Knoten verfügt auch über eine Gigabit-Schnittstelle, die im Trunk-Modus für den von OpenStack verwalteten VLAN-Verkehr verwendet wird. Dieser Port verwaltet den Datenverkehr mit dem DHCP-Agenten und dem Metadaten-Proxy.
id: Dengan peningkatan kami ke Grizzly pada Agustus 2013, kami pindah ke OpenStack Networking, neutron (kuantum pada saat itu). Compute nodes memiliki antarmuka jaringan dua gigabit dan kartu manajemen yang terpisah untuk manajemen IPMI. Satu antarmuka jaringan digunakan untuk komunikasi node-to-node. Yang lain digunakan sebagai port trunk untuk VLAN yang dikelola OpenStack. Node pengontrol menggunakan dua antarmuka jaringan 10g terikat untuk komunikasi IP publiknya. Pipa besar digunakan di sini karena image disajikan melalui port ini, dan juga digunakan untuk terhubung ke penyimpanan iSCSI, back-ending penyimpanan image dan basis data. Node pengontrol juga memiliki antarmuka gigabit yang digunakan dalam mode trunk untuk lalu lintas VLAN yang dikelola OpenStack. Port ini menangani lalu lintas ke agen dhcp dan metadata-proxy.

source: With the exception of Object Storage, upgrading from one version of OpenStack to another can take a great deal of effort. This chapter provides some guidance on the operational aspects that you should consider for performing an upgrade for an OpenStack environment.
de: Mit Ausnahme von Object Storage kann das Upgrade von einer Version von OpenStack auf eine andere sehr aufwendig sein. Dieses Kapitel enthält einige Hinweise zu den betrieblichen Aspekten, die Sie bei einem Upgrade für eine OpenStack-Umgebung berücksichtigen sollten.
id: Dengan pengecualian Object Storage, memutakhirkan dari satu versi OpenStack ke yang lain dapat membutuhkan banyak usaha. Bab ini memberikan beberapa panduan tentang aspek operasional yang harus Anda pertimbangkan untuk melakukan peningkatan (upgrade) untuk lingkungan OpenStack.

source: With the introduction of the full software-defined networking stack provided by OpenStack Networking (neutron) in the Folsom release, development effort on the initial networking code that remains part of the Compute component has gradually lessened. While many still use ``nova-network`` in production, there has been a long-term plan to remove the code in favor of the more flexible and full-featured OpenStack Networking.
de: Mit der Einführung des vollständigen softwaredefinierten Netzwerkstacks von OpenStack Networking (Neutron) in der Folsom-Version hat sich der Entwicklungsaufwand für den anfänglichen Netzwerkcode, der Teil der Compute-Komponente bleibt, allmählich verringert. Während viele von ihnen immer noch ``Nova-Netzwerk`` in der Produktion verwenden, gibt es einen langfristigen Plan, den Code zugunsten des flexibleren und vollwertigeren OpenStack-Netzwerks zu entfernen.
id: Dengan diperkenalkannya full software-defined networking stack (tumpukan jaringan yang ditentukan oleh perangkat lunak lengkap) yang disediakan oleh OpenStack Networking (neutron) dalam rilis Folsom, upaya pengembangan pada kode jaringan awal yang tetap menjadi bagian dari komponen Compute secara bertahap berkurang. Sementara banyak yang masih menggunakan ``nova-network`` dalam produksi, telah ada rencana jangka panjang untuk menghapus kode yang mendukung OpenStack Networking yang lebih fleksibel dan berfitur lengkap.

source: With these two tables, you now have a good overview of what servers and services make up your cloud.
de: Mit diesen beiden Tabellen haben Sie nun einen guten Überblick darüber, aus welchen Servern und Diensten Ihre Cloud besteht.
id: Dengan dua tabel ini, Anda sekarang memiliki gambaran umum yang baik tentang server dan layanan apa yang membentuk cloud Anda.

source: With this information in hand, we were sure that the problem had to do with DHCP. We thought that for some reason, the instance wasn't getting a new IP address and with no IP, it shut itself off from the network.
de: Mit diesen Informationen waren wir sicher, dass das Problem mit DHCP zu tun hatte. Wir dachten, dass die Instanz aus irgendeinem Grund keine neue IP-Adresse erhält und ohne IP-Adresse sich vom Netzwerk abschaltet.
id: Dengan informasi ini di tangan, kami yakin bahwa masalahnya ada pada DHCP. Kami berpikir bahwa karena alasan tertentu, mesin virtual tidak mendapatkan alamat IP baru dan tanpa IP, itu mematikan sendiri dari jaringan.

source: With this option, you can assign different partitions to different RAID arrays. You can allocate partition 1 of disk one and two to the ``/boot`` partition mirror. You can make partition 2 of all disks the root partition mirror. You can use partition 3 of all disks for a ``cinder-volumes`` LVM partition running on a RAID 10 array.
de: Mit dieser Option können Sie verschiedenen RAID-Arrays verschiedene Partitionen zuweisen. Sie können die Partition 1 der Festplatte eins und zwei dem Partitions-Spiegel ``/boot`` zuordnen. Sie können die Partition 2 aller Festplatten zum Root-Partitionsspiegel machen. Sie können die Partition 3 aller Festplatten für eine ``cinder-volumes`` LVM-Partition verwenden, die auf einem RAID 10-Array läuft.
id: Dengan opsi ini, Anda dapat menetapkan partisi yang berbeda untuk array RAID yang berbeda. Anda dapat mengalokasikan partisi 1 disk satu dan dua ke cermin partisi ``/boot`` . Anda dapat menjadikan partisi 2 dari semua disk sebagai partisi root. Anda dapat menggunakan partisi 3 dari semua disk untuk partisi LVM ``cinder-volume`` yang berjalan pada array RAID 10.

source: Within this scope, you must complete these steps to successfully roll back your environment:
de: In diesem Rahmen müssen Sie diese Schritte ausführen, um Ihre Umgebung erfolgreich zurückzusetzen:
id: Dalam lingkup ini, Anda harus menyelesaikan langkah-langkah ini untuk berhasil mengembalikan lingkungan Anda:

source: Without interaction with share networks, in so called "no share servers" mode.
de: Ohne Interaktion mit Freigabenetzwerken, im sogenannten "no share servers"-Modus.

source: Without upgrade levels, an X+1 version Compute service can receive and understand X version RPC messages, but it can only send out X+1 version RPC messages. For example, if a nova-conductor process has been upgraded to X+1 version, then the conductor service will be able to understand messages from X version nova-compute processes, but those compute services will not be able to understand messages sent by the conductor service.
de: Ohne Upgrade-Level kann ein X+1 Version Compute Service X Version RPC-Nachrichten empfangen und verstehen, aber er kann nur X+1 Version RPC-Nachrichten senden. Wenn beispielsweise ein nova-conductor-Prozess auf die X+1-Version aktualisiert wurde, dann kann der Conductor-Service Nachrichten von nova-compute-Prozessen der X-Version verstehen, aber diese Compute-Services können die vom Conductor-Service gesendeten Nachrichten nicht verstehen.
id: Tanpa tingkat upgrade, layanan Compute versi X + 1 dapat menerima dan memahami pesan RPC versi X, tetapi hanya dapat mengirim pesan RPC versi X+1. Misalnya, jika proses nova-conductor telah ditingkatkan ke versi X+1, maka layanan konduktor akan dapat memahami pesan dari proses penghitungan nova versi X, tetapi layanan komputasi tersebut tidak akan dapat memahami pesan yang dikirim oleh layanan konduktor.

source: Working directly with the database and SQL queries can provide you with custom lists and reports of images. Technically, you can update properties about images through the database, although this is not generally recommended.
de: Die direkte Arbeit mit der Datenbank und SQL-Abfragen kann Ihnen benutzerdefinierte Listen und Berichte über Abbilder liefern. Technisch gesehen können Sie Eigenschaften von Abbildern über die Datenbank aktualisieren, obwohl dies im Allgemeinen nicht empfohlen wird.
id: Bekerja secara langsung dengan database dan kueri SQL dapat memberi Anda daftar dan laporan khusus dari image. Secara teknis, Anda dapat memperbarui properti tentang image melalui database, meskipun ini umumnya tidak disarankan.

source: Working from the physical interface inwards, we can see the chain of ports and bridges. First, the bridge ``eth1-br``, which contains the physical network interface ``eth1`` and the virtual interface ``phy-eth1-br``:
de: Wenn wir von der physischen Schnittstelle nach innen arbeiten, können wir die Kette der Ports und Brücken sehen. Zuerst die Brücke ``eth1-br``, die die physikalische Netzwerkschnittstelle ``eth1`` und die virtuelle Schnittstelle ``phy-eth1-br`` enthält:
id: Bekerja dari antarmuka fisik ke dalam, kita dapat melihat rantai port dan jembatan. Pertama, jembatan ``eth1-br``, yang berisi antarmuka jaringan fisik ``eth1`` dan antarmuka virtual ``phy-eth1-br``:

source: Working with Hardware
de: Arbeiten mit Hardware
id: Bekerja dengan Perangkat Keras

source: Working with Roadmaps
de: Arbeiten mit Plänen
id: Bekerja dengan Roadmap

source: Write out "dirty" buffers to disk, similar to the Linux ``sync`` operation.
de: Schreiben Sie "schmutzige" Puffer auf die Festplatte, ähnlich wie bei der Linux-Operation ``sync``.

source: You *must mount the file system* before you run the :command:`fsfreeze` command.
de: Sie müssen das Dateisystem *mounten*, bevor Sie den Befehl :command:`fsfsfreeze` ausführen.

source: You also can add and remove the security services to the share network.
de: Sie können auch die Sicherheitsdienste zum Freigabennetzwerk hinzufügen und entfernen.

source: You also can see detailed information about the share network including ``network_type, segmentation_id`` fields:
de: Sie können auch detaillierte Informationen über das Freigabenetzwerk sehen, einschließlich der Felder ``network_type`` und ``segmentation_id``:

source: You are prompted for a project name and an optional, but recommended, description. Select the check box at the bottom of the form to enable this project. By default, it is enabled, as shown below:
de: Sie werden nach einem Projektnamen und einer optionalen, aber empfohlenen Beschreibung gefragt. Aktivieren Sie das Kontrollkästchen am unteren Rand des Formulars, um dieses Projekt zu aktivieren. Standardmäßig ist es aktiviert, wie unten gezeigt:
id: Anda diminta untuk nama proyek dan deskripsi opsional, tetapi disarankan. Pilih kotak centang di bagian bawah formulir untuk mengaktifkan proyek ini. Secara default, ini diaktifkan, seperti yang ditunjukkan di bawah ini:

source: You can also `manage projects, users, and roles <https://docs.openstack.org/admin-guide/cli-manage-projects-users-and-roles.html>`_ from the command-line clients.
de: Sie können auch `Projekte, Benutzer und Rollen <https://docs.openstack.org/admin-guide/cli-manage-projects-users-and-roles.html>`_ über die Befehlszeilen-Clients verwalten.

source: You can also restore backed-up nova directories:
de: Sie können auch gesicherte nova-Verzeichnisse wiederherstellen:
id: Anda juga dapat mengembalikan direktori nova yang didukung:

source: You can also specify block deviceblock device mapping at instance boot time through the nova command-line client with this option set:
de: Sie können auch die Gerätezuordnung von Blockdeviceblocks beim Booten der Instanz über den nova-Kommandozeilen-Client mit dieser Option festlegen:

source: You can also use the Identity service (keystone) to see what services are available in your cloud as well as what endpoints have been configured for the services.
de: Sie können auch den Identitätsdienst (Keystone) verwenden, um zu sehen, welche Dienste in Ihrer Cloud verfügbar sind und welche Endpunkte für die Dienste konfiguriert wurden.
id: Anda juga dapat menggunakan layanan Identity (keystone) untuk melihat layanan apa yang tersedia di cloud Anda serta endpoint apa yang telah dikonfigurasi untuk layanan tersebut.

source: You can attach block storage to instances from the dashboard on the :guilabel:`Volumes` page. Click the :guilabel:`Manage Attachments` action next to the volume you want to attach.
de: Sie können Blockspeicher an Instanzen aus dem Dashboard auf der Seite :guilabel:`Volumes` anhängen. Klicken Sie auf die Aktion :guilabel:`Anhänge verwalten` neben dem Volume, das Sie anhängen möchten.
